; ModuleID = 'gemm.bc'
source_filename = "gemm.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@result = dso_local global [10 x i32] zeroinitializer, align 16, !dbg !0
@arr_ref = dso_local global i32* null, align 8, !dbg !8
@arr_val = dso_local global i32* null, align 8, !dbg !12
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !14
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !19
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !21
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !23
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !25
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!219 = !DILocalVariable(name: "mat2", arg: 2, scope: !214, file: !3, line: 40, type: !137)
!220 = !DILocation(line: 40, column: 61, scope: !214)
!221 = !DILocalVariable(name: "res", arg: 3, scope: !214, file: !3, line: 40, type: !137)
!222 = !DILocation(line: 40, column: 87, scope: !214)
!223 = !DILocalVariable(name: "i", scope: !224, file: !3, line: 41, type: !40)
!224 = distinct !DILexicalBlock(scope: !214, file: !3, line: 41, column: 5)
!225 = !DILocation(line: 41, column: 14, scope: !224)
!226 = !DILocation(line: 41, column: 10, scope: !224)
!227 = !DILocation(line: 41, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !224, file: !3, line: 41, column: 5)
!229 = !DILocation(line: 41, column: 23, scope: !228)
!230 = !DILocation(line: 41, column: 5, scope: !224)
!231 = !DILocalVariable(name: "j", scope: !232, file: !3, line: 42, type: !40)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 42, column: 9)
!233 = distinct !DILexicalBlock(scope: !228, file: !3, line: 41, column: 35)
!234 = !DILocation(line: 42, column: 18, scope: !232)
!235 = !DILocation(line: 42, column: 14, scope: !232)
!236 = !DILocation(line: 42, column: 25, scope: !237)
!237 = distinct !DILexicalBlock(scope: !232, file: !3, line: 42, column: 9)
!238 = !DILocation(line: 42, column: 27, scope: !237)
!239 = !DILocation(line: 42, column: 9, scope: !232)
!240 = !DILocalVariable(name: "k", scope: !241, file: !3, line: 43, type: !40)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 43, column: 13)
!242 = distinct !DILexicalBlock(scope: !237, file: !3, line: 42, column: 39)
!243 = !DILocation(line: 43, column: 22, scope: !241)
!244 = !DILocation(line: 43, column: 18, scope: !241)
!245 = !DILocation(line: 43, column: 29, scope: !246)
!246 = distinct !DILexicalBlock(scope: !241, file: !3, line: 43, column: 13)
!247 = !DILocation(line: 43, column: 31, scope: !246)
!248 = !DILocation(line: 43, column: 13, scope: !241)
!249 = !DILocation(line: 44, column: 42, scope: !250)
!250 = distinct !DILexicalBlock(scope: !246, file: !3, line: 43, column: 43)
!251 = !DILocation(line: 44, column: 34, scope: !250)
!252 = !DILocation(line: 44, column: 45, scope: !250)
!253 = !DILocation(line: 44, column: 58, scope: !250)
!254 = !DILocation(line: 44, column: 50, scope: !250)
!255 = !DILocation(line: 44, column: 61, scope: !250)
!256 = !DILocation(line: 44, column: 48, scope: !250)
!257 = !DILocation(line: 44, column: 25, scope: !250)
!258 = !DILocation(line: 44, column: 17, scope: !250)
!259 = !DILocation(line: 44, column: 28, scope: !250)
!260 = !DILocation(line: 44, column: 31, scope: !250)
!261 = !DILocation(line: 43, column: 39, scope: !246)
!262 = !DILocation(line: 43, column: 13, scope: !246)
!263 = distinct !{!263, !248, !264}
!264 = !DILocation(line: 45, column: 13, scope: !241)
!265 = !DILocation(line: 42, column: 35, scope: !237)
!266 = !DILocation(line: 42, column: 9, scope: !237)
!267 = distinct !{!267, !239, !268}
!268 = !DILocation(line: 46, column: 9, scope: !232)
!269 = !DILocation(line: 41, column: 31, scope: !228)
!270 = !DILocation(line: 41, column: 5, scope: !228)
!271 = distinct !{!271, !230, !272}
!272 = !DILocation(line: 47, column: 5, scope: !224)
!273 = !DILocalVariable(name: "i", scope: !274, file: !3, line: 48, type: !40)
!274 = distinct !DILexicalBlock(scope: !214, file: !3, line: 48, column: 5)
!275 = !DILocation(line: 48, column: 13, scope: !274)
!276 = !DILocation(line: 48, column: 9, scope: !274)
!277 = !DILocation(line: 48, column: 18, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !3, line: 48, column: 5)
!279 = !DILocation(line: 48, column: 19, scope: !278)
!280 = !DILocation(line: 48, column: 5, scope: !274)
!281 = !DILocalVariable(name: "j", scope: !282, file: !3, line: 49, type: !40)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 49, column: 9)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 48, column: 28)
!284 = !DILocation(line: 49, column: 17, scope: !282)
!285 = !DILocation(line: 49, column: 13, scope: !282)
!286 = !DILocation(line: 49, column: 21, scope: !287)
!287 = distinct !DILexicalBlock(scope: !282, file: !3, line: 49, column: 9)
!288 = !DILocation(line: 49, column: 22, scope: !287)
!289 = !DILocation(line: 0, scope: !278)
!290 = !DILocation(line: 49, column: 9, scope: !282)
!291 = !DILocation(line: 50, column: 37, scope: !292)
!292 = distinct !DILexicalBlock(scope: !287, file: !3, line: 49, column: 31)
!293 = !DILocation(line: 50, column: 48, scope: !292)
!294 = !DILocation(line: 50, column: 26, scope: !292)
!295 = !DILocation(line: 50, column: 27, scope: !292)
!296 = !DILocation(line: 50, column: 32, scope: !292)
!297 = !DILocation(line: 50, column: 31, scope: !292)
!298 = !DILocation(line: 50, column: 13, scope: !292)
!299 = !DILocation(line: 50, column: 35, scope: !292)
!300 = !DILocation(line: 49, column: 28, scope: !287)
!301 = !DILocation(line: 49, column: 9, scope: !287)
!302 = distinct !{!302, !290, !303}
!303 = !DILocation(line: 51, column: 9, scope: !282)
!304 = !DILocation(line: 48, column: 25, scope: !278)
!305 = !DILocation(line: 48, column: 5, scope: !278)
!306 = distinct !{!306, !280, !307}
!307 = !DILocation(line: 52, column: 5, scope: !274)
!308 = !DILocation(line: 53, column: 5, scope: !214)
!309 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 56, type: !310, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!310 = !DISubroutineType(types: !311)
!311 = !{!10, !312}
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !313, line: 17, size: 320, flags: DIFlagTypePassByValue, elements: !314, identifier: "_ZTS5INSTR")
!313 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !312, file: !313, line: 18, baseType: !11, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !312, file: !313, line: 19, baseType: !11, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !312, file: !313, line: 20, baseType: !11, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !312, file: !313, line: 21, baseType: !319, size: 192, offset: 128)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !313, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !320, identifier: "_ZTS15GEMM_STRUCT_REF")
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !319, file: !313, line: 6, baseType: !10, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !319, file: !313, line: 7, baseType: !10, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !319, file: !313, line: 8, baseType: !10, size: 64, offset: 128)
!324 = !DILocalVariable(name: "instr", arg: 1, scope: !309, file: !3, line: 56, type: !312)
!325 = !DILocation(line: 56, column: 35, scope: !309)
!326 = !DILocalVariable(name: "inp", scope: !309, file: !3, line: 58, type: !138)
!327 = !DILocation(line: 58, column: 18, scope: !309)
!328 = !DILocalVariable(name: "wgt", scope: !309, file: !3, line: 58, type: !138)
!329 = !DILocation(line: 58, column: 26, scope: !309)
!330 = !DILocalVariable(name: "i", scope: !331, file: !3, line: 59, type: !40)
!331 = distinct !DILexicalBlock(scope: !309, file: !3, line: 59, column: 5)
!332 = !DILocation(line: 59, column: 14, scope: !331)
!333 = !DILocation(line: 59, column: 10, scope: !331)
!334 = !DILocation(line: 59, column: 18, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !3, line: 59, column: 5)
!336 = !DILocation(line: 59, column: 19, scope: !335)
!337 = !DILocation(line: 59, column: 5, scope: !331)
!338 = !DILocation(line: 60, column: 26, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !3, line: 59, column: 26)
!340 = !DILocation(line: 60, column: 35, scope: !339)
!341 = !DILocation(line: 60, column: 43, scope: !339)
!342 = !DILocation(line: 60, column: 42, scope: !339)
!343 = !DILocation(line: 60, column: 18, scope: !339)
!344 = !DILocation(line: 60, column: 13, scope: !339)
!345 = !DILocation(line: 60, column: 9, scope: !339)
!346 = !DILocation(line: 60, column: 16, scope: !339)
!347 = !DILocation(line: 59, column: 23, scope: !335)
!348 = !DILocation(line: 59, column: 5, scope: !335)
!349 = distinct !{!349, !337, !350}
!350 = !DILocation(line: 61, column: 5, scope: !331)
!351 = !DILocalVariable(name: "i", scope: !352, file: !3, line: 62, type: !40)
!352 = distinct !DILexicalBlock(scope: !309, file: !3, line: 62, column: 5)
!353 = !DILocation(line: 62, column: 14, scope: !352)
!354 = !DILocation(line: 62, column: 10, scope: !352)
!355 = !DILocation(line: 62, column: 18, scope: !356)
!356 = distinct !DILexicalBlock(scope: !352, file: !3, line: 62, column: 5)
!357 = !DILocation(line: 62, column: 19, scope: !356)
!358 = !DILocation(line: 62, column: 5, scope: !352)
!359 = !DILocation(line: 63, column: 26, scope: !360)
!360 = distinct !DILexicalBlock(scope: !356, file: !3, line: 62, column: 26)
!361 = !DILocation(line: 63, column: 35, scope: !360)
!362 = !DILocation(line: 63, column: 43, scope: !360)
!363 = !DILocation(line: 63, column: 42, scope: !360)
!364 = !DILocation(line: 63, column: 18, scope: !360)
!365 = !DILocation(line: 63, column: 13, scope: !360)
!366 = !DILocation(line: 63, column: 9, scope: !360)
!367 = !DILocation(line: 63, column: 16, scope: !360)
!368 = !DILocation(line: 62, column: 23, scope: !356)
!369 = !DILocation(line: 62, column: 5, scope: !356)
!370 = distinct !{!370, !358, !371}
!371 = !DILocation(line: 64, column: 5, scope: !352)
!372 = !DILocalVariable(name: "arr_ref", scope: !309, file: !3, line: 65, type: !10)
!373 = !DILocation(line: 65, column: 20, scope: !309)
!374 = !DILocation(line: 65, column: 45, scope: !309)
!375 = !DILocation(line: 65, column: 49, scope: !309)
!376 = !DILocation(line: 65, column: 30, scope: !309)
!377 = !DILocation(line: 66, column: 12, scope: !309)
!378 = !DILocation(line: 66, column: 5, scope: !309)
!379 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 69, type: !380, scopeLine: 70, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!380 = !DISubroutineType(types: !381)
!381 = !{!10, !382}
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !313, line: 24, size: 192, flags: DIFlagTypePassByValue, elements: !383, identifier: "_ZTS9INSTR_VAL")
!383 = !{!384, !385, !386, !387}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !382, file: !313, line: 25, baseType: !11, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !382, file: !313, line: 26, baseType: !11, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !382, file: !313, line: 27, baseType: !11, size: 32, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !382, file: !313, line: 28, baseType: !388, size: 96, offset: 96)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !313, line: 11, size: 96, flags: DIFlagTypePassByValue, elements: !389, identifier: "_ZTS15GEMM_STRUCT_VAL")
!389 = !{!390, !391, !392}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !388, file: !313, line: 12, baseType: !11, size: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !388, file: !313, line: 13, baseType: !11, size: 32, offset: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !388, file: !313, line: 14, baseType: !11, size: 32, offset: 64)
!393 = !DILocalVariable(name: "instr", arg: 1, scope: !379, file: !3, line: 69, type: !382)
!394 = !DILocation(line: 69, column: 43, scope: !379)
!395 = !DILocalVariable(name: "inp", scope: !379, file: !3, line: 71, type: !138)
!396 = !DILocation(line: 71, column: 18, scope: !379)
!397 = !DILocalVariable(name: "wgt", scope: !379, file: !3, line: 71, type: !138)
!398 = !DILocation(line: 71, column: 26, scope: !379)
!399 = !DILocalVariable(name: "i", scope: !400, file: !3, line: 72, type: !40)
!400 = distinct !DILexicalBlock(scope: !379, file: !3, line: 72, column: 5)
!401 = !DILocation(line: 72, column: 14, scope: !400)
!402 = !DILocation(line: 72, column: 10, scope: !400)
!403 = !DILocation(line: 72, column: 18, scope: !404)
!404 = distinct !DILexicalBlock(scope: !400, file: !3, line: 72, column: 5)
!405 = !DILocation(line: 72, column: 19, scope: !404)
!406 = !DILocation(line: 72, column: 5, scope: !400)
!407 = !DILocation(line: 73, column: 24, scope: !408)
!408 = distinct !DILexicalBlock(scope: !404, file: !3, line: 72, column: 26)
!409 = !DILocation(line: 73, column: 33, scope: !408)
!410 = !DILocation(line: 73, column: 41, scope: !408)
!411 = !DILocation(line: 73, column: 40, scope: !408)
!412 = !DILocation(line: 73, column: 13, scope: !408)
!413 = !DILocation(line: 73, column: 9, scope: !408)
!414 = !DILocation(line: 73, column: 16, scope: !408)
!415 = !DILocation(line: 72, column: 23, scope: !404)
!416 = !DILocation(line: 72, column: 5, scope: !404)
!417 = distinct !{!417, !406, !418}
!418 = !DILocation(line: 74, column: 5, scope: !400)
!419 = !DILocalVariable(name: "i", scope: !420, file: !3, line: 75, type: !40)
!420 = distinct !DILexicalBlock(scope: !379, file: !3, line: 75, column: 5)
!421 = !DILocation(line: 75, column: 14, scope: !420)
!422 = !DILocation(line: 75, column: 10, scope: !420)
!423 = !DILocation(line: 75, column: 18, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !3, line: 75, column: 5)
!425 = !DILocation(line: 75, column: 19, scope: !424)
!426 = !DILocation(line: 75, column: 5, scope: !420)
!427 = !DILocation(line: 76, column: 24, scope: !428)
!428 = distinct !DILexicalBlock(scope: !424, file: !3, line: 75, column: 26)
!429 = !DILocation(line: 76, column: 33, scope: !428)
!430 = !DILocation(line: 76, column: 13, scope: !428)
!431 = !DILocation(line: 76, column: 9, scope: !428)
!432 = !DILocation(line: 76, column: 16, scope: !428)
!433 = !DILocation(line: 75, column: 23, scope: !424)
!434 = !DILocation(line: 75, column: 5, scope: !424)
!435 = distinct !{!435, !426, !436}
!436 = !DILocation(line: 77, column: 5, scope: !420)
!437 = !DILocalVariable(name: "arr_val", scope: !379, file: !3, line: 78, type: !10)
!438 = !DILocation(line: 78, column: 20, scope: !379)
!439 = !DILocation(line: 78, column: 45, scope: !379)
!440 = !DILocation(line: 78, column: 49, scope: !379)
!441 = !DILocation(line: 78, column: 30, scope: !379)
!442 = !DILocation(line: 79, column: 12, scope: !379)
!443 = !DILocation(line: 79, column: 5, scope: !379)
!444 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 86, type: !445, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!445 = !DISubroutineType(types: !446)
!446 = !{!40, !40, !447}
!447 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!448 = !DILocalVariable(name: "argc", arg: 1, scope: !444, file: !3, line: 86, type: !40)
!449 = !DILocation(line: 86, column: 14, scope: !444)
!450 = !DILocalVariable(name: "argv", arg: 2, scope: !444, file: !3, line: 86, type: !447)
!451 = !DILocation(line: 86, column: 32, scope: !444)
!452 = !DILocalVariable(name: "inp_mem_row0", scope: !444, file: !3, line: 88, type: !138)
!453 = !DILocation(line: 88, column: 18, scope: !444)
!454 = !DILocalVariable(name: "inp_mem_row1", scope: !444, file: !3, line: 88, type: !138)
