; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !6
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !12
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !18
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !21
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !23
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !25
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !27
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !29
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!215 = !DILocalVariable(name: "mat2", arg: 2, scope: !210, file: !3, line: 42, type: !134)
!216 = !DILocation(line: 42, column: 61, scope: !210)
!217 = !DILocalVariable(name: "res", arg: 3, scope: !210, file: !3, line: 42, type: !134)
!218 = !DILocation(line: 42, column: 87, scope: !210)
!219 = !DILocalVariable(name: "i", scope: !220, file: !3, line: 43, type: !15)
!220 = distinct !DILexicalBlock(scope: !210, file: !3, line: 43, column: 5)
!221 = !DILocation(line: 43, column: 14, scope: !220)
!222 = !DILocation(line: 43, column: 10, scope: !220)
!223 = !DILocation(line: 43, column: 21, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !3, line: 43, column: 5)
!225 = !DILocation(line: 43, column: 23, scope: !224)
!226 = !DILocation(line: 43, column: 5, scope: !220)
!227 = !DILocalVariable(name: "j", scope: !228, file: !3, line: 44, type: !15)
!228 = distinct !DILexicalBlock(scope: !229, file: !3, line: 44, column: 9)
!229 = distinct !DILexicalBlock(scope: !224, file: !3, line: 43, column: 35)
!230 = !DILocation(line: 44, column: 18, scope: !228)
!231 = !DILocation(line: 44, column: 14, scope: !228)
!232 = !DILocation(line: 44, column: 25, scope: !233)
!233 = distinct !DILexicalBlock(scope: !228, file: !3, line: 44, column: 9)
!234 = !DILocation(line: 44, column: 27, scope: !233)
!235 = !DILocation(line: 44, column: 9, scope: !228)
!236 = !DILocalVariable(name: "k", scope: !237, file: !3, line: 45, type: !15)
!237 = distinct !DILexicalBlock(scope: !238, file: !3, line: 45, column: 13)
!238 = distinct !DILexicalBlock(scope: !233, file: !3, line: 44, column: 39)
!239 = !DILocation(line: 45, column: 22, scope: !237)
!240 = !DILocation(line: 45, column: 18, scope: !237)
!241 = !DILocation(line: 45, column: 29, scope: !242)
!242 = distinct !DILexicalBlock(scope: !237, file: !3, line: 45, column: 13)
!243 = !DILocation(line: 45, column: 31, scope: !242)
!244 = !DILocation(line: 45, column: 13, scope: !237)
!245 = !DILocation(line: 46, column: 42, scope: !246)
!246 = distinct !DILexicalBlock(scope: !242, file: !3, line: 45, column: 43)
!247 = !DILocation(line: 46, column: 34, scope: !246)
!248 = !DILocation(line: 46, column: 45, scope: !246)
!249 = !DILocation(line: 46, column: 58, scope: !246)
!250 = !DILocation(line: 46, column: 50, scope: !246)
!251 = !DILocation(line: 46, column: 61, scope: !246)
!252 = !DILocation(line: 46, column: 48, scope: !246)
!253 = !DILocation(line: 46, column: 25, scope: !246)
!254 = !DILocation(line: 46, column: 17, scope: !246)
!255 = !DILocation(line: 46, column: 28, scope: !246)
!256 = !DILocation(line: 46, column: 31, scope: !246)
!257 = !DILocation(line: 45, column: 39, scope: !242)
!258 = !DILocation(line: 45, column: 13, scope: !242)
!259 = distinct !{!259, !244, !260}
!260 = !DILocation(line: 47, column: 13, scope: !237)
!261 = !DILocation(line: 44, column: 35, scope: !233)
!262 = !DILocation(line: 44, column: 9, scope: !233)
!263 = distinct !{!263, !235, !264}
!264 = !DILocation(line: 48, column: 9, scope: !228)
!265 = !DILocation(line: 43, column: 31, scope: !224)
!266 = !DILocation(line: 43, column: 5, scope: !224)
!267 = distinct !{!267, !226, !268}
!268 = !DILocation(line: 49, column: 5, scope: !220)
!269 = !DILocalVariable(name: "i", scope: !270, file: !3, line: 50, type: !15)
!270 = distinct !DILexicalBlock(scope: !210, file: !3, line: 50, column: 5)
!271 = !DILocation(line: 50, column: 13, scope: !270)
!272 = !DILocation(line: 50, column: 9, scope: !270)
!273 = !DILocation(line: 50, column: 18, scope: !274)
!274 = distinct !DILexicalBlock(scope: !270, file: !3, line: 50, column: 5)
!275 = !DILocation(line: 50, column: 19, scope: !274)
!276 = !DILocation(line: 50, column: 5, scope: !270)
!277 = !DILocalVariable(name: "j", scope: !278, file: !3, line: 51, type: !15)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 51, column: 9)
!279 = distinct !DILexicalBlock(scope: !274, file: !3, line: 50, column: 28)
!280 = !DILocation(line: 51, column: 17, scope: !278)
!281 = !DILocation(line: 51, column: 13, scope: !278)
!282 = !DILocation(line: 51, column: 21, scope: !283)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 51, column: 9)
!284 = !DILocation(line: 51, column: 22, scope: !283)
!285 = !DILocation(line: 0, scope: !274)
!286 = !DILocation(line: 51, column: 9, scope: !278)
!287 = !DILocation(line: 52, column: 37, scope: !288)
!288 = distinct !DILexicalBlock(scope: !283, file: !3, line: 51, column: 31)
!289 = !DILocation(line: 52, column: 48, scope: !288)
!290 = !DILocation(line: 52, column: 26, scope: !288)
!291 = !DILocation(line: 52, column: 27, scope: !288)
!292 = !DILocation(line: 52, column: 32, scope: !288)
!293 = !DILocation(line: 52, column: 31, scope: !288)
!294 = !DILocation(line: 52, column: 13, scope: !288)
!295 = !DILocation(line: 52, column: 35, scope: !288)
!296 = !DILocation(line: 51, column: 28, scope: !283)
!297 = !DILocation(line: 51, column: 9, scope: !283)
!298 = distinct !{!298, !286, !299}
!299 = !DILocation(line: 53, column: 9, scope: !278)
!300 = !DILocation(line: 50, column: 25, scope: !274)
!301 = !DILocation(line: 50, column: 5, scope: !274)
!302 = distinct !{!302, !276, !303}
!303 = !DILocation(line: 54, column: 5, scope: !270)
!304 = !DILocation(line: 55, column: 5, scope: !210)
!305 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 58, type: !306, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!306 = !DISubroutineType(types: !307)
!307 = !{!178, !308}
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !309, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !310, identifier: "_ZTS5INSTR")
!309 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !308, file: !309, line: 24, baseType: !9, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !308, file: !309, line: 25, baseType: !9, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !308, file: !309, line: 26, baseType: !9, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !308, file: !309, line: 27, baseType: !315, size: 192, offset: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !309, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !316, identifier: "_ZTS15GEMM_STRUCT_REF")
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !315, file: !309, line: 6, baseType: !178, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !315, file: !309, line: 7, baseType: !178, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !315, file: !309, line: 8, baseType: !178, size: 64, offset: 128)
!320 = !DILocalVariable(name: "instr", arg: 1, scope: !305, file: !3, line: 58, type: !308)
!321 = !DILocation(line: 58, column: 35, scope: !305)
!322 = !DILocalVariable(name: "arr_ref", scope: !305, file: !3, line: 60, type: !178)
!323 = !DILocation(line: 60, column: 20, scope: !305)
!324 = !DILocalVariable(name: "inp", scope: !305, file: !3, line: 61, type: !135)
!325 = !DILocation(line: 61, column: 18, scope: !305)
!326 = !DILocalVariable(name: "wgt", scope: !305, file: !3, line: 61, type: !135)
!327 = !DILocation(line: 61, column: 26, scope: !305)
!328 = !DILocation(line: 62, column: 14, scope: !329)
!329 = distinct !DILexicalBlock(scope: !305, file: !3, line: 62, column: 8)
!330 = !DILocation(line: 62, column: 20, scope: !329)
!331 = !DILocation(line: 62, column: 8, scope: !305)
!332 = !DILocalVariable(name: "i", scope: !333, file: !3, line: 63, type: !15)
!333 = distinct !DILexicalBlock(scope: !334, file: !3, line: 63, column: 9)
!334 = distinct !DILexicalBlock(scope: !329, file: !3, line: 62, column: 25)
!335 = !DILocation(line: 63, column: 18, scope: !333)
!336 = !DILocation(line: 63, column: 14, scope: !333)
!337 = !DILocation(line: 63, column: 25, scope: !338)
!338 = distinct !DILexicalBlock(scope: !333, file: !3, line: 63, column: 9)
!339 = !DILocation(line: 63, column: 27, scope: !338)
!340 = !DILocation(line: 63, column: 9, scope: !333)
!341 = !DILocation(line: 64, column: 30, scope: !342)
!342 = distinct !DILexicalBlock(scope: !338, file: !3, line: 63, column: 37)
!343 = !DILocation(line: 64, column: 39, scope: !342)
!344 = !DILocation(line: 64, column: 49, scope: !342)
!345 = !DILocation(line: 64, column: 47, scope: !342)
!346 = !DILocation(line: 64, column: 22, scope: !342)
!347 = !DILocation(line: 64, column: 17, scope: !342)
!348 = !DILocation(line: 64, column: 13, scope: !342)
!349 = !DILocation(line: 64, column: 20, scope: !342)
!350 = !DILocation(line: 63, column: 33, scope: !338)
!351 = !DILocation(line: 63, column: 9, scope: !338)
!352 = distinct !{!352, !340, !353}
!353 = !DILocation(line: 65, column: 9, scope: !333)
!354 = !DILocalVariable(name: "i", scope: !355, file: !3, line: 66, type: !15)
!355 = distinct !DILexicalBlock(scope: !334, file: !3, line: 66, column: 9)
!356 = !DILocation(line: 66, column: 18, scope: !355)
!357 = !DILocation(line: 66, column: 14, scope: !355)
!358 = !DILocation(line: 66, column: 25, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !3, line: 66, column: 9)
!360 = !DILocation(line: 66, column: 27, scope: !359)
!361 = !DILocation(line: 66, column: 9, scope: !355)
!362 = !DILocation(line: 67, column: 30, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !3, line: 66, column: 37)
!364 = !DILocation(line: 67, column: 39, scope: !363)
!365 = !DILocation(line: 67, column: 49, scope: !363)
!366 = !DILocation(line: 67, column: 47, scope: !363)
!367 = !DILocation(line: 67, column: 22, scope: !363)
!368 = !DILocation(line: 67, column: 17, scope: !363)
!369 = !DILocation(line: 67, column: 13, scope: !363)
!370 = !DILocation(line: 67, column: 20, scope: !363)
!371 = !DILocation(line: 66, column: 33, scope: !359)
!372 = !DILocation(line: 66, column: 9, scope: !359)
!373 = distinct !{!373, !361, !374}
!374 = !DILocation(line: 68, column: 9, scope: !355)
!375 = !DILocation(line: 69, column: 34, scope: !334)
!376 = !DILocation(line: 69, column: 39, scope: !334)
!377 = !DILocation(line: 69, column: 19, scope: !334)
!378 = !DILocation(line: 69, column: 17, scope: !334)
!379 = !DILocation(line: 70, column: 5, scope: !334)
!380 = !DILocation(line: 71, column: 16, scope: !305)
!381 = !DILocation(line: 71, column: 9, scope: !305)
!382 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 74, type: !383, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!383 = !DISubroutineType(types: !384)
!384 = !{!178, !385}
!385 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !309, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !386, identifier: "_ZTS9INSTR_VAL")
!386 = !{!387, !388, !389, !390}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !385, file: !309, line: 38, baseType: !9, size: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !385, file: !309, line: 39, baseType: !9, size: 32, offset: 32)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !385, file: !309, line: 40, baseType: !9, size: 32, offset: 64)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !385, file: !309, line: 41, baseType: !391, size: 96, offset: 96)
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !309, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !392, identifier: "_ZTS15GEMM_STRUCT_VAL")
!392 = !{!393, !394, !395}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !391, file: !309, line: 18, baseType: !9, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !391, file: !309, line: 19, baseType: !9, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !391, file: !309, line: 20, baseType: !9, size: 32, offset: 64)
!396 = !DILocalVariable(name: "instr", arg: 1, scope: !382, file: !3, line: 74, type: !385)
!397 = !DILocation(line: 74, column: 43, scope: !382)
!398 = !DILocalVariable(name: "arr_val", scope: !382, file: !3, line: 76, type: !178)
!399 = !DILocation(line: 76, column: 20, scope: !382)
!400 = !DILocalVariable(name: "inp", scope: !382, file: !3, line: 77, type: !135)
!401 = !DILocation(line: 77, column: 18, scope: !382)
!402 = !DILocalVariable(name: "wgt", scope: !382, file: !3, line: 77, type: !135)
!403 = !DILocation(line: 77, column: 26, scope: !382)
!404 = !DILocation(line: 78, column: 14, scope: !405)
!405 = distinct !DILexicalBlock(scope: !382, file: !3, line: 78, column: 8)
!406 = !DILocation(line: 78, column: 20, scope: !405)
!407 = !DILocation(line: 78, column: 8, scope: !382)
!408 = !DILocalVariable(name: "i", scope: !409, file: !3, line: 79, type: !15)
!409 = distinct !DILexicalBlock(scope: !410, file: !3, line: 79, column: 9)
!410 = distinct !DILexicalBlock(scope: !405, file: !3, line: 78, column: 25)
!411 = !DILocation(line: 79, column: 18, scope: !409)
!412 = !DILocation(line: 79, column: 14, scope: !409)
!413 = !DILocation(line: 79, column: 25, scope: !414)
!414 = distinct !DILexicalBlock(scope: !409, file: !3, line: 79, column: 9)
!415 = !DILocation(line: 79, column: 27, scope: !414)
!416 = !DILocation(line: 79, column: 9, scope: !409)
!417 = !DILocation(line: 80, column: 28, scope: !418)
!418 = distinct !DILexicalBlock(scope: !414, file: !3, line: 79, column: 37)
!419 = !DILocation(line: 80, column: 37, scope: !418)
!420 = !DILocation(line: 80, column: 47, scope: !418)
!421 = !DILocation(line: 80, column: 45, scope: !418)
!422 = !DILocation(line: 80, column: 17, scope: !418)
!423 = !DILocation(line: 80, column: 13, scope: !418)
!424 = !DILocation(line: 80, column: 20, scope: !418)
!425 = !DILocation(line: 79, column: 33, scope: !414)
!426 = !DILocation(line: 79, column: 9, scope: !414)
!427 = distinct !{!427, !416, !428}
!428 = !DILocation(line: 81, column: 9, scope: !409)
!429 = !DILocalVariable(name: "i", scope: !430, file: !3, line: 82, type: !15)
!430 = distinct !DILexicalBlock(scope: !410, file: !3, line: 82, column: 9)
!431 = !DILocation(line: 82, column: 18, scope: !430)
!432 = !DILocation(line: 82, column: 14, scope: !430)
!433 = !DILocation(line: 82, column: 25, scope: !434)
!434 = distinct !DILexicalBlock(scope: !430, file: !3, line: 82, column: 9)
!435 = !DILocation(line: 82, column: 27, scope: !434)
!436 = !DILocation(line: 82, column: 9, scope: !430)
!437 = !DILocation(line: 83, column: 28, scope: !438)
!438 = distinct !DILexicalBlock(scope: !434, file: !3, line: 82, column: 37)
!439 = !DILocation(line: 83, column: 37, scope: !438)
!440 = !DILocation(line: 83, column: 17, scope: !438)
!441 = !DILocation(line: 83, column: 13, scope: !438)
!442 = !DILocation(line: 83, column: 20, scope: !438)
!443 = !DILocation(line: 82, column: 33, scope: !434)
!444 = !DILocation(line: 82, column: 9, scope: !434)
!445 = distinct !{!445, !436, !446}
!446 = !DILocation(line: 84, column: 9, scope: !430)
!447 = !DILocation(line: 85, column: 34, scope: !410)
!448 = !DILocation(line: 85, column: 39, scope: !410)
!449 = !DILocation(line: 85, column: 19, scope: !410)
!450 = !DILocation(line: 85, column: 17, scope: !410)
!451 = !DILocation(line: 86, column: 5, scope: !410)
!452 = !DILocation(line: 87, column: 12, scope: !382)
!453 = !DILocation(line: 87, column: 5, scope: !382)
!454 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 90, type: !306, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!455 = !DILocalVariable(name: "myinsn", arg: 1, scope: !454, file: !3, line: 90, type: !308)
!456 = !DILocation(line: 90, column: 32, scope: !454)
!457 = !DILocalVariable(name: "row", scope: !454, file: !3, line: 91, type: !9)
