; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !6
@result_val = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !12
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !14
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !20
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !23
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !25
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !27
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !29
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !31
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!158 = distinct !DILexicalBlock(scope: !155, file: !3, line: 27, column: 9)
!159 = !DILocation(line: 27, column: 23, scope: !158)
!160 = !DILocation(line: 27, column: 9, scope: !155)
!161 = !DILocation(line: 28, column: 35, scope: !158)
!162 = !DILocation(line: 28, column: 43, scope: !158)
!163 = !DILocation(line: 28, column: 46, scope: !158)
!164 = !DILocation(line: 28, column: 13, scope: !158)
!165 = !DILocation(line: 28, column: 27, scope: !158)
!166 = !DILocation(line: 28, column: 30, scope: !158)
!167 = !DILocation(line: 28, column: 33, scope: !158)
!168 = !DILocation(line: 27, column: 31, scope: !158)
!169 = !DILocation(line: 27, column: 9, scope: !158)
!170 = distinct !{!170, !160, !171}
!171 = !DILocation(line: 28, column: 47, scope: !155)
!172 = !DILocation(line: 26, column: 27, scope: !151)
!173 = !DILocation(line: 26, column: 5, scope: !151)
!174 = distinct !{!174, !153, !175}
!175 = !DILocation(line: 28, column: 47, scope: !148)
!176 = !DILocation(line: 29, column: 1, scope: !133)
!177 = distinct !DISubprogram(name: "matrixMultiply", linkageName: "_Z14matrixMultiplyPjS_", scope: !3, file: !3, line: 31, type: !178, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !180, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!181 = !DILocalVariable(name: "mat1", arg: 1, scope: !177, file: !3, line: 31, type: !180)
!182 = !DILocation(line: 31, column: 43, scope: !177)
!183 = !DILocalVariable(name: "mat2", arg: 2, scope: !177, file: !3, line: 31, type: !180)
!184 = !DILocation(line: 31, column: 64, scope: !177)
!185 = !DILocalVariable(name: "res", scope: !177, file: !3, line: 33, type: !9)
!186 = !DILocation(line: 33, column: 18, scope: !177)
!187 = !DILocalVariable(name: "i", scope: !188, file: !3, line: 34, type: !17)
!188 = distinct !DILexicalBlock(scope: !177, file: !3, line: 34, column: 5)
!189 = !DILocation(line: 34, column: 13, scope: !188)
!190 = !DILocation(line: 34, column: 9, scope: !188)
!191 = !DILocation(line: 34, column: 20, scope: !192)
!192 = distinct !DILexicalBlock(scope: !188, file: !3, line: 34, column: 5)
!193 = !DILocation(line: 34, column: 22, scope: !192)
!194 = !DILocation(line: 34, column: 5, scope: !188)
!195 = !DILocation(line: 36, column: 16, scope: !196)
!196 = distinct !DILexicalBlock(scope: !192, file: !3, line: 35, column: 5)
!197 = !DILocation(line: 36, column: 21, scope: !196)
!198 = !DILocation(line: 36, column: 26, scope: !196)
!199 = !DILocation(line: 36, column: 31, scope: !196)
!200 = !DILocation(line: 36, column: 24, scope: !196)
!201 = !DILocation(line: 36, column: 13, scope: !196)
!202 = !DILocation(line: 34, column: 28, scope: !192)
!203 = !DILocation(line: 34, column: 5, scope: !192)
!204 = distinct !{!204, !194, !205}
!205 = !DILocation(line: 37, column: 5, scope: !188)
!206 = !DILocation(line: 38, column: 25, scope: !177)
!207 = !DILocation(line: 38, column: 12, scope: !177)
!208 = !DILocation(line: 38, column: 5, scope: !177)
!209 = !DILocation(line: 38, column: 23, scope: !177)
!210 = !DILocation(line: 39, column: 14, scope: !177)
!211 = !DILocation(line: 40, column: 5, scope: !177)
!212 = distinct !DISubprogram(name: "matrixMultiplyVal", linkageName: "_Z17matrixMultiplyValPjS_", scope: !3, file: !3, line: 43, type: !178, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!213 = !DILocalVariable(name: "mat1", arg: 1, scope: !212, file: !3, line: 43, type: !180)
!214 = !DILocation(line: 43, column: 46, scope: !212)
!215 = !DILocalVariable(name: "mat2", arg: 2, scope: !212, file: !3, line: 43, type: !180)
!216 = !DILocation(line: 43, column: 67, scope: !212)
!217 = !DILocalVariable(name: "res", scope: !212, file: !3, line: 45, type: !9)
!218 = !DILocation(line: 45, column: 18, scope: !212)
!219 = !DILocalVariable(name: "i", scope: !220, file: !3, line: 46, type: !17)
!220 = distinct !DILexicalBlock(scope: !212, file: !3, line: 46, column: 5)
!221 = !DILocation(line: 46, column: 13, scope: !220)
!222 = !DILocation(line: 46, column: 9, scope: !220)
!223 = !DILocation(line: 46, column: 20, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !3, line: 46, column: 5)
!225 = !DILocation(line: 46, column: 22, scope: !224)
!226 = !DILocation(line: 46, column: 5, scope: !220)
!227 = !DILocation(line: 48, column: 16, scope: !228)
!228 = distinct !DILexicalBlock(scope: !224, file: !3, line: 47, column: 5)
!229 = !DILocation(line: 48, column: 21, scope: !228)
!230 = !DILocation(line: 48, column: 26, scope: !228)
!231 = !DILocation(line: 48, column: 31, scope: !228)
!232 = !DILocation(line: 48, column: 24, scope: !228)
!233 = !DILocation(line: 48, column: 13, scope: !228)
!234 = !DILocation(line: 46, column: 28, scope: !224)
!235 = !DILocation(line: 46, column: 5, scope: !224)
!236 = distinct !{!236, !226, !237}
!237 = !DILocation(line: 49, column: 5, scope: !220)
!238 = !DILocation(line: 50, column: 29, scope: !212)
!239 = !DILocation(line: 50, column: 16, scope: !212)
!240 = !DILocation(line: 50, column: 5, scope: !212)
!241 = !DILocation(line: 50, column: 27, scope: !212)
!242 = !DILocation(line: 51, column: 14, scope: !212)
!243 = !DILocation(line: 52, column: 5, scope: !212)
!244 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 70, type: !245, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!245 = !DISubroutineType(types: !246)
!246 = !{!180, !247}
!247 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !248, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !249, identifier: "_ZTS5INSTR")
!248 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!249 = !{!250, !251, !252, !253}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !247, file: !248, line: 24, baseType: !9, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !247, file: !248, line: 25, baseType: !9, size: 32, offset: 32)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !247, file: !248, line: 26, baseType: !9, size: 32, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !247, file: !248, line: 27, baseType: !254, size: 192, offset: 128)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !248, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !255, identifier: "_ZTS15GEMM_STRUCT_REF")
!255 = !{!256, !257, !258}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !254, file: !248, line: 6, baseType: !180, size: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !254, file: !248, line: 7, baseType: !180, size: 64, offset: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !254, file: !248, line: 8, baseType: !180, size: 64, offset: 128)
!259 = !DILocalVariable(name: "instr", arg: 1, scope: !244, file: !3, line: 70, type: !247)
!260 = !DILocation(line: 70, column: 35, scope: !244)
!261 = !DILocalVariable(name: "arr_ref", scope: !244, file: !3, line: 72, type: !180)
!262 = !DILocation(line: 72, column: 20, scope: !244)
!263 = !DILocalVariable(name: "inp", scope: !244, file: !3, line: 73, type: !137)
!264 = !DILocation(line: 73, column: 18, scope: !244)
!265 = !DILocalVariable(name: "wgt", scope: !244, file: !3, line: 73, type: !137)
!266 = !DILocation(line: 73, column: 26, scope: !244)
!267 = !DILocation(line: 74, column: 14, scope: !268)
!268 = distinct !DILexicalBlock(scope: !244, file: !3, line: 74, column: 8)
!269 = !DILocation(line: 74, column: 20, scope: !268)
!270 = !DILocation(line: 74, column: 8, scope: !244)
!271 = !DILocalVariable(name: "i", scope: !272, file: !3, line: 75, type: !17)
!272 = distinct !DILexicalBlock(scope: !273, file: !3, line: 75, column: 9)
!273 = distinct !DILexicalBlock(scope: !268, file: !3, line: 74, column: 25)
!274 = !DILocation(line: 75, column: 18, scope: !272)
!275 = !DILocation(line: 75, column: 14, scope: !272)
!276 = !DILocation(line: 75, column: 25, scope: !277)
!277 = distinct !DILexicalBlock(scope: !272, file: !3, line: 75, column: 9)
!278 = !DILocation(line: 75, column: 27, scope: !277)
!279 = !DILocation(line: 75, column: 9, scope: !272)
!280 = !DILocation(line: 76, column: 30, scope: !281)
!281 = distinct !DILexicalBlock(scope: !277, file: !3, line: 75, column: 37)
!282 = !DILocation(line: 76, column: 39, scope: !281)
!283 = !DILocation(line: 76, column: 49, scope: !281)
!284 = !DILocation(line: 76, column: 47, scope: !281)
!285 = !DILocation(line: 76, column: 22, scope: !281)
!286 = !DILocation(line: 76, column: 17, scope: !281)
!287 = !DILocation(line: 76, column: 13, scope: !281)
!288 = !DILocation(line: 76, column: 20, scope: !281)
!289 = !DILocation(line: 75, column: 33, scope: !277)
!290 = !DILocation(line: 75, column: 9, scope: !277)
!291 = distinct !{!291, !279, !292}
!292 = !DILocation(line: 77, column: 9, scope: !272)
!293 = !DILocalVariable(name: "i", scope: !294, file: !3, line: 78, type: !17)
!294 = distinct !DILexicalBlock(scope: !273, file: !3, line: 78, column: 9)
!295 = !DILocation(line: 78, column: 18, scope: !294)
!296 = !DILocation(line: 78, column: 14, scope: !294)
!297 = !DILocation(line: 78, column: 25, scope: !298)
!298 = distinct !DILexicalBlock(scope: !294, file: !3, line: 78, column: 9)
!299 = !DILocation(line: 78, column: 27, scope: !298)
!300 = !DILocation(line: 78, column: 9, scope: !294)
!301 = !DILocation(line: 79, column: 30, scope: !302)
!302 = distinct !DILexicalBlock(scope: !298, file: !3, line: 78, column: 37)
!303 = !DILocation(line: 79, column: 39, scope: !302)
!304 = !DILocation(line: 79, column: 49, scope: !302)
!305 = !DILocation(line: 79, column: 47, scope: !302)
!306 = !DILocation(line: 79, column: 22, scope: !302)
!307 = !DILocation(line: 79, column: 17, scope: !302)
!308 = !DILocation(line: 79, column: 13, scope: !302)
!309 = !DILocation(line: 79, column: 20, scope: !302)
!310 = !DILocation(line: 78, column: 33, scope: !298)
!311 = !DILocation(line: 78, column: 9, scope: !298)
!312 = distinct !{!312, !300, !313}
!313 = !DILocation(line: 80, column: 9, scope: !294)
!314 = !DILocation(line: 81, column: 34, scope: !273)
!315 = !DILocation(line: 81, column: 39, scope: !273)
!316 = !DILocation(line: 81, column: 19, scope: !273)
!317 = !DILocation(line: 81, column: 17, scope: !273)
!318 = !DILocation(line: 82, column: 5, scope: !273)
!319 = !DILocation(line: 83, column: 16, scope: !244)
!320 = !DILocation(line: 83, column: 9, scope: !244)
!321 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 86, type: !322, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!322 = !DISubroutineType(types: !323)
!323 = !{!180, !324}
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !248, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !325, identifier: "_ZTS9INSTR_VAL")
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !324, file: !248, line: 38, baseType: !9, size: 32)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !324, file: !248, line: 39, baseType: !9, size: 32, offset: 32)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !324, file: !248, line: 40, baseType: !9, size: 32, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !324, file: !248, line: 41, baseType: !330, size: 96, offset: 96)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !248, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !331, identifier: "_ZTS15GEMM_STRUCT_VAL")
!331 = !{!332, !333, !334}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !330, file: !248, line: 18, baseType: !9, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !330, file: !248, line: 19, baseType: !9, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !330, file: !248, line: 20, baseType: !9, size: 32, offset: 64)
!335 = !DILocalVariable(name: "instr", arg: 1, scope: !321, file: !3, line: 86, type: !324)
!336 = !DILocation(line: 86, column: 43, scope: !321)
!337 = !DILocalVariable(name: "arr_val", scope: !321, file: !3, line: 88, type: !180)
!338 = !DILocation(line: 88, column: 20, scope: !321)
!339 = !DILocalVariable(name: "inp", scope: !321, file: !3, line: 89, type: !137)
!340 = !DILocation(line: 89, column: 18, scope: !321)
!341 = !DILocalVariable(name: "wgt", scope: !321, file: !3, line: 89, type: !137)
!342 = !DILocation(line: 89, column: 26, scope: !321)
!343 = !DILocation(line: 90, column: 14, scope: !344)
!344 = distinct !DILexicalBlock(scope: !321, file: !3, line: 90, column: 8)
!345 = !DILocation(line: 90, column: 20, scope: !344)
!346 = !DILocation(line: 90, column: 8, scope: !321)
!347 = !DILocalVariable(name: "i", scope: !348, file: !3, line: 91, type: !17)
!348 = distinct !DILexicalBlock(scope: !349, file: !3, line: 91, column: 9)
!349 = distinct !DILexicalBlock(scope: !344, file: !3, line: 90, column: 25)
!350 = !DILocation(line: 91, column: 18, scope: !348)
!351 = !DILocation(line: 91, column: 14, scope: !348)
!352 = !DILocation(line: 91, column: 25, scope: !353)
!353 = distinct !DILexicalBlock(scope: !348, file: !3, line: 91, column: 9)
!354 = !DILocation(line: 91, column: 27, scope: !353)
!355 = !DILocation(line: 91, column: 9, scope: !348)
!356 = !DILocation(line: 92, column: 28, scope: !357)
!357 = distinct !DILexicalBlock(scope: !353, file: !3, line: 91, column: 37)
!358 = !DILocation(line: 92, column: 37, scope: !357)
!359 = !DILocation(line: 92, column: 47, scope: !357)
!360 = !DILocation(line: 92, column: 45, scope: !357)
!361 = !DILocation(line: 92, column: 17, scope: !357)
!362 = !DILocation(line: 92, column: 13, scope: !357)
!363 = !DILocation(line: 92, column: 20, scope: !357)
!364 = !DILocation(line: 91, column: 33, scope: !353)
!365 = !DILocation(line: 91, column: 9, scope: !353)
!366 = distinct !{!366, !355, !367}
!367 = !DILocation(line: 93, column: 9, scope: !348)
!368 = !DILocalVariable(name: "i", scope: !369, file: !3, line: 94, type: !17)
!369 = distinct !DILexicalBlock(scope: !349, file: !3, line: 94, column: 9)
!370 = !DILocation(line: 94, column: 18, scope: !369)
!371 = !DILocation(line: 94, column: 14, scope: !369)
!372 = !DILocation(line: 94, column: 25, scope: !373)
!373 = distinct !DILexicalBlock(scope: !369, file: !3, line: 94, column: 9)
!374 = !DILocation(line: 94, column: 27, scope: !373)
!375 = !DILocation(line: 94, column: 9, scope: !369)
!376 = !DILocation(line: 95, column: 28, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !3, line: 94, column: 37)
!378 = !DILocation(line: 95, column: 37, scope: !377)
!379 = !DILocation(line: 95, column: 17, scope: !377)
!380 = !DILocation(line: 95, column: 13, scope: !377)
!381 = !DILocation(line: 95, column: 20, scope: !377)
!382 = !DILocation(line: 94, column: 33, scope: !373)
!383 = !DILocation(line: 94, column: 9, scope: !373)
!384 = distinct !{!384, !375, !385}
!385 = !DILocation(line: 96, column: 9, scope: !369)
!386 = !DILocation(line: 97, column: 37, scope: !349)
!387 = !DILocation(line: 97, column: 42, scope: !349)
!388 = !DILocation(line: 97, column: 19, scope: !349)
!389 = !DILocation(line: 97, column: 17, scope: !349)
!390 = !DILocation(line: 98, column: 5, scope: !349)
!391 = !DILocation(line: 99, column: 12, scope: !321)
!392 = !DILocation(line: 99, column: 5, scope: !321)
!393 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 102, type: !245, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!394 = !DILocalVariable(name: "myinsn", arg: 1, scope: !393, file: !3, line: 102, type: !247)
!395 = !DILocation(line: 102, column: 32, scope: !393)
