; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !14
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !20
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !23
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !25
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !27
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !29
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !31
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!127 = !DIFile(filename: "/tmp/klee_src/runtime/Freestanding/memcpy.c", directory: "/tmp/klee_build90stp_z3/runtime/Freestanding")
!128 = !{i32 2, !"Dwarf Version", i32 4}
!129 = !{i32 2, !"Debug Info Version", i32 3}
!130 = !{i32 1, !"wchar_size", i32 4}
!131 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!132 = !{!"clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)"}
!133 = distinct !DISubprogram(name: "transpose", linkageName: "_Z9transposePA3_jS0_", scope: !3, file: !3, line: 22, type: !134, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!134 = !DISubroutineType(types: !135)
!135 = !{null, !136, !136}
!136 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !137, size: 64)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 96, elements: !138)
!138 = !{!19}
!139 = !DILocalVariable(name: "wgt_mem", arg: 1, scope: !133, file: !3, line: 22, type: !136)
!140 = !DILocation(line: 22, column: 29, scope: !133)
!141 = !DILocalVariable(name: "wgt_mem_prime", arg: 2, scope: !133, file: !3, line: 22, type: !136)
!142 = !DILocation(line: 22, column: 58, scope: !133)
!143 = !DILocalVariable(name: "i", scope: !133, file: !3, line: 24, type: !17)
!144 = !DILocation(line: 24, column: 9, scope: !133)
!145 = !DILocalVariable(name: "j", scope: !133, file: !3, line: 24, type: !17)
!146 = !DILocation(line: 24, column: 12, scope: !133)
!147 = !DILocation(line: 25, column: 12, scope: !148)
!148 = distinct !DILexicalBlock(scope: !133, file: !3, line: 25, column: 5)
!149 = !DILocation(line: 25, column: 10, scope: !148)
!150 = !DILocation(line: 25, column: 17, scope: !151)
!151 = distinct !DILexicalBlock(scope: !148, file: !3, line: 25, column: 5)
!152 = !DILocation(line: 25, column: 19, scope: !151)
!153 = !DILocation(line: 25, column: 5, scope: !148)
!154 = !DILocation(line: 26, column: 16, scope: !155)
!155 = distinct !DILexicalBlock(scope: !151, file: !3, line: 26, column: 9)
!156 = !DILocation(line: 26, column: 14, scope: !155)
!157 = !DILocation(line: 26, column: 21, scope: !158)
!158 = distinct !DILexicalBlock(scope: !155, file: !3, line: 26, column: 9)
!159 = !DILocation(line: 26, column: 23, scope: !158)
!160 = !DILocation(line: 26, column: 9, scope: !155)
!161 = !DILocation(line: 27, column: 35, scope: !158)
!162 = !DILocation(line: 27, column: 43, scope: !158)
!163 = !DILocation(line: 27, column: 46, scope: !158)
!164 = !DILocation(line: 27, column: 13, scope: !158)
!165 = !DILocation(line: 27, column: 27, scope: !158)
!166 = !DILocation(line: 27, column: 30, scope: !158)
!167 = !DILocation(line: 27, column: 33, scope: !158)
!168 = !DILocation(line: 26, column: 31, scope: !158)
!169 = !DILocation(line: 26, column: 9, scope: !158)
!170 = distinct !{!170, !160, !171}
!171 = !DILocation(line: 27, column: 47, scope: !155)
!172 = !DILocation(line: 25, column: 27, scope: !151)
!173 = !DILocation(line: 25, column: 5, scope: !151)
!174 = distinct !{!174, !153, !175}
!175 = !DILocation(line: 27, column: 47, scope: !148)
!176 = !DILocation(line: 28, column: 1, scope: !133)
!177 = distinct !DISubprogram(name: "matrixMultiply", linkageName: "_Z14matrixMultiplyPjS_", scope: !3, file: !3, line: 30, type: !178, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!178 = !DISubroutineType(types: !179)
!179 = !{!180, !180, !180}
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!181 = !DILocalVariable(name: "mat1", arg: 1, scope: !177, file: !3, line: 30, type: !180)
!182 = !DILocation(line: 30, column: 43, scope: !177)
!183 = !DILocalVariable(name: "mat2", arg: 2, scope: !177, file: !3, line: 30, type: !180)
!184 = !DILocation(line: 30, column: 64, scope: !177)
!185 = !DILocalVariable(name: "res", scope: !177, file: !3, line: 32, type: !11)
!186 = !DILocation(line: 32, column: 18, scope: !177)
!187 = !DILocalVariable(name: "i", scope: !188, file: !3, line: 33, type: !17)
!188 = distinct !DILexicalBlock(scope: !177, file: !3, line: 33, column: 5)
!189 = !DILocation(line: 33, column: 13, scope: !188)
!190 = !DILocation(line: 33, column: 9, scope: !188)
!191 = !DILocation(line: 33, column: 20, scope: !192)
!192 = distinct !DILexicalBlock(scope: !188, file: !3, line: 33, column: 5)
!193 = !DILocation(line: 33, column: 22, scope: !192)
!194 = !DILocation(line: 33, column: 5, scope: !188)
!195 = !DILocation(line: 35, column: 16, scope: !196)
!196 = distinct !DILexicalBlock(scope: !192, file: !3, line: 34, column: 5)
!197 = !DILocation(line: 35, column: 21, scope: !196)
!198 = !DILocation(line: 35, column: 26, scope: !196)
!199 = !DILocation(line: 35, column: 31, scope: !196)
!200 = !DILocation(line: 35, column: 24, scope: !196)
!201 = !DILocation(line: 35, column: 13, scope: !196)
!202 = !DILocation(line: 33, column: 28, scope: !192)
!203 = !DILocation(line: 33, column: 5, scope: !192)
!204 = distinct !{!204, !194, !205}
!205 = !DILocation(line: 36, column: 5, scope: !188)
!206 = !DILocation(line: 37, column: 25, scope: !177)
!207 = !DILocation(line: 37, column: 12, scope: !177)
!208 = !DILocation(line: 37, column: 5, scope: !177)
!209 = !DILocation(line: 37, column: 23, scope: !177)
!210 = !DILocation(line: 38, column: 14, scope: !177)
!211 = !DILocation(line: 39, column: 5, scope: !177)
!212 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 58, type: !213, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!213 = !DISubroutineType(types: !214)
!214 = !{!180, !215}
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !216, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !217, identifier: "_ZTS5INSTR")
!216 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!217 = !{!218, !219, !220, !221}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !215, file: !216, line: 24, baseType: !11, size: 32)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !215, file: !216, line: 25, baseType: !11, size: 32, offset: 32)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !215, file: !216, line: 26, baseType: !11, size: 32, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !215, file: !216, line: 27, baseType: !222, size: 192, offset: 128)
!222 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !216, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !223, identifier: "_ZTS15GEMM_STRUCT_REF")
!223 = !{!224, !225, !226}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !222, file: !216, line: 6, baseType: !180, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !222, file: !216, line: 7, baseType: !180, size: 64, offset: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !222, file: !216, line: 8, baseType: !180, size: 64, offset: 128)
!227 = !DILocalVariable(name: "instr", arg: 1, scope: !212, file: !3, line: 58, type: !215)
!228 = !DILocation(line: 58, column: 35, scope: !212)
!229 = !DILocalVariable(name: "arr_ref", scope: !212, file: !3, line: 60, type: !180)
!230 = !DILocation(line: 60, column: 20, scope: !212)
!231 = !DILocalVariable(name: "inp", scope: !212, file: !3, line: 61, type: !137)
!232 = !DILocation(line: 61, column: 18, scope: !212)
!233 = !DILocalVariable(name: "wgt", scope: !212, file: !3, line: 61, type: !137)
!234 = !DILocation(line: 61, column: 26, scope: !212)
!235 = !DILocation(line: 62, column: 14, scope: !236)
!236 = distinct !DILexicalBlock(scope: !212, file: !3, line: 62, column: 8)
!237 = !DILocation(line: 62, column: 20, scope: !236)
!238 = !DILocation(line: 62, column: 8, scope: !212)
!239 = !DILocalVariable(name: "i", scope: !240, file: !3, line: 63, type: !17)
!240 = distinct !DILexicalBlock(scope: !241, file: !3, line: 63, column: 9)
!241 = distinct !DILexicalBlock(scope: !236, file: !3, line: 62, column: 25)
!242 = !DILocation(line: 63, column: 18, scope: !240)
!243 = !DILocation(line: 63, column: 14, scope: !240)
!244 = !DILocation(line: 63, column: 25, scope: !245)
!245 = distinct !DILexicalBlock(scope: !240, file: !3, line: 63, column: 9)
!246 = !DILocation(line: 63, column: 27, scope: !245)
!247 = !DILocation(line: 63, column: 9, scope: !240)
!248 = !DILocation(line: 64, column: 30, scope: !249)
!249 = distinct !DILexicalBlock(scope: !245, file: !3, line: 63, column: 37)
!250 = !DILocation(line: 64, column: 39, scope: !249)
!251 = !DILocation(line: 64, column: 49, scope: !249)
!252 = !DILocation(line: 64, column: 47, scope: !249)
!253 = !DILocation(line: 64, column: 22, scope: !249)
!254 = !DILocation(line: 64, column: 17, scope: !249)
!255 = !DILocation(line: 64, column: 13, scope: !249)
!256 = !DILocation(line: 64, column: 20, scope: !249)
!257 = !DILocation(line: 63, column: 33, scope: !245)
!258 = !DILocation(line: 63, column: 9, scope: !245)
!259 = distinct !{!259, !247, !260}
!260 = !DILocation(line: 65, column: 9, scope: !240)
!261 = !DILocalVariable(name: "i", scope: !262, file: !3, line: 66, type: !17)
!262 = distinct !DILexicalBlock(scope: !241, file: !3, line: 66, column: 9)
!263 = !DILocation(line: 66, column: 18, scope: !262)
!264 = !DILocation(line: 66, column: 14, scope: !262)
!265 = !DILocation(line: 66, column: 25, scope: !266)
!266 = distinct !DILexicalBlock(scope: !262, file: !3, line: 66, column: 9)
!267 = !DILocation(line: 66, column: 27, scope: !266)
!268 = !DILocation(line: 66, column: 9, scope: !262)
!269 = !DILocation(line: 67, column: 30, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !3, line: 66, column: 37)
!271 = !DILocation(line: 67, column: 39, scope: !270)
!272 = !DILocation(line: 67, column: 49, scope: !270)
!273 = !DILocation(line: 67, column: 47, scope: !270)
!274 = !DILocation(line: 67, column: 22, scope: !270)
!275 = !DILocation(line: 67, column: 17, scope: !270)
!276 = !DILocation(line: 67, column: 13, scope: !270)
!277 = !DILocation(line: 67, column: 20, scope: !270)
!278 = !DILocation(line: 66, column: 33, scope: !266)
!279 = !DILocation(line: 66, column: 9, scope: !266)
!280 = distinct !{!280, !268, !281}
!281 = !DILocation(line: 68, column: 9, scope: !262)
!282 = !DILocation(line: 69, column: 34, scope: !241)
!283 = !DILocation(line: 69, column: 39, scope: !241)
!284 = !DILocation(line: 69, column: 19, scope: !241)
!285 = !DILocation(line: 69, column: 17, scope: !241)
!286 = !DILocation(line: 70, column: 5, scope: !241)
!287 = !DILocation(line: 71, column: 16, scope: !212)
!288 = !DILocation(line: 71, column: 9, scope: !212)
!289 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 74, type: !290, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!290 = !DISubroutineType(types: !291)
!291 = !{!180, !292}
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !216, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !293, identifier: "_ZTS9INSTR_VAL")
!293 = !{!294, !295, !296, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !292, file: !216, line: 38, baseType: !11, size: 32)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !292, file: !216, line: 39, baseType: !11, size: 32, offset: 32)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !292, file: !216, line: 40, baseType: !11, size: 32, offset: 64)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !292, file: !216, line: 41, baseType: !298, size: 96, offset: 96)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !216, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !299, identifier: "_ZTS15GEMM_STRUCT_VAL")
!299 = !{!300, !301, !302}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !298, file: !216, line: 18, baseType: !11, size: 32)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !298, file: !216, line: 19, baseType: !11, size: 32, offset: 32)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !298, file: !216, line: 20, baseType: !11, size: 32, offset: 64)
!303 = !DILocalVariable(name: "instr", arg: 1, scope: !289, file: !3, line: 74, type: !292)
!304 = !DILocation(line: 74, column: 43, scope: !289)
!305 = !DILocalVariable(name: "arr_val", scope: !289, file: !3, line: 76, type: !180)
!306 = !DILocation(line: 76, column: 20, scope: !289)
!307 = !DILocalVariable(name: "inp", scope: !289, file: !3, line: 77, type: !137)
!308 = !DILocation(line: 77, column: 18, scope: !289)
!309 = !DILocalVariable(name: "wgt", scope: !289, file: !3, line: 77, type: !137)
!310 = !DILocation(line: 77, column: 26, scope: !289)
!311 = !DILocation(line: 78, column: 14, scope: !312)
!312 = distinct !DILexicalBlock(scope: !289, file: !3, line: 78, column: 8)
!313 = !DILocation(line: 78, column: 20, scope: !312)
!314 = !DILocation(line: 78, column: 8, scope: !289)
!315 = !DILocalVariable(name: "i", scope: !316, file: !3, line: 79, type: !17)
!316 = distinct !DILexicalBlock(scope: !317, file: !3, line: 79, column: 9)
!317 = distinct !DILexicalBlock(scope: !312, file: !3, line: 78, column: 25)
!318 = !DILocation(line: 79, column: 18, scope: !316)
!319 = !DILocation(line: 79, column: 14, scope: !316)
!320 = !DILocation(line: 79, column: 25, scope: !321)
!321 = distinct !DILexicalBlock(scope: !316, file: !3, line: 79, column: 9)
!322 = !DILocation(line: 79, column: 27, scope: !321)
!323 = !DILocation(line: 79, column: 9, scope: !316)
!324 = !DILocation(line: 80, column: 28, scope: !325)
!325 = distinct !DILexicalBlock(scope: !321, file: !3, line: 79, column: 37)
!326 = !DILocation(line: 80, column: 37, scope: !325)
!327 = !DILocation(line: 80, column: 47, scope: !325)
!328 = !DILocation(line: 80, column: 45, scope: !325)
!329 = !DILocation(line: 80, column: 17, scope: !325)
!330 = !DILocation(line: 80, column: 13, scope: !325)
!331 = !DILocation(line: 80, column: 20, scope: !325)
!332 = !DILocation(line: 79, column: 33, scope: !321)
!333 = !DILocation(line: 79, column: 9, scope: !321)
!334 = distinct !{!334, !323, !335}
!335 = !DILocation(line: 81, column: 9, scope: !316)
!336 = !DILocalVariable(name: "i", scope: !337, file: !3, line: 82, type: !17)
!337 = distinct !DILexicalBlock(scope: !317, file: !3, line: 82, column: 9)
!338 = !DILocation(line: 82, column: 18, scope: !337)
!339 = !DILocation(line: 82, column: 14, scope: !337)
!340 = !DILocation(line: 82, column: 25, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !3, line: 82, column: 9)
!342 = !DILocation(line: 82, column: 27, scope: !341)
!343 = !DILocation(line: 82, column: 9, scope: !337)
!344 = !DILocation(line: 83, column: 28, scope: !345)
!345 = distinct !DILexicalBlock(scope: !341, file: !3, line: 82, column: 37)
!346 = !DILocation(line: 83, column: 37, scope: !345)
!347 = !DILocation(line: 83, column: 17, scope: !345)
!348 = !DILocation(line: 83, column: 13, scope: !345)
!349 = !DILocation(line: 83, column: 20, scope: !345)
!350 = !DILocation(line: 82, column: 33, scope: !341)
!351 = !DILocation(line: 82, column: 9, scope: !341)
!352 = distinct !{!352, !343, !353}
!353 = !DILocation(line: 84, column: 9, scope: !337)
!354 = !DILocation(line: 85, column: 34, scope: !317)
!355 = !DILocation(line: 85, column: 39, scope: !317)
!356 = !DILocation(line: 85, column: 19, scope: !317)
!357 = !DILocation(line: 85, column: 17, scope: !317)
!358 = !DILocation(line: 86, column: 5, scope: !317)
!359 = !DILocation(line: 87, column: 12, scope: !289)
!360 = !DILocation(line: 87, column: 5, scope: !289)
!361 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 90, type: !213, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!362 = !DILocalVariable(name: "myinsn", arg: 1, scope: !361, file: !3, line: 90, type: !215)
!363 = !DILocation(line: 90, column: 32, scope: !361)
!364 = !DILocalVariable(name: "row", scope: !361, file: !3, line: 91, type: !11)
