; ModuleID = 'gemm.bc'
source_filename = "gemm.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [10 x i32] zeroinitializer, align 16, !dbg !8
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !14
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !19
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !21
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !23
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !25
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!215 = !DILocalVariable(name: "mat2", arg: 2, scope: !210, file: !3, line: 38, type: !134)
!216 = !DILocation(line: 38, column: 61, scope: !210)
!217 = !DILocalVariable(name: "res", arg: 3, scope: !210, file: !3, line: 38, type: !134)
!218 = !DILocation(line: 38, column: 87, scope: !210)
!219 = !DILocalVariable(name: "i", scope: !220, file: !3, line: 39, type: !40)
!220 = distinct !DILexicalBlock(scope: !210, file: !3, line: 39, column: 5)
!221 = !DILocation(line: 39, column: 14, scope: !220)
!222 = !DILocation(line: 39, column: 10, scope: !220)
!223 = !DILocation(line: 39, column: 21, scope: !224)
!224 = distinct !DILexicalBlock(scope: !220, file: !3, line: 39, column: 5)
!225 = !DILocation(line: 39, column: 23, scope: !224)
!226 = !DILocation(line: 39, column: 5, scope: !220)
!227 = !DILocalVariable(name: "j", scope: !228, file: !3, line: 40, type: !40)
!228 = distinct !DILexicalBlock(scope: !229, file: !3, line: 40, column: 9)
!229 = distinct !DILexicalBlock(scope: !224, file: !3, line: 39, column: 35)
!230 = !DILocation(line: 40, column: 18, scope: !228)
!231 = !DILocation(line: 40, column: 14, scope: !228)
!232 = !DILocation(line: 40, column: 25, scope: !233)
!233 = distinct !DILexicalBlock(scope: !228, file: !3, line: 40, column: 9)
!234 = !DILocation(line: 40, column: 27, scope: !233)
!235 = !DILocation(line: 40, column: 9, scope: !228)
!236 = !DILocalVariable(name: "k", scope: !237, file: !3, line: 41, type: !40)
!237 = distinct !DILexicalBlock(scope: !238, file: !3, line: 41, column: 13)
!238 = distinct !DILexicalBlock(scope: !233, file: !3, line: 40, column: 39)
!239 = !DILocation(line: 41, column: 22, scope: !237)
!240 = !DILocation(line: 41, column: 18, scope: !237)
!241 = !DILocation(line: 41, column: 29, scope: !242)
!242 = distinct !DILexicalBlock(scope: !237, file: !3, line: 41, column: 13)
!243 = !DILocation(line: 41, column: 31, scope: !242)
!244 = !DILocation(line: 41, column: 13, scope: !237)
!245 = !DILocation(line: 42, column: 42, scope: !246)
!246 = distinct !DILexicalBlock(scope: !242, file: !3, line: 41, column: 43)
!247 = !DILocation(line: 42, column: 34, scope: !246)
!248 = !DILocation(line: 42, column: 45, scope: !246)
!249 = !DILocation(line: 42, column: 58, scope: !246)
!250 = !DILocation(line: 42, column: 50, scope: !246)
!251 = !DILocation(line: 42, column: 61, scope: !246)
!252 = !DILocation(line: 42, column: 48, scope: !246)
!253 = !DILocation(line: 42, column: 25, scope: !246)
!254 = !DILocation(line: 42, column: 17, scope: !246)
!255 = !DILocation(line: 42, column: 28, scope: !246)
!256 = !DILocation(line: 42, column: 31, scope: !246)
!257 = !DILocation(line: 41, column: 39, scope: !242)
!258 = !DILocation(line: 41, column: 13, scope: !242)
!259 = distinct !{!259, !244, !260}
!260 = !DILocation(line: 43, column: 13, scope: !237)
!261 = !DILocation(line: 40, column: 35, scope: !233)
!262 = !DILocation(line: 40, column: 9, scope: !233)
!263 = distinct !{!263, !235, !264}
!264 = !DILocation(line: 44, column: 9, scope: !228)
!265 = !DILocation(line: 39, column: 31, scope: !224)
!266 = !DILocation(line: 39, column: 5, scope: !224)
!267 = distinct !{!267, !226, !268}
!268 = !DILocation(line: 45, column: 5, scope: !220)
!269 = !DILocalVariable(name: "i", scope: !270, file: !3, line: 46, type: !40)
!270 = distinct !DILexicalBlock(scope: !210, file: !3, line: 46, column: 5)
!271 = !DILocation(line: 46, column: 13, scope: !270)
!272 = !DILocation(line: 46, column: 9, scope: !270)
!273 = !DILocation(line: 46, column: 18, scope: !274)
!274 = distinct !DILexicalBlock(scope: !270, file: !3, line: 46, column: 5)
!275 = !DILocation(line: 46, column: 19, scope: !274)
!276 = !DILocation(line: 46, column: 5, scope: !270)
!277 = !DILocalVariable(name: "j", scope: !278, file: !3, line: 47, type: !40)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 47, column: 9)
!279 = distinct !DILexicalBlock(scope: !274, file: !3, line: 46, column: 28)
!280 = !DILocation(line: 47, column: 17, scope: !278)
!281 = !DILocation(line: 47, column: 13, scope: !278)
!282 = !DILocation(line: 47, column: 21, scope: !283)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 47, column: 9)
!284 = !DILocation(line: 47, column: 22, scope: !283)
!285 = !DILocation(line: 0, scope: !274)
!286 = !DILocation(line: 47, column: 9, scope: !278)
!287 = !DILocation(line: 48, column: 37, scope: !288)
!288 = distinct !DILexicalBlock(scope: !283, file: !3, line: 47, column: 31)
!289 = !DILocation(line: 48, column: 48, scope: !288)
!290 = !DILocation(line: 48, column: 26, scope: !288)
!291 = !DILocation(line: 48, column: 27, scope: !288)
!292 = !DILocation(line: 48, column: 32, scope: !288)
!293 = !DILocation(line: 48, column: 31, scope: !288)
!294 = !DILocation(line: 48, column: 13, scope: !288)
!295 = !DILocation(line: 48, column: 35, scope: !288)
!296 = !DILocation(line: 47, column: 28, scope: !283)
!297 = !DILocation(line: 47, column: 9, scope: !283)
!298 = distinct !{!298, !286, !299}
!299 = !DILocation(line: 49, column: 9, scope: !278)
!300 = !DILocation(line: 46, column: 25, scope: !274)
!301 = !DILocation(line: 46, column: 5, scope: !274)
!302 = distinct !{!302, !276, !303}
!303 = !DILocation(line: 50, column: 5, scope: !270)
!304 = !DILocation(line: 51, column: 5, scope: !210)
!305 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 54, type: !306, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!306 = !DISubroutineType(types: !307)
!307 = !{!178, !308}
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !309, line: 17, size: 320, flags: DIFlagTypePassByValue, elements: !310, identifier: "_ZTS5INSTR")
!309 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!310 = !{!311, !312, !313, !314}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !308, file: !309, line: 18, baseType: !11, size: 32)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !308, file: !309, line: 19, baseType: !11, size: 32, offset: 32)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !308, file: !309, line: 20, baseType: !11, size: 32, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !308, file: !309, line: 21, baseType: !315, size: 192, offset: 128)
!315 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !309, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !316, identifier: "_ZTS15GEMM_STRUCT_REF")
!316 = !{!317, !318, !319}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !315, file: !309, line: 6, baseType: !178, size: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !315, file: !309, line: 7, baseType: !178, size: 64, offset: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !315, file: !309, line: 8, baseType: !178, size: 64, offset: 128)
!320 = !DILocalVariable(name: "instr", arg: 1, scope: !305, file: !3, line: 54, type: !308)
!321 = !DILocation(line: 54, column: 35, scope: !305)
!322 = !DILocalVariable(name: "inp", scope: !305, file: !3, line: 56, type: !135)
!323 = !DILocation(line: 56, column: 18, scope: !305)
!324 = !DILocalVariable(name: "wgt", scope: !305, file: !3, line: 56, type: !135)
!325 = !DILocation(line: 56, column: 26, scope: !305)
!326 = !DILocalVariable(name: "i", scope: !327, file: !3, line: 57, type: !40)
!327 = distinct !DILexicalBlock(scope: !305, file: !3, line: 57, column: 5)
!328 = !DILocation(line: 57, column: 14, scope: !327)
!329 = !DILocation(line: 57, column: 10, scope: !327)
!330 = !DILocation(line: 57, column: 18, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !3, line: 57, column: 5)
!332 = !DILocation(line: 57, column: 19, scope: !331)
!333 = !DILocation(line: 57, column: 5, scope: !327)
!334 = !DILocation(line: 58, column: 26, scope: !335)
!335 = distinct !DILexicalBlock(scope: !331, file: !3, line: 57, column: 26)
!336 = !DILocation(line: 58, column: 35, scope: !335)
!337 = !DILocation(line: 58, column: 43, scope: !335)
!338 = !DILocation(line: 58, column: 42, scope: !335)
!339 = !DILocation(line: 58, column: 18, scope: !335)
!340 = !DILocation(line: 58, column: 13, scope: !335)
!341 = !DILocation(line: 58, column: 9, scope: !335)
!342 = !DILocation(line: 58, column: 16, scope: !335)
!343 = !DILocation(line: 57, column: 23, scope: !331)
!344 = !DILocation(line: 57, column: 5, scope: !331)
!345 = distinct !{!345, !333, !346}
!346 = !DILocation(line: 59, column: 5, scope: !327)
!347 = !DILocalVariable(name: "i", scope: !348, file: !3, line: 60, type: !40)
!348 = distinct !DILexicalBlock(scope: !305, file: !3, line: 60, column: 5)
!349 = !DILocation(line: 60, column: 14, scope: !348)
!350 = !DILocation(line: 60, column: 10, scope: !348)
!351 = !DILocation(line: 60, column: 18, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !3, line: 60, column: 5)
!353 = !DILocation(line: 60, column: 19, scope: !352)
!354 = !DILocation(line: 60, column: 5, scope: !348)
!355 = !DILocation(line: 61, column: 26, scope: !356)
!356 = distinct !DILexicalBlock(scope: !352, file: !3, line: 60, column: 26)
!357 = !DILocation(line: 61, column: 35, scope: !356)
!358 = !DILocation(line: 61, column: 43, scope: !356)
!359 = !DILocation(line: 61, column: 42, scope: !356)
!360 = !DILocation(line: 61, column: 18, scope: !356)
!361 = !DILocation(line: 61, column: 13, scope: !356)
!362 = !DILocation(line: 61, column: 9, scope: !356)
!363 = !DILocation(line: 61, column: 16, scope: !356)
!364 = !DILocation(line: 60, column: 23, scope: !352)
!365 = !DILocation(line: 60, column: 5, scope: !352)
!366 = distinct !{!366, !354, !367}
!367 = !DILocation(line: 62, column: 5, scope: !348)
!368 = !DILocalVariable(name: "arr", scope: !305, file: !3, line: 63, type: !178)
!369 = !DILocation(line: 63, column: 20, scope: !305)
!370 = !DILocation(line: 63, column: 41, scope: !305)
!371 = !DILocation(line: 63, column: 45, scope: !305)
!372 = !DILocation(line: 63, column: 26, scope: !305)
!373 = !DILocation(line: 64, column: 12, scope: !305)
!374 = !DILocation(line: 64, column: 5, scope: !305)
!375 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 67, type: !376, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!376 = !DISubroutineType(types: !377)
!377 = !{!178, !378}
!378 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !309, line: 24, size: 192, flags: DIFlagTypePassByValue, elements: !379, identifier: "_ZTS9INSTR_VAL")
!379 = !{!380, !381, !382, !383}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !378, file: !309, line: 25, baseType: !11, size: 32)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !378, file: !309, line: 26, baseType: !11, size: 32, offset: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !378, file: !309, line: 27, baseType: !11, size: 32, offset: 64)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !378, file: !309, line: 28, baseType: !384, size: 96, offset: 96)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !309, line: 11, size: 96, flags: DIFlagTypePassByValue, elements: !385, identifier: "_ZTS15GEMM_STRUCT_VAL")
!385 = !{!386, !387, !388}
!386 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !384, file: !309, line: 12, baseType: !11, size: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !384, file: !309, line: 13, baseType: !11, size: 32, offset: 32)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !384, file: !309, line: 14, baseType: !11, size: 32, offset: 64)
!389 = !DILocalVariable(name: "instr", arg: 1, scope: !375, file: !3, line: 67, type: !378)
!390 = !DILocation(line: 67, column: 43, scope: !375)
!391 = !DILocalVariable(name: "inp", scope: !375, file: !3, line: 69, type: !135)
!392 = !DILocation(line: 69, column: 18, scope: !375)
!393 = !DILocalVariable(name: "wgt", scope: !375, file: !3, line: 69, type: !135)
!394 = !DILocation(line: 69, column: 26, scope: !375)
!395 = !DILocalVariable(name: "i", scope: !396, file: !3, line: 70, type: !40)
!396 = distinct !DILexicalBlock(scope: !375, file: !3, line: 70, column: 5)
!397 = !DILocation(line: 70, column: 14, scope: !396)
!398 = !DILocation(line: 70, column: 10, scope: !396)
!399 = !DILocation(line: 70, column: 18, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !3, line: 70, column: 5)
!401 = !DILocation(line: 70, column: 19, scope: !400)
!402 = !DILocation(line: 70, column: 5, scope: !396)
!403 = !DILocation(line: 71, column: 24, scope: !404)
!404 = distinct !DILexicalBlock(scope: !400, file: !3, line: 70, column: 26)
!405 = !DILocation(line: 71, column: 33, scope: !404)
!406 = !DILocation(line: 71, column: 41, scope: !404)
!407 = !DILocation(line: 71, column: 40, scope: !404)
!408 = !DILocation(line: 71, column: 13, scope: !404)
!409 = !DILocation(line: 71, column: 9, scope: !404)
!410 = !DILocation(line: 71, column: 16, scope: !404)
!411 = !DILocation(line: 70, column: 23, scope: !400)
!412 = !DILocation(line: 70, column: 5, scope: !400)
!413 = distinct !{!413, !402, !414}
!414 = !DILocation(line: 72, column: 5, scope: !396)
!415 = !DILocalVariable(name: "i", scope: !416, file: !3, line: 73, type: !40)
!416 = distinct !DILexicalBlock(scope: !375, file: !3, line: 73, column: 5)
!417 = !DILocation(line: 73, column: 14, scope: !416)
!418 = !DILocation(line: 73, column: 10, scope: !416)
!419 = !DILocation(line: 73, column: 18, scope: !420)
!420 = distinct !DILexicalBlock(scope: !416, file: !3, line: 73, column: 5)
!421 = !DILocation(line: 73, column: 19, scope: !420)
!422 = !DILocation(line: 73, column: 5, scope: !416)
!423 = !DILocation(line: 74, column: 24, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !3, line: 73, column: 26)
!425 = !DILocation(line: 74, column: 33, scope: !424)
!426 = !DILocation(line: 74, column: 13, scope: !424)
!427 = !DILocation(line: 74, column: 9, scope: !424)
!428 = !DILocation(line: 74, column: 16, scope: !424)
!429 = !DILocation(line: 73, column: 23, scope: !420)
!430 = !DILocation(line: 73, column: 5, scope: !420)
!431 = distinct !{!431, !422, !432}
!432 = !DILocation(line: 75, column: 5, scope: !416)
!433 = !DILocalVariable(name: "arr", scope: !375, file: !3, line: 76, type: !178)
!434 = !DILocation(line: 76, column: 20, scope: !375)
!435 = !DILocation(line: 76, column: 41, scope: !375)
!436 = !DILocation(line: 76, column: 45, scope: !375)
!437 = !DILocation(line: 76, column: 26, scope: !375)
!438 = !DILocation(line: 77, column: 12, scope: !375)
!439 = !DILocation(line: 77, column: 5, scope: !375)
!440 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 84, type: !441, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!441 = !DISubroutineType(types: !442)
!442 = !{!40, !40, !443}
!443 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!444 = !DILocalVariable(name: "argc", arg: 1, scope: !440, file: !3, line: 84, type: !40)
!445 = !DILocation(line: 84, column: 14, scope: !440)
!446 = !DILocalVariable(name: "argv", arg: 2, scope: !440, file: !3, line: 84, type: !443)
!447 = !DILocation(line: 84, column: 32, scope: !440)
!448 = !DILocalVariable(name: "inp_mem_row0", scope: !440, file: !3, line: 86, type: !135)
!449 = !DILocation(line: 86, column: 18, scope: !440)
!450 = !DILocalVariable(name: "inp_mem_row1", scope: !440, file: !3, line: 86, type: !135)
