; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@res_index_val = dso_local global i32 0, align 4, !dbg !8
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !11
@result_val = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !17
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !19
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !24
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !27
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !29
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !31
@out_mem = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !33
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !35
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !37

!164 = distinct !DILexicalBlock(scope: !161, file: !3, line: 28, column: 9)
!165 = !DILocation(line: 28, column: 23, scope: !164)
!166 = !DILocation(line: 28, column: 9, scope: !161)
!167 = !DILocation(line: 29, column: 35, scope: !164)
!168 = !DILocation(line: 29, column: 43, scope: !164)
!169 = !DILocation(line: 29, column: 46, scope: !164)
!170 = !DILocation(line: 29, column: 13, scope: !164)
!171 = !DILocation(line: 29, column: 27, scope: !164)
!172 = !DILocation(line: 29, column: 30, scope: !164)
!173 = !DILocation(line: 29, column: 33, scope: !164)
!174 = !DILocation(line: 28, column: 31, scope: !164)
!175 = !DILocation(line: 28, column: 9, scope: !164)
!176 = distinct !{!176, !166, !177}
!177 = !DILocation(line: 29, column: 47, scope: !161)
!178 = !DILocation(line: 27, column: 27, scope: !157)
!179 = !DILocation(line: 27, column: 5, scope: !157)
!180 = distinct !{!180, !159, !181}
!181 = !DILocation(line: 29, column: 47, scope: !154)
!182 = !DILocation(line: 30, column: 1, scope: !139)
!183 = distinct !DISubprogram(name: "matrixMultiply", linkageName: "_Z14matrixMultiplyPjS_", scope: !3, file: !3, line: 32, type: !184, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!184 = !DISubroutineType(types: !185)
!185 = !{!186, !186, !186}
!186 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!187 = !DILocalVariable(name: "mat1", arg: 1, scope: !183, file: !3, line: 32, type: !186)
!188 = !DILocation(line: 32, column: 43, scope: !183)
!189 = !DILocalVariable(name: "mat2", arg: 2, scope: !183, file: !3, line: 32, type: !186)
!190 = !DILocation(line: 32, column: 64, scope: !183)
!191 = !DILocalVariable(name: "res", scope: !183, file: !3, line: 34, type: !14)
!192 = !DILocation(line: 34, column: 18, scope: !183)
!193 = !DILocalVariable(name: "i", scope: !194, file: !3, line: 35, type: !10)
!194 = distinct !DILexicalBlock(scope: !183, file: !3, line: 35, column: 5)
!195 = !DILocation(line: 35, column: 13, scope: !194)
!196 = !DILocation(line: 35, column: 9, scope: !194)
!197 = !DILocation(line: 35, column: 20, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !3, line: 35, column: 5)
!199 = !DILocation(line: 35, column: 22, scope: !198)
!200 = !DILocation(line: 35, column: 5, scope: !194)
!201 = !DILocation(line: 37, column: 16, scope: !202)
!202 = distinct !DILexicalBlock(scope: !198, file: !3, line: 36, column: 5)
!203 = !DILocation(line: 37, column: 21, scope: !202)
!204 = !DILocation(line: 37, column: 26, scope: !202)
!205 = !DILocation(line: 37, column: 31, scope: !202)
!206 = !DILocation(line: 37, column: 24, scope: !202)
!207 = !DILocation(line: 37, column: 13, scope: !202)
!208 = !DILocation(line: 35, column: 28, scope: !198)
!209 = !DILocation(line: 35, column: 5, scope: !198)
!210 = distinct !{!210, !200, !211}
!211 = !DILocation(line: 38, column: 5, scope: !194)
!212 = !DILocation(line: 39, column: 25, scope: !183)
!213 = !DILocation(line: 39, column: 12, scope: !183)
!214 = !DILocation(line: 39, column: 5, scope: !183)
!215 = !DILocation(line: 39, column: 23, scope: !183)
!216 = !DILocation(line: 40, column: 14, scope: !183)
!217 = !DILocation(line: 41, column: 5, scope: !183)
!218 = distinct !DISubprogram(name: "matrixMultiplyVal", linkageName: "_Z17matrixMultiplyValPjS_", scope: !3, file: !3, line: 44, type: !184, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!219 = !DILocalVariable(name: "mat1", arg: 1, scope: !218, file: !3, line: 44, type: !186)
!220 = !DILocation(line: 44, column: 46, scope: !218)
!221 = !DILocalVariable(name: "mat2", arg: 2, scope: !218, file: !3, line: 44, type: !186)
!222 = !DILocation(line: 44, column: 67, scope: !218)
!223 = !DILocalVariable(name: "res", scope: !218, file: !3, line: 46, type: !14)
!224 = !DILocation(line: 46, column: 18, scope: !218)
!225 = !DILocalVariable(name: "i", scope: !226, file: !3, line: 47, type: !10)
!226 = distinct !DILexicalBlock(scope: !218, file: !3, line: 47, column: 5)
!227 = !DILocation(line: 47, column: 13, scope: !226)
!228 = !DILocation(line: 47, column: 9, scope: !226)
!229 = !DILocation(line: 47, column: 20, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !3, line: 47, column: 5)
!231 = !DILocation(line: 47, column: 22, scope: !230)
!232 = !DILocation(line: 47, column: 5, scope: !226)
!233 = !DILocation(line: 49, column: 16, scope: !234)
!234 = distinct !DILexicalBlock(scope: !230, file: !3, line: 48, column: 5)
!235 = !DILocation(line: 49, column: 21, scope: !234)
!236 = !DILocation(line: 49, column: 26, scope: !234)
!237 = !DILocation(line: 49, column: 31, scope: !234)
!238 = !DILocation(line: 49, column: 24, scope: !234)
!239 = !DILocation(line: 49, column: 13, scope: !234)
!240 = !DILocation(line: 47, column: 28, scope: !230)
!241 = !DILocation(line: 47, column: 5, scope: !230)
!242 = distinct !{!242, !232, !243}
!243 = !DILocation(line: 50, column: 5, scope: !226)
!244 = !DILocation(line: 51, column: 33, scope: !218)
!245 = !DILocation(line: 51, column: 16, scope: !218)
!246 = !DILocation(line: 51, column: 5, scope: !218)
!247 = !DILocation(line: 51, column: 31, scope: !218)
!248 = !DILocation(line: 52, column: 18, scope: !218)
!249 = !DILocation(line: 53, column: 5, scope: !218)
!250 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 56, type: !251, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!251 = !DISubroutineType(types: !252)
!252 = !{!186, !253}
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !254, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !255, identifier: "_ZTS5INSTR")
!254 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!255 = !{!256, !257, !258, !259}
!256 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !253, file: !254, line: 24, baseType: !14, size: 32)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !253, file: !254, line: 25, baseType: !14, size: 32, offset: 32)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !253, file: !254, line: 26, baseType: !14, size: 32, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !253, file: !254, line: 27, baseType: !260, size: 192, offset: 128)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !254, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !261, identifier: "_ZTS15GEMM_STRUCT_REF")
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !260, file: !254, line: 6, baseType: !186, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !260, file: !254, line: 7, baseType: !186, size: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !260, file: !254, line: 8, baseType: !186, size: 64, offset: 128)
!265 = !DILocalVariable(name: "instr", arg: 1, scope: !250, file: !3, line: 56, type: !253)
!266 = !DILocation(line: 56, column: 35, scope: !250)
!267 = !DILocalVariable(name: "arr_ref", scope: !250, file: !3, line: 58, type: !186)
!268 = !DILocation(line: 58, column: 20, scope: !250)
!269 = !DILocalVariable(name: "inp", scope: !250, file: !3, line: 59, type: !143)
!270 = !DILocation(line: 59, column: 18, scope: !250)
!271 = !DILocalVariable(name: "wgt", scope: !250, file: !3, line: 59, type: !143)
!272 = !DILocation(line: 59, column: 26, scope: !250)
!273 = !DILocation(line: 60, column: 14, scope: !274)
!274 = distinct !DILexicalBlock(scope: !250, file: !3, line: 60, column: 8)
!275 = !DILocation(line: 60, column: 20, scope: !274)
!276 = !DILocation(line: 60, column: 8, scope: !250)
!277 = !DILocalVariable(name: "i", scope: !278, file: !3, line: 61, type: !10)
!278 = distinct !DILexicalBlock(scope: !279, file: !3, line: 61, column: 9)
!279 = distinct !DILexicalBlock(scope: !274, file: !3, line: 60, column: 25)
!280 = !DILocation(line: 61, column: 18, scope: !278)
!281 = !DILocation(line: 61, column: 14, scope: !278)
!282 = !DILocation(line: 61, column: 25, scope: !283)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 61, column: 9)
!284 = !DILocation(line: 61, column: 27, scope: !283)
!285 = !DILocation(line: 61, column: 9, scope: !278)
!286 = !DILocation(line: 62, column: 30, scope: !287)
!287 = distinct !DILexicalBlock(scope: !283, file: !3, line: 61, column: 37)
!288 = !DILocation(line: 62, column: 39, scope: !287)
!289 = !DILocation(line: 62, column: 49, scope: !287)
!290 = !DILocation(line: 62, column: 47, scope: !287)
!291 = !DILocation(line: 62, column: 22, scope: !287)
!292 = !DILocation(line: 62, column: 17, scope: !287)
!293 = !DILocation(line: 62, column: 13, scope: !287)
!294 = !DILocation(line: 62, column: 20, scope: !287)
!295 = !DILocation(line: 61, column: 33, scope: !283)
!296 = !DILocation(line: 61, column: 9, scope: !283)
!297 = distinct !{!297, !285, !298}
!298 = !DILocation(line: 63, column: 9, scope: !278)
!299 = !DILocalVariable(name: "i", scope: !300, file: !3, line: 64, type: !10)
!300 = distinct !DILexicalBlock(scope: !279, file: !3, line: 64, column: 9)
!301 = !DILocation(line: 64, column: 18, scope: !300)
!302 = !DILocation(line: 64, column: 14, scope: !300)
!303 = !DILocation(line: 64, column: 25, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !3, line: 64, column: 9)
!305 = !DILocation(line: 64, column: 27, scope: !304)
!306 = !DILocation(line: 64, column: 9, scope: !300)
!307 = !DILocation(line: 65, column: 30, scope: !308)
!308 = distinct !DILexicalBlock(scope: !304, file: !3, line: 64, column: 37)
!309 = !DILocation(line: 65, column: 39, scope: !308)
!310 = !DILocation(line: 65, column: 49, scope: !308)
!311 = !DILocation(line: 65, column: 47, scope: !308)
!312 = !DILocation(line: 65, column: 22, scope: !308)
!313 = !DILocation(line: 65, column: 17, scope: !308)
!314 = !DILocation(line: 65, column: 13, scope: !308)
!315 = !DILocation(line: 65, column: 20, scope: !308)
!316 = !DILocation(line: 64, column: 33, scope: !304)
!317 = !DILocation(line: 64, column: 9, scope: !304)
!318 = distinct !{!318, !306, !319}
!319 = !DILocation(line: 66, column: 9, scope: !300)
!320 = !DILocation(line: 67, column: 34, scope: !279)
!321 = !DILocation(line: 67, column: 39, scope: !279)
!322 = !DILocation(line: 67, column: 19, scope: !279)
!323 = !DILocation(line: 67, column: 17, scope: !279)
!324 = !DILocation(line: 68, column: 5, scope: !279)
!325 = !DILocation(line: 69, column: 16, scope: !250)
!326 = !DILocation(line: 69, column: 9, scope: !250)
!327 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 72, type: !328, scopeLine: 73, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!328 = !DISubroutineType(types: !329)
!329 = !{!186, !330}
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !254, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !331, identifier: "_ZTS9INSTR_VAL")
!331 = !{!332, !333, !334, !335}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !330, file: !254, line: 38, baseType: !14, size: 32)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !330, file: !254, line: 39, baseType: !14, size: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !330, file: !254, line: 40, baseType: !14, size: 32, offset: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !330, file: !254, line: 41, baseType: !336, size: 96, offset: 96)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !254, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !337, identifier: "_ZTS15GEMM_STRUCT_VAL")
!337 = !{!338, !339, !340}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !336, file: !254, line: 18, baseType: !14, size: 32)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !336, file: !254, line: 19, baseType: !14, size: 32, offset: 32)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !336, file: !254, line: 20, baseType: !14, size: 32, offset: 64)
!341 = !DILocalVariable(name: "instr", arg: 1, scope: !327, file: !3, line: 72, type: !330)
!342 = !DILocation(line: 72, column: 43, scope: !327)
!343 = !DILocalVariable(name: "arr_val", scope: !327, file: !3, line: 74, type: !186)
!344 = !DILocation(line: 74, column: 20, scope: !327)
!345 = !DILocalVariable(name: "inp", scope: !327, file: !3, line: 75, type: !143)
!346 = !DILocation(line: 75, column: 18, scope: !327)
!347 = !DILocalVariable(name: "wgt", scope: !327, file: !3, line: 75, type: !143)
!348 = !DILocation(line: 75, column: 26, scope: !327)
!349 = !DILocation(line: 76, column: 14, scope: !350)
!350 = distinct !DILexicalBlock(scope: !327, file: !3, line: 76, column: 8)
!351 = !DILocation(line: 76, column: 20, scope: !350)
!352 = !DILocation(line: 76, column: 8, scope: !327)
!353 = !DILocalVariable(name: "i", scope: !354, file: !3, line: 77, type: !10)
!354 = distinct !DILexicalBlock(scope: !355, file: !3, line: 77, column: 9)
!355 = distinct !DILexicalBlock(scope: !350, file: !3, line: 76, column: 25)
!356 = !DILocation(line: 77, column: 18, scope: !354)
!357 = !DILocation(line: 77, column: 14, scope: !354)
!358 = !DILocation(line: 77, column: 25, scope: !359)
!359 = distinct !DILexicalBlock(scope: !354, file: !3, line: 77, column: 9)
!360 = !DILocation(line: 77, column: 27, scope: !359)
!361 = !DILocation(line: 77, column: 9, scope: !354)
!362 = !DILocation(line: 78, column: 28, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !3, line: 77, column: 37)
!364 = !DILocation(line: 78, column: 37, scope: !363)
!365 = !DILocation(line: 78, column: 47, scope: !363)
!366 = !DILocation(line: 78, column: 45, scope: !363)
!367 = !DILocation(line: 78, column: 17, scope: !363)
!368 = !DILocation(line: 78, column: 13, scope: !363)
!369 = !DILocation(line: 78, column: 20, scope: !363)
!370 = !DILocation(line: 77, column: 33, scope: !359)
!371 = !DILocation(line: 77, column: 9, scope: !359)
!372 = distinct !{!372, !361, !373}
!373 = !DILocation(line: 79, column: 9, scope: !354)
!374 = !DILocalVariable(name: "i", scope: !375, file: !3, line: 80, type: !10)
!375 = distinct !DILexicalBlock(scope: !355, file: !3, line: 80, column: 9)
!376 = !DILocation(line: 80, column: 18, scope: !375)
!377 = !DILocation(line: 80, column: 14, scope: !375)
!378 = !DILocation(line: 80, column: 25, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !3, line: 80, column: 9)
!380 = !DILocation(line: 80, column: 27, scope: !379)
!381 = !DILocation(line: 80, column: 9, scope: !375)
!382 = !DILocation(line: 81, column: 28, scope: !383)
!383 = distinct !DILexicalBlock(scope: !379, file: !3, line: 80, column: 37)
!384 = !DILocation(line: 81, column: 37, scope: !383)
!385 = !DILocation(line: 81, column: 17, scope: !383)
!386 = !DILocation(line: 81, column: 13, scope: !383)
!387 = !DILocation(line: 81, column: 20, scope: !383)
!388 = !DILocation(line: 80, column: 33, scope: !379)
!389 = !DILocation(line: 80, column: 9, scope: !379)
!390 = distinct !{!390, !381, !391}
!391 = !DILocation(line: 82, column: 9, scope: !375)
!392 = !DILocation(line: 83, column: 37, scope: !355)
!393 = !DILocation(line: 83, column: 42, scope: !355)
!394 = !DILocation(line: 83, column: 19, scope: !355)
!395 = !DILocation(line: 83, column: 17, scope: !355)
!396 = !DILocation(line: 84, column: 5, scope: !355)
!397 = !DILocation(line: 85, column: 12, scope: !327)
!398 = !DILocation(line: 85, column: 5, scope: !327)
!399 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 88, type: !251, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!400 = !DILocalVariable(name: "myinsn", arg: 1, scope: !399, file: !3, line: 88, type: !253)
!401 = !DILocation(line: 88, column: 32, scope: !399)
!402 = !DILocalVariable(name: "row", scope: !399, file: !3, line: 89, type: !14)
