; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !14
@arr_val = dso_local global i32* null, align 8, !dbg !20
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !23
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !26
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !28
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !30
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !32
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !34
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!221 = !DILocalVariable(name: "mat2", arg: 2, scope: !216, file: !3, line: 42, type: !139)
!222 = !DILocation(line: 42, column: 61, scope: !216)
!223 = !DILocalVariable(name: "res", arg: 3, scope: !216, file: !3, line: 42, type: !139)
!224 = !DILocation(line: 42, column: 87, scope: !216)
!225 = !DILocalVariable(name: "i", scope: !226, file: !3, line: 43, type: !17)
!226 = distinct !DILexicalBlock(scope: !216, file: !3, line: 43, column: 5)
!227 = !DILocation(line: 43, column: 14, scope: !226)
!228 = !DILocation(line: 43, column: 10, scope: !226)
!229 = !DILocation(line: 43, column: 21, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !3, line: 43, column: 5)
!231 = !DILocation(line: 43, column: 23, scope: !230)
!232 = !DILocation(line: 43, column: 5, scope: !226)
!233 = !DILocalVariable(name: "j", scope: !234, file: !3, line: 44, type: !17)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 44, column: 9)
!235 = distinct !DILexicalBlock(scope: !230, file: !3, line: 43, column: 35)
!236 = !DILocation(line: 44, column: 18, scope: !234)
!237 = !DILocation(line: 44, column: 14, scope: !234)
!238 = !DILocation(line: 44, column: 25, scope: !239)
!239 = distinct !DILexicalBlock(scope: !234, file: !3, line: 44, column: 9)
!240 = !DILocation(line: 44, column: 27, scope: !239)
!241 = !DILocation(line: 44, column: 9, scope: !234)
!242 = !DILocalVariable(name: "k", scope: !243, file: !3, line: 45, type: !17)
!243 = distinct !DILexicalBlock(scope: !244, file: !3, line: 45, column: 13)
!244 = distinct !DILexicalBlock(scope: !239, file: !3, line: 44, column: 39)
!245 = !DILocation(line: 45, column: 22, scope: !243)
!246 = !DILocation(line: 45, column: 18, scope: !243)
!247 = !DILocation(line: 45, column: 29, scope: !248)
!248 = distinct !DILexicalBlock(scope: !243, file: !3, line: 45, column: 13)
!249 = !DILocation(line: 45, column: 31, scope: !248)
!250 = !DILocation(line: 45, column: 13, scope: !243)
!251 = !DILocation(line: 46, column: 42, scope: !252)
!252 = distinct !DILexicalBlock(scope: !248, file: !3, line: 45, column: 43)
!253 = !DILocation(line: 46, column: 34, scope: !252)
!254 = !DILocation(line: 46, column: 45, scope: !252)
!255 = !DILocation(line: 46, column: 58, scope: !252)
!256 = !DILocation(line: 46, column: 50, scope: !252)
!257 = !DILocation(line: 46, column: 61, scope: !252)
!258 = !DILocation(line: 46, column: 48, scope: !252)
!259 = !DILocation(line: 46, column: 25, scope: !252)
!260 = !DILocation(line: 46, column: 17, scope: !252)
!261 = !DILocation(line: 46, column: 28, scope: !252)
!262 = !DILocation(line: 46, column: 31, scope: !252)
!263 = !DILocation(line: 45, column: 39, scope: !248)
!264 = !DILocation(line: 45, column: 13, scope: !248)
!265 = distinct !{!265, !250, !266}
!266 = !DILocation(line: 47, column: 13, scope: !243)
!267 = !DILocation(line: 44, column: 35, scope: !239)
!268 = !DILocation(line: 44, column: 9, scope: !239)
!269 = distinct !{!269, !241, !270}
!270 = !DILocation(line: 48, column: 9, scope: !234)
!271 = !DILocation(line: 43, column: 31, scope: !230)
!272 = !DILocation(line: 43, column: 5, scope: !230)
!273 = distinct !{!273, !232, !274}
!274 = !DILocation(line: 49, column: 5, scope: !226)
!275 = !DILocalVariable(name: "i", scope: !276, file: !3, line: 50, type: !17)
!276 = distinct !DILexicalBlock(scope: !216, file: !3, line: 50, column: 5)
!277 = !DILocation(line: 50, column: 13, scope: !276)
!278 = !DILocation(line: 50, column: 9, scope: !276)
!279 = !DILocation(line: 50, column: 18, scope: !280)
!280 = distinct !DILexicalBlock(scope: !276, file: !3, line: 50, column: 5)
!281 = !DILocation(line: 50, column: 19, scope: !280)
!282 = !DILocation(line: 50, column: 5, scope: !276)
!283 = !DILocalVariable(name: "j", scope: !284, file: !3, line: 51, type: !17)
!284 = distinct !DILexicalBlock(scope: !285, file: !3, line: 51, column: 9)
!285 = distinct !DILexicalBlock(scope: !280, file: !3, line: 50, column: 28)
!286 = !DILocation(line: 51, column: 17, scope: !284)
!287 = !DILocation(line: 51, column: 13, scope: !284)
!288 = !DILocation(line: 51, column: 21, scope: !289)
!289 = distinct !DILexicalBlock(scope: !284, file: !3, line: 51, column: 9)
!290 = !DILocation(line: 51, column: 22, scope: !289)
!291 = !DILocation(line: 0, scope: !280)
!292 = !DILocation(line: 51, column: 9, scope: !284)
!293 = !DILocation(line: 52, column: 37, scope: !294)
!294 = distinct !DILexicalBlock(scope: !289, file: !3, line: 51, column: 31)
!295 = !DILocation(line: 52, column: 48, scope: !294)
!296 = !DILocation(line: 52, column: 26, scope: !294)
!297 = !DILocation(line: 52, column: 27, scope: !294)
!298 = !DILocation(line: 52, column: 32, scope: !294)
!299 = !DILocation(line: 52, column: 31, scope: !294)
!300 = !DILocation(line: 52, column: 13, scope: !294)
!301 = !DILocation(line: 52, column: 35, scope: !294)
!302 = !DILocation(line: 51, column: 28, scope: !289)
!303 = !DILocation(line: 51, column: 9, scope: !289)
!304 = distinct !{!304, !292, !305}
!305 = !DILocation(line: 53, column: 9, scope: !284)
!306 = !DILocation(line: 50, column: 25, scope: !280)
!307 = !DILocation(line: 50, column: 5, scope: !280)
!308 = distinct !{!308, !282, !309}
!309 = !DILocation(line: 54, column: 5, scope: !276)
!310 = !DILocation(line: 55, column: 5, scope: !216)
!311 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 58, type: !312, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!312 = !DISubroutineType(types: !313)
!313 = !{!22, !314}
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !315, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !316, identifier: "_ZTS5INSTR")
!315 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!316 = !{!317, !318, !319, !320}
!317 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !314, file: !315, line: 24, baseType: !11, size: 32)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !314, file: !315, line: 25, baseType: !11, size: 32, offset: 32)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !314, file: !315, line: 26, baseType: !11, size: 32, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !314, file: !315, line: 27, baseType: !321, size: 192, offset: 128)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !315, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !322, identifier: "_ZTS15GEMM_STRUCT_REF")
!322 = !{!323, !324, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !321, file: !315, line: 6, baseType: !22, size: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !321, file: !315, line: 7, baseType: !22, size: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !321, file: !315, line: 8, baseType: !22, size: 64, offset: 128)
!326 = !DILocalVariable(name: "instr", arg: 1, scope: !311, file: !3, line: 58, type: !314)
!327 = !DILocation(line: 58, column: 35, scope: !311)
!328 = !DILocalVariable(name: "arr_ref", scope: !311, file: !3, line: 60, type: !22)
!329 = !DILocation(line: 60, column: 19, scope: !311)
!330 = !DILocalVariable(name: "inp", scope: !311, file: !3, line: 61, type: !140)
!331 = !DILocation(line: 61, column: 18, scope: !311)
!332 = !DILocalVariable(name: "wgt", scope: !311, file: !3, line: 61, type: !140)
!333 = !DILocation(line: 61, column: 26, scope: !311)
!334 = !DILocation(line: 62, column: 14, scope: !335)
!335 = distinct !DILexicalBlock(scope: !311, file: !3, line: 62, column: 8)
!336 = !DILocation(line: 62, column: 20, scope: !335)
!337 = !DILocation(line: 62, column: 8, scope: !311)
!338 = !DILocalVariable(name: "i", scope: !339, file: !3, line: 63, type: !17)
!339 = distinct !DILexicalBlock(scope: !340, file: !3, line: 63, column: 9)
!340 = distinct !DILexicalBlock(scope: !335, file: !3, line: 62, column: 25)
!341 = !DILocation(line: 63, column: 18, scope: !339)
!342 = !DILocation(line: 63, column: 14, scope: !339)
!343 = !DILocation(line: 63, column: 25, scope: !344)
!344 = distinct !DILexicalBlock(scope: !339, file: !3, line: 63, column: 9)
!345 = !DILocation(line: 63, column: 27, scope: !344)
!346 = !DILocation(line: 63, column: 9, scope: !339)
!347 = !DILocation(line: 64, column: 30, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !3, line: 63, column: 37)
!349 = !DILocation(line: 64, column: 39, scope: !348)
!350 = !DILocation(line: 64, column: 49, scope: !348)
!351 = !DILocation(line: 64, column: 47, scope: !348)
!352 = !DILocation(line: 64, column: 22, scope: !348)
!353 = !DILocation(line: 64, column: 17, scope: !348)
!354 = !DILocation(line: 64, column: 13, scope: !348)
!355 = !DILocation(line: 64, column: 20, scope: !348)
!356 = !DILocation(line: 63, column: 33, scope: !344)
!357 = !DILocation(line: 63, column: 9, scope: !344)
!358 = distinct !{!358, !346, !359}
!359 = !DILocation(line: 65, column: 9, scope: !339)
!360 = !DILocalVariable(name: "i", scope: !361, file: !3, line: 66, type: !17)
!361 = distinct !DILexicalBlock(scope: !340, file: !3, line: 66, column: 9)
!362 = !DILocation(line: 66, column: 18, scope: !361)
!363 = !DILocation(line: 66, column: 14, scope: !361)
!364 = !DILocation(line: 66, column: 25, scope: !365)
!365 = distinct !DILexicalBlock(scope: !361, file: !3, line: 66, column: 9)
!366 = !DILocation(line: 66, column: 27, scope: !365)
!367 = !DILocation(line: 66, column: 9, scope: !361)
!368 = !DILocation(line: 67, column: 30, scope: !369)
!369 = distinct !DILexicalBlock(scope: !365, file: !3, line: 66, column: 37)
!370 = !DILocation(line: 67, column: 39, scope: !369)
!371 = !DILocation(line: 67, column: 49, scope: !369)
!372 = !DILocation(line: 67, column: 47, scope: !369)
!373 = !DILocation(line: 67, column: 22, scope: !369)
!374 = !DILocation(line: 67, column: 17, scope: !369)
!375 = !DILocation(line: 67, column: 13, scope: !369)
!376 = !DILocation(line: 67, column: 20, scope: !369)
!377 = !DILocation(line: 66, column: 33, scope: !365)
!378 = !DILocation(line: 66, column: 9, scope: !365)
!379 = distinct !{!379, !367, !380}
!380 = !DILocation(line: 68, column: 9, scope: !361)
!381 = !DILocation(line: 69, column: 34, scope: !340)
!382 = !DILocation(line: 69, column: 39, scope: !340)
!383 = !DILocation(line: 69, column: 19, scope: !340)
!384 = !DILocation(line: 69, column: 17, scope: !340)
!385 = !DILocation(line: 70, column: 5, scope: !340)
!386 = !DILocation(line: 71, column: 16, scope: !311)
!387 = !DILocation(line: 71, column: 9, scope: !311)
!388 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 74, type: !389, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!389 = !DISubroutineType(types: !390)
!390 = !{!22, !391}
!391 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !315, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !392, identifier: "_ZTS9INSTR_VAL")
!392 = !{!393, !394, !395, !396}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !391, file: !315, line: 38, baseType: !11, size: 32)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !391, file: !315, line: 39, baseType: !11, size: 32, offset: 32)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !391, file: !315, line: 40, baseType: !11, size: 32, offset: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !391, file: !315, line: 41, baseType: !397, size: 96, offset: 96)
!397 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !315, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !398, identifier: "_ZTS15GEMM_STRUCT_VAL")
!398 = !{!399, !400, !401}
!399 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !397, file: !315, line: 18, baseType: !11, size: 32)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !397, file: !315, line: 19, baseType: !11, size: 32, offset: 32)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !397, file: !315, line: 20, baseType: !11, size: 32, offset: 64)
!402 = !DILocalVariable(name: "instr", arg: 1, scope: !388, file: !3, line: 74, type: !391)
!403 = !DILocation(line: 74, column: 43, scope: !388)
!404 = !DILocalVariable(name: "arr_val", scope: !388, file: !3, line: 76, type: !22)
!405 = !DILocation(line: 76, column: 20, scope: !388)
!406 = !DILocalVariable(name: "inp", scope: !388, file: !3, line: 77, type: !140)
!407 = !DILocation(line: 77, column: 18, scope: !388)
!408 = !DILocalVariable(name: "wgt", scope: !388, file: !3, line: 77, type: !140)
!409 = !DILocation(line: 77, column: 26, scope: !388)
!410 = !DILocation(line: 78, column: 14, scope: !411)
!411 = distinct !DILexicalBlock(scope: !388, file: !3, line: 78, column: 8)
!412 = !DILocation(line: 78, column: 20, scope: !411)
!413 = !DILocation(line: 78, column: 8, scope: !388)
!414 = !DILocalVariable(name: "i", scope: !415, file: !3, line: 79, type: !17)
!415 = distinct !DILexicalBlock(scope: !416, file: !3, line: 79, column: 9)
!416 = distinct !DILexicalBlock(scope: !411, file: !3, line: 78, column: 25)
!417 = !DILocation(line: 79, column: 18, scope: !415)
!418 = !DILocation(line: 79, column: 14, scope: !415)
!419 = !DILocation(line: 79, column: 25, scope: !420)
!420 = distinct !DILexicalBlock(scope: !415, file: !3, line: 79, column: 9)
!421 = !DILocation(line: 79, column: 27, scope: !420)
!422 = !DILocation(line: 79, column: 9, scope: !415)
!423 = !DILocation(line: 80, column: 28, scope: !424)
!424 = distinct !DILexicalBlock(scope: !420, file: !3, line: 79, column: 37)
!425 = !DILocation(line: 80, column: 37, scope: !424)
!426 = !DILocation(line: 80, column: 47, scope: !424)
!427 = !DILocation(line: 80, column: 45, scope: !424)
!428 = !DILocation(line: 80, column: 17, scope: !424)
!429 = !DILocation(line: 80, column: 13, scope: !424)
!430 = !DILocation(line: 80, column: 20, scope: !424)
!431 = !DILocation(line: 79, column: 33, scope: !420)
!432 = !DILocation(line: 79, column: 9, scope: !420)
!433 = distinct !{!433, !422, !434}
!434 = !DILocation(line: 81, column: 9, scope: !415)
!435 = !DILocalVariable(name: "i", scope: !436, file: !3, line: 82, type: !17)
!436 = distinct !DILexicalBlock(scope: !416, file: !3, line: 82, column: 9)
!437 = !DILocation(line: 82, column: 18, scope: !436)
!438 = !DILocation(line: 82, column: 14, scope: !436)
!439 = !DILocation(line: 82, column: 25, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !3, line: 82, column: 9)
!441 = !DILocation(line: 82, column: 27, scope: !440)
!442 = !DILocation(line: 82, column: 9, scope: !436)
!443 = !DILocation(line: 83, column: 28, scope: !444)
!444 = distinct !DILexicalBlock(scope: !440, file: !3, line: 82, column: 37)
!445 = !DILocation(line: 83, column: 37, scope: !444)
!446 = !DILocation(line: 83, column: 17, scope: !444)
!447 = !DILocation(line: 83, column: 13, scope: !444)
!448 = !DILocation(line: 83, column: 20, scope: !444)
!449 = !DILocation(line: 82, column: 33, scope: !440)
!450 = !DILocation(line: 82, column: 9, scope: !440)
!451 = distinct !{!451, !442, !452}
!452 = !DILocation(line: 84, column: 9, scope: !436)
!453 = !DILocation(line: 85, column: 34, scope: !416)
!454 = !DILocation(line: 85, column: 39, scope: !416)
!455 = !DILocation(line: 85, column: 19, scope: !416)
!456 = !DILocation(line: 85, column: 17, scope: !416)
!457 = !DILocation(line: 86, column: 5, scope: !416)
!458 = !DILocation(line: 87, column: 12, scope: !388)
!459 = !DILocation(line: 87, column: 5, scope: !388)
!460 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 90, type: !312, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!461 = !DILocalVariable(name: "myinsn", arg: 1, scope: !460, file: !3, line: 90, type: !314)
!462 = !DILocation(line: 90, column: 32, scope: !460)
!463 = !DILocalVariable(name: "row", scope: !460, file: !3, line: 91, type: !11)
