; ModuleID = 'gemm.bc'
source_filename = "gemm.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@result = dso_local global [10 x i32] zeroinitializer, align 16, !dbg !0
@arr_val = dso_local global i32* null, align 8, !dbg !8
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !12
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !17
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !19
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !21
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !23
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1
@.str.2 = private unnamed_addr constant [34 x i8] c"acc_mem_gemm[i] == acc_mem_ref[i]\00", align 1
@.str.3 = private unnamed_addr constant [9 x i8] c"gemm.cpp\00", align 1

!219 = !DILocalVariable(name: "mat2", arg: 2, scope: !214, file: !3, line: 40, type: !135)
!220 = !DILocation(line: 40, column: 61, scope: !214)
!221 = !DILocalVariable(name: "res", arg: 3, scope: !214, file: !3, line: 40, type: !135)
!222 = !DILocation(line: 40, column: 87, scope: !214)
!223 = !DILocalVariable(name: "i", scope: !224, file: !3, line: 41, type: !38)
!224 = distinct !DILexicalBlock(scope: !214, file: !3, line: 41, column: 5)
!225 = !DILocation(line: 41, column: 14, scope: !224)
!226 = !DILocation(line: 41, column: 10, scope: !224)
!227 = !DILocation(line: 41, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !224, file: !3, line: 41, column: 5)
!229 = !DILocation(line: 41, column: 23, scope: !228)
!230 = !DILocation(line: 41, column: 5, scope: !224)
!231 = !DILocalVariable(name: "j", scope: !232, file: !3, line: 42, type: !38)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 42, column: 9)
!233 = distinct !DILexicalBlock(scope: !228, file: !3, line: 41, column: 35)
!234 = !DILocation(line: 42, column: 18, scope: !232)
!235 = !DILocation(line: 42, column: 14, scope: !232)
!236 = !DILocation(line: 42, column: 25, scope: !237)
!237 = distinct !DILexicalBlock(scope: !232, file: !3, line: 42, column: 9)
!238 = !DILocation(line: 42, column: 27, scope: !237)
!239 = !DILocation(line: 42, column: 9, scope: !232)
!240 = !DILocalVariable(name: "k", scope: !241, file: !3, line: 43, type: !38)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 43, column: 13)
!242 = distinct !DILexicalBlock(scope: !237, file: !3, line: 42, column: 39)
!243 = !DILocation(line: 43, column: 22, scope: !241)
!244 = !DILocation(line: 43, column: 18, scope: !241)
!245 = !DILocation(line: 43, column: 29, scope: !246)
!246 = distinct !DILexicalBlock(scope: !241, file: !3, line: 43, column: 13)
!247 = !DILocation(line: 43, column: 31, scope: !246)
!248 = !DILocation(line: 43, column: 13, scope: !241)
!249 = !DILocation(line: 44, column: 42, scope: !250)
!250 = distinct !DILexicalBlock(scope: !246, file: !3, line: 43, column: 43)
!251 = !DILocation(line: 44, column: 34, scope: !250)
!252 = !DILocation(line: 44, column: 45, scope: !250)
!253 = !DILocation(line: 44, column: 58, scope: !250)
!254 = !DILocation(line: 44, column: 50, scope: !250)
!255 = !DILocation(line: 44, column: 61, scope: !250)
!256 = !DILocation(line: 44, column: 48, scope: !250)
!257 = !DILocation(line: 44, column: 25, scope: !250)
!258 = !DILocation(line: 44, column: 17, scope: !250)
!259 = !DILocation(line: 44, column: 28, scope: !250)
!260 = !DILocation(line: 44, column: 31, scope: !250)
!261 = !DILocation(line: 43, column: 39, scope: !246)
!262 = !DILocation(line: 43, column: 13, scope: !246)
!263 = distinct !{!263, !248, !264}
!264 = !DILocation(line: 45, column: 13, scope: !241)
!265 = !DILocation(line: 42, column: 35, scope: !237)
!266 = !DILocation(line: 42, column: 9, scope: !237)
!267 = distinct !{!267, !239, !268}
!268 = !DILocation(line: 46, column: 9, scope: !232)
!269 = !DILocation(line: 41, column: 31, scope: !228)
!270 = !DILocation(line: 41, column: 5, scope: !228)
!271 = distinct !{!271, !230, !272}
!272 = !DILocation(line: 47, column: 5, scope: !224)
!273 = !DILocalVariable(name: "i", scope: !274, file: !3, line: 48, type: !38)
!274 = distinct !DILexicalBlock(scope: !214, file: !3, line: 48, column: 5)
!275 = !DILocation(line: 48, column: 13, scope: !274)
!276 = !DILocation(line: 48, column: 9, scope: !274)
!277 = !DILocation(line: 48, column: 18, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !3, line: 48, column: 5)
!279 = !DILocation(line: 48, column: 19, scope: !278)
!280 = !DILocation(line: 48, column: 5, scope: !274)
!281 = !DILocalVariable(name: "j", scope: !282, file: !3, line: 49, type: !38)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 49, column: 9)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 48, column: 28)
!284 = !DILocation(line: 49, column: 17, scope: !282)
!285 = !DILocation(line: 49, column: 13, scope: !282)
!286 = !DILocation(line: 49, column: 21, scope: !287)
!287 = distinct !DILexicalBlock(scope: !282, file: !3, line: 49, column: 9)
!288 = !DILocation(line: 49, column: 22, scope: !287)
!289 = !DILocation(line: 0, scope: !278)
!290 = !DILocation(line: 49, column: 9, scope: !282)
!291 = !DILocation(line: 50, column: 37, scope: !292)
!292 = distinct !DILexicalBlock(scope: !287, file: !3, line: 49, column: 31)
!293 = !DILocation(line: 50, column: 48, scope: !292)
!294 = !DILocation(line: 50, column: 26, scope: !292)
!295 = !DILocation(line: 50, column: 27, scope: !292)
!296 = !DILocation(line: 50, column: 32, scope: !292)
!297 = !DILocation(line: 50, column: 31, scope: !292)
!298 = !DILocation(line: 50, column: 13, scope: !292)
!299 = !DILocation(line: 50, column: 35, scope: !292)
!300 = !DILocation(line: 49, column: 28, scope: !287)
!301 = !DILocation(line: 49, column: 9, scope: !287)
!302 = distinct !{!302, !290, !303}
!303 = !DILocation(line: 51, column: 9, scope: !282)
!304 = !DILocation(line: 48, column: 25, scope: !278)
!305 = !DILocation(line: 48, column: 5, scope: !278)
!306 = distinct !{!306, !280, !307}
!307 = !DILocation(line: 52, column: 5, scope: !274)
!308 = !DILocation(line: 53, column: 5, scope: !214)
!309 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 56, type: !310, scopeLine: 57, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!310 = !DISubroutineType(types: !311)
!311 = !{!10, !312}
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !313, line: 17, size: 320, flags: DIFlagTypePassByValue, elements: !314, identifier: "_ZTS5INSTR")
!313 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !312, file: !313, line: 18, baseType: !11, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !312, file: !313, line: 19, baseType: !11, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !312, file: !313, line: 20, baseType: !11, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !312, file: !313, line: 21, baseType: !319, size: 192, offset: 128)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !313, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !320, identifier: "_ZTS15GEMM_STRUCT_REF")
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !319, file: !313, line: 6, baseType: !10, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !319, file: !313, line: 7, baseType: !10, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !319, file: !313, line: 8, baseType: !10, size: 64, offset: 128)
!324 = !DILocalVariable(name: "instr", arg: 1, scope: !309, file: !3, line: 56, type: !312)
!325 = !DILocation(line: 56, column: 35, scope: !309)
!326 = !DILocalVariable(name: "arr_ref", scope: !309, file: !3, line: 58, type: !10)
!327 = !DILocation(line: 58, column: 20, scope: !309)
!328 = !DILocalVariable(name: "inp", scope: !309, file: !3, line: 59, type: !136)
!329 = !DILocation(line: 59, column: 18, scope: !309)
!330 = !DILocalVariable(name: "wgt", scope: !309, file: !3, line: 59, type: !136)
!331 = !DILocation(line: 59, column: 26, scope: !309)
!332 = !DILocalVariable(name: "i", scope: !333, file: !3, line: 60, type: !38)
!333 = distinct !DILexicalBlock(scope: !309, file: !3, line: 60, column: 5)
!334 = !DILocation(line: 60, column: 14, scope: !333)
!335 = !DILocation(line: 60, column: 10, scope: !333)
!336 = !DILocation(line: 60, column: 18, scope: !337)
!337 = distinct !DILexicalBlock(scope: !333, file: !3, line: 60, column: 5)
!338 = !DILocation(line: 60, column: 19, scope: !337)
!339 = !DILocation(line: 60, column: 5, scope: !333)
!340 = !DILocation(line: 61, column: 26, scope: !341)
!341 = distinct !DILexicalBlock(scope: !337, file: !3, line: 60, column: 26)
!342 = !DILocation(line: 61, column: 35, scope: !341)
!343 = !DILocation(line: 61, column: 43, scope: !341)
!344 = !DILocation(line: 61, column: 42, scope: !341)
!345 = !DILocation(line: 61, column: 18, scope: !341)
!346 = !DILocation(line: 61, column: 13, scope: !341)
!347 = !DILocation(line: 61, column: 9, scope: !341)
!348 = !DILocation(line: 61, column: 16, scope: !341)
!349 = !DILocation(line: 60, column: 23, scope: !337)
!350 = !DILocation(line: 60, column: 5, scope: !337)
!351 = distinct !{!351, !339, !352}
!352 = !DILocation(line: 62, column: 5, scope: !333)
!353 = !DILocalVariable(name: "i", scope: !354, file: !3, line: 63, type: !38)
!354 = distinct !DILexicalBlock(scope: !309, file: !3, line: 63, column: 5)
!355 = !DILocation(line: 63, column: 14, scope: !354)
!356 = !DILocation(line: 63, column: 10, scope: !354)
!357 = !DILocation(line: 63, column: 18, scope: !358)
!358 = distinct !DILexicalBlock(scope: !354, file: !3, line: 63, column: 5)
!359 = !DILocation(line: 63, column: 19, scope: !358)
!360 = !DILocation(line: 63, column: 5, scope: !354)
!361 = !DILocation(line: 64, column: 26, scope: !362)
!362 = distinct !DILexicalBlock(scope: !358, file: !3, line: 63, column: 26)
!363 = !DILocation(line: 64, column: 35, scope: !362)
!364 = !DILocation(line: 64, column: 43, scope: !362)
!365 = !DILocation(line: 64, column: 42, scope: !362)
!366 = !DILocation(line: 64, column: 18, scope: !362)
!367 = !DILocation(line: 64, column: 13, scope: !362)
!368 = !DILocation(line: 64, column: 9, scope: !362)
!369 = !DILocation(line: 64, column: 16, scope: !362)
!370 = !DILocation(line: 63, column: 23, scope: !358)
!371 = !DILocation(line: 63, column: 5, scope: !358)
!372 = distinct !{!372, !360, !373}
!373 = !DILocation(line: 65, column: 5, scope: !354)
!374 = !DILocation(line: 66, column: 30, scope: !309)
!375 = !DILocation(line: 66, column: 34, scope: !309)
!376 = !DILocation(line: 66, column: 15, scope: !309)
!377 = !DILocation(line: 66, column: 13, scope: !309)
!378 = !DILocation(line: 67, column: 12, scope: !309)
!379 = !DILocation(line: 67, column: 5, scope: !309)
!380 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 70, type: !381, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!381 = !DISubroutineType(types: !382)
!382 = !{!10, !383}
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !313, line: 24, size: 192, flags: DIFlagTypePassByValue, elements: !384, identifier: "_ZTS9INSTR_VAL")
!384 = !{!385, !386, !387, !388}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !383, file: !313, line: 25, baseType: !11, size: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !383, file: !313, line: 26, baseType: !11, size: 32, offset: 32)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !383, file: !313, line: 27, baseType: !11, size: 32, offset: 64)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !383, file: !313, line: 28, baseType: !389, size: 96, offset: 96)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !313, line: 11, size: 96, flags: DIFlagTypePassByValue, elements: !390, identifier: "_ZTS15GEMM_STRUCT_VAL")
!390 = !{!391, !392, !393}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !389, file: !313, line: 12, baseType: !11, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !389, file: !313, line: 13, baseType: !11, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !389, file: !313, line: 14, baseType: !11, size: 32, offset: 64)
!394 = !DILocalVariable(name: "instr", arg: 1, scope: !380, file: !3, line: 70, type: !383)
!395 = !DILocation(line: 70, column: 43, scope: !380)
!396 = !DILocalVariable(name: "arr_val", scope: !380, file: !3, line: 72, type: !10)
!397 = !DILocation(line: 72, column: 20, scope: !380)
!398 = !DILocalVariable(name: "inp", scope: !380, file: !3, line: 73, type: !136)
!399 = !DILocation(line: 73, column: 18, scope: !380)
!400 = !DILocalVariable(name: "wgt", scope: !380, file: !3, line: 73, type: !136)
!401 = !DILocation(line: 73, column: 26, scope: !380)
!402 = !DILocalVariable(name: "i", scope: !403, file: !3, line: 74, type: !38)
!403 = distinct !DILexicalBlock(scope: !380, file: !3, line: 74, column: 5)
!404 = !DILocation(line: 74, column: 14, scope: !403)
!405 = !DILocation(line: 74, column: 10, scope: !403)
!406 = !DILocation(line: 74, column: 18, scope: !407)
!407 = distinct !DILexicalBlock(scope: !403, file: !3, line: 74, column: 5)
!408 = !DILocation(line: 74, column: 19, scope: !407)
!409 = !DILocation(line: 74, column: 5, scope: !403)
!410 = !DILocation(line: 75, column: 24, scope: !411)
!411 = distinct !DILexicalBlock(scope: !407, file: !3, line: 74, column: 26)
!412 = !DILocation(line: 75, column: 33, scope: !411)
!413 = !DILocation(line: 75, column: 41, scope: !411)
!414 = !DILocation(line: 75, column: 40, scope: !411)
!415 = !DILocation(line: 75, column: 13, scope: !411)
!416 = !DILocation(line: 75, column: 9, scope: !411)
!417 = !DILocation(line: 75, column: 16, scope: !411)
!418 = !DILocation(line: 74, column: 23, scope: !407)
!419 = !DILocation(line: 74, column: 5, scope: !407)
!420 = distinct !{!420, !409, !421}
!421 = !DILocation(line: 76, column: 5, scope: !403)
!422 = !DILocalVariable(name: "i", scope: !423, file: !3, line: 77, type: !38)
!423 = distinct !DILexicalBlock(scope: !380, file: !3, line: 77, column: 5)
!424 = !DILocation(line: 77, column: 14, scope: !423)
!425 = !DILocation(line: 77, column: 10, scope: !423)
!426 = !DILocation(line: 77, column: 18, scope: !427)
!427 = distinct !DILexicalBlock(scope: !423, file: !3, line: 77, column: 5)
!428 = !DILocation(line: 77, column: 19, scope: !427)
!429 = !DILocation(line: 77, column: 5, scope: !423)
!430 = !DILocation(line: 78, column: 24, scope: !431)
!431 = distinct !DILexicalBlock(scope: !427, file: !3, line: 77, column: 26)
!432 = !DILocation(line: 78, column: 33, scope: !431)
!433 = !DILocation(line: 78, column: 13, scope: !431)
!434 = !DILocation(line: 78, column: 9, scope: !431)
!435 = !DILocation(line: 78, column: 16, scope: !431)
!436 = !DILocation(line: 77, column: 23, scope: !427)
!437 = !DILocation(line: 77, column: 5, scope: !427)
!438 = distinct !{!438, !429, !439}
!439 = !DILocation(line: 79, column: 5, scope: !423)
!440 = !DILocation(line: 80, column: 30, scope: !380)
!441 = !DILocation(line: 80, column: 34, scope: !380)
!442 = !DILocation(line: 80, column: 15, scope: !380)
!443 = !DILocation(line: 80, column: 13, scope: !380)
!444 = !DILocation(line: 81, column: 12, scope: !380)
!445 = !DILocation(line: 81, column: 5, scope: !380)
!446 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 88, type: !447, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!447 = !DISubroutineType(types: !448)
!448 = !{!38, !38, !449}
!449 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!450 = !DILocalVariable(name: "argc", arg: 1, scope: !446, file: !3, line: 88, type: !38)
!451 = !DILocation(line: 88, column: 14, scope: !446)
!452 = !DILocalVariable(name: "argv", arg: 2, scope: !446, file: !3, line: 88, type: !449)
!453 = !DILocation(line: 88, column: 32, scope: !446)
!454 = !DILocalVariable(name: "inp_mem_row0", scope: !446, file: !3, line: 90, type: !136)
!455 = !DILocation(line: 90, column: 18, scope: !446)
