; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !6
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !12
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !18
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !21
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !23
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !25
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !27
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !29
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!125 = !DIFile(filename: "/tmp/klee_src/runtime/Freestanding/memcpy.c", directory: "/tmp/klee_build90stp_z3/runtime/Freestanding")
!126 = !{i32 2, !"Dwarf Version", i32 4}
!127 = !{i32 2, !"Debug Info Version", i32 3}
!128 = !{i32 1, !"wchar_size", i32 4}
!129 = !{!"clang version 9.0.1 (https://github.com/llvm/llvm-project.git c1a0a213378a458fbea1a5c77b315c7dce08fd05)"}
!130 = !{!"clang version 9.0.0-2~ubuntu18.04.2 (tags/RELEASE_900/final)"}
!131 = distinct !DISubprogram(name: "transpose", linkageName: "_Z9transposePA3_jS0_", scope: !3, file: !3, line: 22, type: !132, scopeLine: 23, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!132 = !DISubroutineType(types: !133)
!133 = !{null, !134, !134}
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !135, size: 64)
!135 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 96, elements: !136)
!136 = !{!17}
!137 = !DILocalVariable(name: "wgt_mem", arg: 1, scope: !131, file: !3, line: 22, type: !134)
!138 = !DILocation(line: 22, column: 29, scope: !131)
!139 = !DILocalVariable(name: "wgt_mem_prime", arg: 2, scope: !131, file: !3, line: 22, type: !134)
!140 = !DILocation(line: 22, column: 58, scope: !131)
!141 = !DILocalVariable(name: "i", scope: !131, file: !3, line: 24, type: !15)
!142 = !DILocation(line: 24, column: 9, scope: !131)
!143 = !DILocalVariable(name: "j", scope: !131, file: !3, line: 24, type: !15)
!144 = !DILocation(line: 24, column: 12, scope: !131)
!145 = !DILocation(line: 25, column: 12, scope: !146)
!146 = distinct !DILexicalBlock(scope: !131, file: !3, line: 25, column: 5)
!147 = !DILocation(line: 25, column: 10, scope: !146)
!148 = !DILocation(line: 25, column: 17, scope: !149)
!149 = distinct !DILexicalBlock(scope: !146, file: !3, line: 25, column: 5)
!150 = !DILocation(line: 25, column: 19, scope: !149)
!151 = !DILocation(line: 25, column: 5, scope: !146)
!152 = !DILocation(line: 26, column: 16, scope: !153)
!153 = distinct !DILexicalBlock(scope: !149, file: !3, line: 26, column: 9)
!154 = !DILocation(line: 26, column: 14, scope: !153)
!155 = !DILocation(line: 26, column: 21, scope: !156)
!156 = distinct !DILexicalBlock(scope: !153, file: !3, line: 26, column: 9)
!157 = !DILocation(line: 26, column: 23, scope: !156)
!158 = !DILocation(line: 26, column: 9, scope: !153)
!159 = !DILocation(line: 27, column: 35, scope: !156)
!160 = !DILocation(line: 27, column: 43, scope: !156)
!161 = !DILocation(line: 27, column: 46, scope: !156)
!162 = !DILocation(line: 27, column: 13, scope: !156)
!163 = !DILocation(line: 27, column: 27, scope: !156)
!164 = !DILocation(line: 27, column: 30, scope: !156)
!165 = !DILocation(line: 27, column: 33, scope: !156)
!166 = !DILocation(line: 26, column: 31, scope: !156)
!167 = !DILocation(line: 26, column: 9, scope: !156)
!168 = distinct !{!168, !158, !169}
!169 = !DILocation(line: 27, column: 47, scope: !153)
!170 = !DILocation(line: 25, column: 27, scope: !149)
!171 = !DILocation(line: 25, column: 5, scope: !149)
!172 = distinct !{!172, !151, !173}
!173 = !DILocation(line: 27, column: 47, scope: !146)
!174 = !DILocation(line: 28, column: 1, scope: !131)
!175 = distinct !DISubprogram(name: "matrixMultiply", linkageName: "_Z14matrixMultiplyPjS_", scope: !3, file: !3, line: 30, type: !176, scopeLine: 31, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!176 = !DISubroutineType(types: !177)
!177 = !{!178, !178, !178}
!178 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !9, size: 64)
!179 = !DILocalVariable(name: "mat1", arg: 1, scope: !175, file: !3, line: 30, type: !178)
!180 = !DILocation(line: 30, column: 43, scope: !175)
!181 = !DILocalVariable(name: "mat2", arg: 2, scope: !175, file: !3, line: 30, type: !178)
!182 = !DILocation(line: 30, column: 64, scope: !175)
!183 = !DILocalVariable(name: "res", scope: !175, file: !3, line: 32, type: !9)
!184 = !DILocation(line: 32, column: 18, scope: !175)
!185 = !DILocalVariable(name: "i", scope: !186, file: !3, line: 33, type: !15)
!186 = distinct !DILexicalBlock(scope: !175, file: !3, line: 33, column: 5)
!187 = !DILocation(line: 33, column: 13, scope: !186)
!188 = !DILocation(line: 33, column: 9, scope: !186)
!189 = !DILocation(line: 33, column: 20, scope: !190)
!190 = distinct !DILexicalBlock(scope: !186, file: !3, line: 33, column: 5)
!191 = !DILocation(line: 33, column: 22, scope: !190)
!192 = !DILocation(line: 33, column: 5, scope: !186)
!193 = !DILocation(line: 35, column: 16, scope: !194)
!194 = distinct !DILexicalBlock(scope: !190, file: !3, line: 34, column: 5)
!195 = !DILocation(line: 35, column: 21, scope: !194)
!196 = !DILocation(line: 35, column: 26, scope: !194)
!197 = !DILocation(line: 35, column: 31, scope: !194)
!198 = !DILocation(line: 35, column: 24, scope: !194)
!199 = !DILocation(line: 35, column: 13, scope: !194)
!200 = !DILocation(line: 33, column: 28, scope: !190)
!201 = !DILocation(line: 33, column: 5, scope: !190)
!202 = distinct !{!202, !192, !203}
!203 = !DILocation(line: 36, column: 5, scope: !186)
!204 = !DILocation(line: 37, column: 25, scope: !175)
!205 = !DILocation(line: 37, column: 12, scope: !175)
!206 = !DILocation(line: 37, column: 5, scope: !175)
!207 = !DILocation(line: 37, column: 23, scope: !175)
!208 = !DILocation(line: 38, column: 14, scope: !175)
!209 = !DILocation(line: 39, column: 5, scope: !175)
!210 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 58, type: !211, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!211 = !DISubroutineType(types: !212)
!212 = !{!178, !213}
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !214, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !215, identifier: "_ZTS5INSTR")
!214 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!215 = !{!216, !217, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !213, file: !214, line: 24, baseType: !9, size: 32)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !213, file: !214, line: 25, baseType: !9, size: 32, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !213, file: !214, line: 26, baseType: !9, size: 32, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !213, file: !214, line: 27, baseType: !220, size: 192, offset: 128)
!220 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !214, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !221, identifier: "_ZTS15GEMM_STRUCT_REF")
!221 = !{!222, !223, !224}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !220, file: !214, line: 6, baseType: !178, size: 64)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !220, file: !214, line: 7, baseType: !178, size: 64, offset: 64)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !220, file: !214, line: 8, baseType: !178, size: 64, offset: 128)
!225 = !DILocalVariable(name: "instr", arg: 1, scope: !210, file: !3, line: 58, type: !213)
!226 = !DILocation(line: 58, column: 35, scope: !210)
!227 = !DILocalVariable(name: "arr_ref", scope: !210, file: !3, line: 60, type: !178)
!228 = !DILocation(line: 60, column: 20, scope: !210)
!229 = !DILocalVariable(name: "inp", scope: !210, file: !3, line: 61, type: !135)
!230 = !DILocation(line: 61, column: 18, scope: !210)
!231 = !DILocalVariable(name: "wgt", scope: !210, file: !3, line: 61, type: !135)
!232 = !DILocation(line: 61, column: 26, scope: !210)
!233 = !DILocation(line: 62, column: 14, scope: !234)
!234 = distinct !DILexicalBlock(scope: !210, file: !3, line: 62, column: 8)
!235 = !DILocation(line: 62, column: 20, scope: !234)
!236 = !DILocation(line: 62, column: 8, scope: !210)
!237 = !DILocalVariable(name: "i", scope: !238, file: !3, line: 63, type: !15)
!238 = distinct !DILexicalBlock(scope: !239, file: !3, line: 63, column: 9)
!239 = distinct !DILexicalBlock(scope: !234, file: !3, line: 62, column: 25)
!240 = !DILocation(line: 63, column: 18, scope: !238)
!241 = !DILocation(line: 63, column: 14, scope: !238)
!242 = !DILocation(line: 63, column: 25, scope: !243)
!243 = distinct !DILexicalBlock(scope: !238, file: !3, line: 63, column: 9)
!244 = !DILocation(line: 63, column: 27, scope: !243)
!245 = !DILocation(line: 63, column: 9, scope: !238)
!246 = !DILocation(line: 64, column: 30, scope: !247)
!247 = distinct !DILexicalBlock(scope: !243, file: !3, line: 63, column: 37)
!248 = !DILocation(line: 64, column: 39, scope: !247)
!249 = !DILocation(line: 64, column: 49, scope: !247)
!250 = !DILocation(line: 64, column: 47, scope: !247)
!251 = !DILocation(line: 64, column: 22, scope: !247)
!252 = !DILocation(line: 64, column: 17, scope: !247)
!253 = !DILocation(line: 64, column: 13, scope: !247)
!254 = !DILocation(line: 64, column: 20, scope: !247)
!255 = !DILocation(line: 63, column: 33, scope: !243)
!256 = !DILocation(line: 63, column: 9, scope: !243)
!257 = distinct !{!257, !245, !258}
!258 = !DILocation(line: 65, column: 9, scope: !238)
!259 = !DILocalVariable(name: "i", scope: !260, file: !3, line: 66, type: !15)
!260 = distinct !DILexicalBlock(scope: !239, file: !3, line: 66, column: 9)
!261 = !DILocation(line: 66, column: 18, scope: !260)
!262 = !DILocation(line: 66, column: 14, scope: !260)
!263 = !DILocation(line: 66, column: 25, scope: !264)
!264 = distinct !DILexicalBlock(scope: !260, file: !3, line: 66, column: 9)
!265 = !DILocation(line: 66, column: 27, scope: !264)
!266 = !DILocation(line: 66, column: 9, scope: !260)
!267 = !DILocation(line: 67, column: 30, scope: !268)
!268 = distinct !DILexicalBlock(scope: !264, file: !3, line: 66, column: 37)
!269 = !DILocation(line: 67, column: 39, scope: !268)
!270 = !DILocation(line: 67, column: 49, scope: !268)
!271 = !DILocation(line: 67, column: 47, scope: !268)
!272 = !DILocation(line: 67, column: 22, scope: !268)
!273 = !DILocation(line: 67, column: 17, scope: !268)
!274 = !DILocation(line: 67, column: 13, scope: !268)
!275 = !DILocation(line: 67, column: 20, scope: !268)
!276 = !DILocation(line: 66, column: 33, scope: !264)
!277 = !DILocation(line: 66, column: 9, scope: !264)
!278 = distinct !{!278, !266, !279}
!279 = !DILocation(line: 68, column: 9, scope: !260)
!280 = !DILocation(line: 69, column: 34, scope: !239)
!281 = !DILocation(line: 69, column: 39, scope: !239)
!282 = !DILocation(line: 69, column: 19, scope: !239)
!283 = !DILocation(line: 69, column: 17, scope: !239)
!284 = !DILocation(line: 70, column: 5, scope: !239)
!285 = !DILocation(line: 71, column: 16, scope: !210)
!286 = !DILocation(line: 71, column: 9, scope: !210)
!287 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 74, type: !288, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!288 = !DISubroutineType(types: !289)
!289 = !{!178, !290}
!290 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !214, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !291, identifier: "_ZTS9INSTR_VAL")
!291 = !{!292, !293, !294, !295}
!292 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !290, file: !214, line: 38, baseType: !9, size: 32)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !290, file: !214, line: 39, baseType: !9, size: 32, offset: 32)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !290, file: !214, line: 40, baseType: !9, size: 32, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !290, file: !214, line: 41, baseType: !296, size: 96, offset: 96)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !214, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !297, identifier: "_ZTS15GEMM_STRUCT_VAL")
!297 = !{!298, !299, !300}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !296, file: !214, line: 18, baseType: !9, size: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !296, file: !214, line: 19, baseType: !9, size: 32, offset: 32)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !296, file: !214, line: 20, baseType: !9, size: 32, offset: 64)
!301 = !DILocalVariable(name: "instr", arg: 1, scope: !287, file: !3, line: 74, type: !290)
!302 = !DILocation(line: 74, column: 43, scope: !287)
!303 = !DILocalVariable(name: "arr_val", scope: !287, file: !3, line: 76, type: !178)
!304 = !DILocation(line: 76, column: 20, scope: !287)
!305 = !DILocalVariable(name: "inp", scope: !287, file: !3, line: 77, type: !135)
!306 = !DILocation(line: 77, column: 18, scope: !287)
!307 = !DILocalVariable(name: "wgt", scope: !287, file: !3, line: 77, type: !135)
!308 = !DILocation(line: 77, column: 26, scope: !287)
!309 = !DILocation(line: 78, column: 14, scope: !310)
!310 = distinct !DILexicalBlock(scope: !287, file: !3, line: 78, column: 8)
!311 = !DILocation(line: 78, column: 20, scope: !310)
!312 = !DILocation(line: 78, column: 8, scope: !287)
!313 = !DILocalVariable(name: "i", scope: !314, file: !3, line: 79, type: !15)
!314 = distinct !DILexicalBlock(scope: !315, file: !3, line: 79, column: 9)
!315 = distinct !DILexicalBlock(scope: !310, file: !3, line: 78, column: 25)
!316 = !DILocation(line: 79, column: 18, scope: !314)
!317 = !DILocation(line: 79, column: 14, scope: !314)
!318 = !DILocation(line: 79, column: 25, scope: !319)
!319 = distinct !DILexicalBlock(scope: !314, file: !3, line: 79, column: 9)
!320 = !DILocation(line: 79, column: 27, scope: !319)
!321 = !DILocation(line: 79, column: 9, scope: !314)
!322 = !DILocation(line: 80, column: 28, scope: !323)
!323 = distinct !DILexicalBlock(scope: !319, file: !3, line: 79, column: 37)
!324 = !DILocation(line: 80, column: 37, scope: !323)
!325 = !DILocation(line: 80, column: 47, scope: !323)
!326 = !DILocation(line: 80, column: 45, scope: !323)
!327 = !DILocation(line: 80, column: 17, scope: !323)
!328 = !DILocation(line: 80, column: 13, scope: !323)
!329 = !DILocation(line: 80, column: 20, scope: !323)
!330 = !DILocation(line: 79, column: 33, scope: !319)
!331 = !DILocation(line: 79, column: 9, scope: !319)
!332 = distinct !{!332, !321, !333}
!333 = !DILocation(line: 81, column: 9, scope: !314)
!334 = !DILocalVariable(name: "i", scope: !335, file: !3, line: 82, type: !15)
!335 = distinct !DILexicalBlock(scope: !315, file: !3, line: 82, column: 9)
!336 = !DILocation(line: 82, column: 18, scope: !335)
!337 = !DILocation(line: 82, column: 14, scope: !335)
!338 = !DILocation(line: 82, column: 25, scope: !339)
!339 = distinct !DILexicalBlock(scope: !335, file: !3, line: 82, column: 9)
!340 = !DILocation(line: 82, column: 27, scope: !339)
!341 = !DILocation(line: 82, column: 9, scope: !335)
!342 = !DILocation(line: 83, column: 28, scope: !343)
!343 = distinct !DILexicalBlock(scope: !339, file: !3, line: 82, column: 37)
!344 = !DILocation(line: 83, column: 37, scope: !343)
!345 = !DILocation(line: 83, column: 17, scope: !343)
!346 = !DILocation(line: 83, column: 13, scope: !343)
!347 = !DILocation(line: 83, column: 20, scope: !343)
!348 = !DILocation(line: 82, column: 33, scope: !339)
!349 = !DILocation(line: 82, column: 9, scope: !339)
!350 = distinct !{!350, !341, !351}
!351 = !DILocation(line: 84, column: 9, scope: !335)
!352 = !DILocation(line: 85, column: 34, scope: !315)
!353 = !DILocation(line: 85, column: 39, scope: !315)
!354 = !DILocation(line: 85, column: 19, scope: !315)
!355 = !DILocation(line: 85, column: 17, scope: !315)
!356 = !DILocation(line: 86, column: 5, scope: !315)
!357 = !DILocation(line: 87, column: 12, scope: !287)
!358 = !DILocation(line: 87, column: 5, scope: !287)
!359 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 90, type: !211, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!360 = !DILocalVariable(name: "myinsn", arg: 1, scope: !359, file: !3, line: 90, type: !213)
!361 = !DILocation(line: 90, column: 32, scope: !359)
!362 = !DILocalVariable(name: "row", scope: !359, file: !3, line: 91, type: !9)
