; ModuleID = 'gemm.bc'
source_filename = "gemm.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !6
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !12
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !17
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !19
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !21
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !23
@acc_mem_gemm = dso_local global i32* null, align 8, !dbg !25

!209 = !DILocalVariable(name: "mat1", arg: 1, scope: !206, file: !3, line: 62, type: !131)
!210 = !DILocation(line: 62, column: 35, scope: !206)
!211 = !DILocalVariable(name: "mat2", arg: 2, scope: !206, file: !3, line: 62, type: !131)
!212 = !DILocation(line: 62, column: 61, scope: !206)
!213 = !DILocalVariable(name: "res", arg: 3, scope: !206, file: !3, line: 62, type: !131)
!214 = !DILocation(line: 62, column: 87, scope: !206)
!215 = !DILocalVariable(name: "i", scope: !216, file: !3, line: 63, type: !38)
!216 = distinct !DILexicalBlock(scope: !206, file: !3, line: 63, column: 5)
!217 = !DILocation(line: 63, column: 14, scope: !216)
!218 = !DILocation(line: 63, column: 10, scope: !216)
!219 = !DILocation(line: 63, column: 21, scope: !220)
!220 = distinct !DILexicalBlock(scope: !216, file: !3, line: 63, column: 5)
!221 = !DILocation(line: 63, column: 23, scope: !220)
!222 = !DILocation(line: 63, column: 5, scope: !216)
!223 = !DILocalVariable(name: "j", scope: !224, file: !3, line: 64, type: !38)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 64, column: 9)
!225 = distinct !DILexicalBlock(scope: !220, file: !3, line: 63, column: 35)
!226 = !DILocation(line: 64, column: 18, scope: !224)
!227 = !DILocation(line: 64, column: 14, scope: !224)
!228 = !DILocation(line: 64, column: 25, scope: !229)
!229 = distinct !DILexicalBlock(scope: !224, file: !3, line: 64, column: 9)
!230 = !DILocation(line: 64, column: 27, scope: !229)
!231 = !DILocation(line: 64, column: 9, scope: !224)
!232 = !DILocalVariable(name: "k", scope: !233, file: !3, line: 65, type: !38)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 65, column: 13)
!234 = distinct !DILexicalBlock(scope: !229, file: !3, line: 64, column: 39)
!235 = !DILocation(line: 65, column: 22, scope: !233)
!236 = !DILocation(line: 65, column: 18, scope: !233)
!237 = !DILocation(line: 65, column: 29, scope: !238)
!238 = distinct !DILexicalBlock(scope: !233, file: !3, line: 65, column: 13)
!239 = !DILocation(line: 65, column: 31, scope: !238)
!240 = !DILocation(line: 65, column: 13, scope: !233)
!241 = !DILocation(line: 66, column: 42, scope: !242)
!242 = distinct !DILexicalBlock(scope: !238, file: !3, line: 65, column: 43)
!243 = !DILocation(line: 66, column: 34, scope: !242)
!244 = !DILocation(line: 66, column: 45, scope: !242)
!245 = !DILocation(line: 66, column: 58, scope: !242)
!246 = !DILocation(line: 66, column: 50, scope: !242)
!247 = !DILocation(line: 66, column: 61, scope: !242)
!248 = !DILocation(line: 66, column: 48, scope: !242)
!249 = !DILocation(line: 66, column: 25, scope: !242)
!250 = !DILocation(line: 66, column: 17, scope: !242)
!251 = !DILocation(line: 66, column: 28, scope: !242)
!252 = !DILocation(line: 66, column: 31, scope: !242)
!253 = !DILocation(line: 65, column: 39, scope: !238)
!254 = !DILocation(line: 65, column: 13, scope: !238)
!255 = distinct !{!255, !240, !256}
!256 = !DILocation(line: 67, column: 13, scope: !233)
!257 = !DILocation(line: 64, column: 35, scope: !229)
!258 = !DILocation(line: 64, column: 9, scope: !229)
!259 = distinct !{!259, !231, !260}
!260 = !DILocation(line: 68, column: 9, scope: !224)
!261 = !DILocation(line: 63, column: 31, scope: !220)
!262 = !DILocation(line: 63, column: 5, scope: !220)
!263 = distinct !{!263, !222, !264}
!264 = !DILocation(line: 69, column: 5, scope: !216)
!265 = !DILocalVariable(name: "i", scope: !266, file: !3, line: 70, type: !38)
!266 = distinct !DILexicalBlock(scope: !206, file: !3, line: 70, column: 5)
!267 = !DILocation(line: 70, column: 13, scope: !266)
!268 = !DILocation(line: 70, column: 9, scope: !266)
!269 = !DILocation(line: 70, column: 18, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !3, line: 70, column: 5)
!271 = !DILocation(line: 70, column: 19, scope: !270)
!272 = !DILocation(line: 70, column: 5, scope: !266)
!273 = !DILocalVariable(name: "j", scope: !274, file: !3, line: 71, type: !38)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 71, column: 9)
!275 = distinct !DILexicalBlock(scope: !270, file: !3, line: 70, column: 28)
!276 = !DILocation(line: 71, column: 17, scope: !274)
!277 = !DILocation(line: 71, column: 13, scope: !274)
!278 = !DILocation(line: 71, column: 21, scope: !279)
!279 = distinct !DILexicalBlock(scope: !274, file: !3, line: 71, column: 9)
!280 = !DILocation(line: 71, column: 22, scope: !279)
!281 = !DILocation(line: 0, scope: !270)
!282 = !DILocation(line: 71, column: 9, scope: !274)
!283 = !DILocation(line: 72, column: 37, scope: !284)
!284 = distinct !DILexicalBlock(scope: !279, file: !3, line: 71, column: 31)
!285 = !DILocation(line: 72, column: 48, scope: !284)
!286 = !DILocation(line: 72, column: 26, scope: !284)
!287 = !DILocation(line: 72, column: 27, scope: !284)
!288 = !DILocation(line: 72, column: 32, scope: !284)
!289 = !DILocation(line: 72, column: 31, scope: !284)
!290 = !DILocation(line: 72, column: 13, scope: !284)
!291 = !DILocation(line: 72, column: 35, scope: !284)
!292 = !DILocation(line: 71, column: 28, scope: !279)
!293 = !DILocation(line: 71, column: 9, scope: !279)
!294 = distinct !{!294, !282, !295}
!295 = !DILocation(line: 73, column: 9, scope: !274)
!296 = !DILocation(line: 70, column: 25, scope: !270)
!297 = !DILocation(line: 70, column: 5, scope: !270)
!298 = distinct !{!298, !272, !299}
!299 = !DILocation(line: 74, column: 5, scope: !266)
!300 = !DILocation(line: 75, column: 5, scope: !206)
!301 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 78, type: !302, scopeLine: 79, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!302 = !DISubroutineType(types: !303)
!303 = !{!27, !304}
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !3, line: 29, size: 320, flags: DIFlagTypePassByValue, elements: !305, identifier: "_ZTS5INSTR")
!305 = !{!306, !307, !308, !309}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !304, file: !3, line: 30, baseType: !9, size: 32)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !304, file: !3, line: 31, baseType: !9, size: 32, offset: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !304, file: !3, line: 32, baseType: !9, size: 32, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !304, file: !3, line: 33, baseType: !310, size: 192, offset: 128)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !3, line: 17, size: 192, flags: DIFlagTypePassByValue, elements: !311, identifier: "_ZTS15GEMM_STRUCT_REF")
!311 = !{!312, !313, !314}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !310, file: !3, line: 18, baseType: !27, size: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !310, file: !3, line: 19, baseType: !27, size: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !310, file: !3, line: 20, baseType: !27, size: 64, offset: 128)
!315 = !DILocalVariable(name: "instr", arg: 1, scope: !301, file: !3, line: 78, type: !304)
!316 = !DILocation(line: 78, column: 35, scope: !301)
!317 = !DILocalVariable(name: "inp", scope: !301, file: !3, line: 80, type: !132)
!318 = !DILocation(line: 80, column: 18, scope: !301)
!319 = !DILocalVariable(name: "wgt", scope: !301, file: !3, line: 80, type: !132)
!320 = !DILocation(line: 80, column: 26, scope: !301)
!321 = !DILocalVariable(name: "i", scope: !322, file: !3, line: 81, type: !38)
!322 = distinct !DILexicalBlock(scope: !301, file: !3, line: 81, column: 5)
!323 = !DILocation(line: 81, column: 14, scope: !322)
!324 = !DILocation(line: 81, column: 10, scope: !322)
!325 = !DILocation(line: 81, column: 18, scope: !326)
!326 = distinct !DILexicalBlock(scope: !322, file: !3, line: 81, column: 5)
!327 = !DILocation(line: 81, column: 19, scope: !326)
!328 = !DILocation(line: 81, column: 5, scope: !322)
!329 = !DILocation(line: 82, column: 26, scope: !330)
!330 = distinct !DILexicalBlock(scope: !326, file: !3, line: 81, column: 26)
!331 = !DILocation(line: 82, column: 35, scope: !330)
!332 = !DILocation(line: 82, column: 43, scope: !330)
!333 = !DILocation(line: 82, column: 42, scope: !330)
!334 = !DILocation(line: 82, column: 18, scope: !330)
!335 = !DILocation(line: 82, column: 13, scope: !330)
!336 = !DILocation(line: 82, column: 9, scope: !330)
!337 = !DILocation(line: 82, column: 16, scope: !330)
!338 = !DILocation(line: 81, column: 23, scope: !326)
!339 = !DILocation(line: 81, column: 5, scope: !326)
!340 = distinct !{!340, !328, !341}
!341 = !DILocation(line: 83, column: 5, scope: !322)
!342 = !DILocalVariable(name: "i", scope: !343, file: !3, line: 84, type: !38)
!343 = distinct !DILexicalBlock(scope: !301, file: !3, line: 84, column: 5)
!344 = !DILocation(line: 84, column: 14, scope: !343)
!345 = !DILocation(line: 84, column: 10, scope: !343)
!346 = !DILocation(line: 84, column: 18, scope: !347)
!347 = distinct !DILexicalBlock(scope: !343, file: !3, line: 84, column: 5)
!348 = !DILocation(line: 84, column: 19, scope: !347)
!349 = !DILocation(line: 84, column: 5, scope: !343)
!350 = !DILocation(line: 85, column: 26, scope: !351)
!351 = distinct !DILexicalBlock(scope: !347, file: !3, line: 84, column: 26)
!352 = !DILocation(line: 85, column: 35, scope: !351)
!353 = !DILocation(line: 85, column: 43, scope: !351)
!354 = !DILocation(line: 85, column: 42, scope: !351)
!355 = !DILocation(line: 85, column: 18, scope: !351)
!356 = !DILocation(line: 85, column: 13, scope: !351)
!357 = !DILocation(line: 85, column: 9, scope: !351)
!358 = !DILocation(line: 85, column: 16, scope: !351)
!359 = !DILocation(line: 84, column: 23, scope: !347)
!360 = !DILocation(line: 84, column: 5, scope: !347)
!361 = distinct !{!361, !349, !362}
!362 = !DILocation(line: 86, column: 5, scope: !343)
!363 = !DILocalVariable(name: "arr", scope: !301, file: !3, line: 87, type: !27)
!364 = !DILocation(line: 87, column: 20, scope: !301)
!365 = !DILocation(line: 87, column: 41, scope: !301)
!366 = !DILocation(line: 87, column: 45, scope: !301)
!367 = !DILocation(line: 87, column: 26, scope: !301)
!368 = !DILocation(line: 88, column: 12, scope: !301)
!369 = !DILocation(line: 88, column: 5, scope: !301)
!370 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 91, type: !371, scopeLine: 92, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!371 = !DISubroutineType(types: !372)
!372 = !{!27, !373}
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !3, line: 36, size: 192, flags: DIFlagTypePassByValue, elements: !374, identifier: "_ZTS9INSTR_VAL")
!374 = !{!375, !376, !377, !378}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !373, file: !3, line: 37, baseType: !9, size: 32)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !373, file: !3, line: 38, baseType: !9, size: 32, offset: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !373, file: !3, line: 39, baseType: !9, size: 32, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !373, file: !3, line: 40, baseType: !379, size: 96, offset: 96)
!379 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !3, line: 23, size: 96, flags: DIFlagTypePassByValue, elements: !380, identifier: "_ZTS15GEMM_STRUCT_VAL")
!380 = !{!381, !382, !383}
!381 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !379, file: !3, line: 24, baseType: !9, size: 32)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !379, file: !3, line: 25, baseType: !9, size: 32, offset: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !379, file: !3, line: 26, baseType: !9, size: 32, offset: 64)
!384 = !DILocalVariable(name: "instr", arg: 1, scope: !370, file: !3, line: 91, type: !373)
!385 = !DILocation(line: 91, column: 43, scope: !370)
!386 = !DILocalVariable(name: "inp", scope: !370, file: !3, line: 93, type: !132)
!387 = !DILocation(line: 93, column: 18, scope: !370)
!388 = !DILocalVariable(name: "wgt", scope: !370, file: !3, line: 93, type: !132)
!389 = !DILocation(line: 93, column: 26, scope: !370)
!390 = !DILocalVariable(name: "i", scope: !391, file: !3, line: 94, type: !38)
!391 = distinct !DILexicalBlock(scope: !370, file: !3, line: 94, column: 5)
!392 = !DILocation(line: 94, column: 14, scope: !391)
!393 = !DILocation(line: 94, column: 10, scope: !391)
!394 = !DILocation(line: 94, column: 18, scope: !395)
!395 = distinct !DILexicalBlock(scope: !391, file: !3, line: 94, column: 5)
!396 = !DILocation(line: 94, column: 19, scope: !395)
!397 = !DILocation(line: 94, column: 5, scope: !391)
!398 = !DILocation(line: 95, column: 24, scope: !399)
!399 = distinct !DILexicalBlock(scope: !395, file: !3, line: 94, column: 26)
!400 = !DILocation(line: 95, column: 33, scope: !399)
!401 = !DILocation(line: 95, column: 41, scope: !399)
!402 = !DILocation(line: 95, column: 40, scope: !399)
!403 = !DILocation(line: 95, column: 13, scope: !399)
!404 = !DILocation(line: 95, column: 9, scope: !399)
!405 = !DILocation(line: 95, column: 16, scope: !399)
!406 = !DILocation(line: 94, column: 23, scope: !395)
!407 = !DILocation(line: 94, column: 5, scope: !395)
!408 = distinct !{!408, !397, !409}
!409 = !DILocation(line: 96, column: 5, scope: !391)
!410 = !DILocalVariable(name: "i", scope: !411, file: !3, line: 97, type: !38)
!411 = distinct !DILexicalBlock(scope: !370, file: !3, line: 97, column: 5)
!412 = !DILocation(line: 97, column: 14, scope: !411)
!413 = !DILocation(line: 97, column: 10, scope: !411)
!414 = !DILocation(line: 97, column: 18, scope: !415)
!415 = distinct !DILexicalBlock(scope: !411, file: !3, line: 97, column: 5)
!416 = !DILocation(line: 97, column: 19, scope: !415)
!417 = !DILocation(line: 97, column: 5, scope: !411)
!418 = !DILocation(line: 98, column: 24, scope: !419)
!419 = distinct !DILexicalBlock(scope: !415, file: !3, line: 97, column: 26)
!420 = !DILocation(line: 98, column: 33, scope: !419)
!421 = !DILocation(line: 98, column: 13, scope: !419)
!422 = !DILocation(line: 98, column: 9, scope: !419)
!423 = !DILocation(line: 98, column: 16, scope: !419)
!424 = !DILocation(line: 97, column: 23, scope: !415)
!425 = !DILocation(line: 97, column: 5, scope: !415)
!426 = distinct !{!426, !417, !427}
!427 = !DILocation(line: 99, column: 5, scope: !411)
!428 = !DILocalVariable(name: "arr", scope: !370, file: !3, line: 100, type: !27)
!429 = !DILocation(line: 100, column: 20, scope: !370)
!430 = !DILocation(line: 100, column: 41, scope: !370)
!431 = !DILocation(line: 100, column: 45, scope: !370)
!432 = !DILocation(line: 100, column: 26, scope: !370)
!433 = !DILocation(line: 101, column: 12, scope: !370)
!434 = !DILocation(line: 101, column: 5, scope: !370)
!435 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 108, type: !436, scopeLine: 108, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!436 = !DISubroutineType(types: !437)
!437 = !{!38, !38, !438}
!438 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !69, size: 64)
!439 = !DILocalVariable(name: "argc", arg: 1, scope: !435, file: !3, line: 108, type: !38)
!440 = !DILocation(line: 108, column: 14, scope: !435)
!441 = !DILocalVariable(name: "argv", arg: 2, scope: !435, file: !3, line: 108, type: !438)
!442 = !DILocation(line: 108, column: 32, scope: !435)
!443 = !DILocalVariable(name: "inp_mem_row0", scope: !435, file: !3, line: 110, type: !132)
!444 = !DILocation(line: 110, column: 18, scope: !435)
!445 = !DILocalVariable(name: "inp_mem_row1", scope: !435, file: !3, line: 110, type: !132)
