; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !14
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !20
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !23
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !25
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !27
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !29
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !31
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!217 = !DILocalVariable(name: "mat2", arg: 2, scope: !212, file: !3, line: 42, type: !136)
!218 = !DILocation(line: 42, column: 61, scope: !212)
!219 = !DILocalVariable(name: "res", arg: 3, scope: !212, file: !3, line: 42, type: !136)
!220 = !DILocation(line: 42, column: 87, scope: !212)
!221 = !DILocalVariable(name: "i", scope: !222, file: !3, line: 43, type: !17)
!222 = distinct !DILexicalBlock(scope: !212, file: !3, line: 43, column: 5)
!223 = !DILocation(line: 43, column: 14, scope: !222)
!224 = !DILocation(line: 43, column: 10, scope: !222)
!225 = !DILocation(line: 43, column: 21, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !3, line: 43, column: 5)
!227 = !DILocation(line: 43, column: 23, scope: !226)
!228 = !DILocation(line: 43, column: 5, scope: !222)
!229 = !DILocalVariable(name: "j", scope: !230, file: !3, line: 44, type: !17)
!230 = distinct !DILexicalBlock(scope: !231, file: !3, line: 44, column: 9)
!231 = distinct !DILexicalBlock(scope: !226, file: !3, line: 43, column: 35)
!232 = !DILocation(line: 44, column: 18, scope: !230)
!233 = !DILocation(line: 44, column: 14, scope: !230)
!234 = !DILocation(line: 44, column: 25, scope: !235)
!235 = distinct !DILexicalBlock(scope: !230, file: !3, line: 44, column: 9)
!236 = !DILocation(line: 44, column: 27, scope: !235)
!237 = !DILocation(line: 44, column: 9, scope: !230)
!238 = !DILocalVariable(name: "k", scope: !239, file: !3, line: 45, type: !17)
!239 = distinct !DILexicalBlock(scope: !240, file: !3, line: 45, column: 13)
!240 = distinct !DILexicalBlock(scope: !235, file: !3, line: 44, column: 39)
!241 = !DILocation(line: 45, column: 22, scope: !239)
!242 = !DILocation(line: 45, column: 18, scope: !239)
!243 = !DILocation(line: 45, column: 29, scope: !244)
!244 = distinct !DILexicalBlock(scope: !239, file: !3, line: 45, column: 13)
!245 = !DILocation(line: 45, column: 31, scope: !244)
!246 = !DILocation(line: 45, column: 13, scope: !239)
!247 = !DILocation(line: 46, column: 42, scope: !248)
!248 = distinct !DILexicalBlock(scope: !244, file: !3, line: 45, column: 43)
!249 = !DILocation(line: 46, column: 34, scope: !248)
!250 = !DILocation(line: 46, column: 45, scope: !248)
!251 = !DILocation(line: 46, column: 58, scope: !248)
!252 = !DILocation(line: 46, column: 50, scope: !248)
!253 = !DILocation(line: 46, column: 61, scope: !248)
!254 = !DILocation(line: 46, column: 48, scope: !248)
!255 = !DILocation(line: 46, column: 25, scope: !248)
!256 = !DILocation(line: 46, column: 17, scope: !248)
!257 = !DILocation(line: 46, column: 28, scope: !248)
!258 = !DILocation(line: 46, column: 31, scope: !248)
!259 = !DILocation(line: 45, column: 39, scope: !244)
!260 = !DILocation(line: 45, column: 13, scope: !244)
!261 = distinct !{!261, !246, !262}
!262 = !DILocation(line: 47, column: 13, scope: !239)
!263 = !DILocation(line: 44, column: 35, scope: !235)
!264 = !DILocation(line: 44, column: 9, scope: !235)
!265 = distinct !{!265, !237, !266}
!266 = !DILocation(line: 48, column: 9, scope: !230)
!267 = !DILocation(line: 43, column: 31, scope: !226)
!268 = !DILocation(line: 43, column: 5, scope: !226)
!269 = distinct !{!269, !228, !270}
!270 = !DILocation(line: 49, column: 5, scope: !222)
!271 = !DILocalVariable(name: "i", scope: !272, file: !3, line: 50, type: !17)
!272 = distinct !DILexicalBlock(scope: !212, file: !3, line: 50, column: 5)
!273 = !DILocation(line: 50, column: 13, scope: !272)
!274 = !DILocation(line: 50, column: 9, scope: !272)
!275 = !DILocation(line: 50, column: 18, scope: !276)
!276 = distinct !DILexicalBlock(scope: !272, file: !3, line: 50, column: 5)
!277 = !DILocation(line: 50, column: 19, scope: !276)
!278 = !DILocation(line: 50, column: 5, scope: !272)
!279 = !DILocalVariable(name: "j", scope: !280, file: !3, line: 51, type: !17)
!280 = distinct !DILexicalBlock(scope: !281, file: !3, line: 51, column: 9)
!281 = distinct !DILexicalBlock(scope: !276, file: !3, line: 50, column: 28)
!282 = !DILocation(line: 51, column: 17, scope: !280)
!283 = !DILocation(line: 51, column: 13, scope: !280)
!284 = !DILocation(line: 51, column: 21, scope: !285)
!285 = distinct !DILexicalBlock(scope: !280, file: !3, line: 51, column: 9)
!286 = !DILocation(line: 51, column: 22, scope: !285)
!287 = !DILocation(line: 0, scope: !276)
!288 = !DILocation(line: 51, column: 9, scope: !280)
!289 = !DILocation(line: 52, column: 37, scope: !290)
!290 = distinct !DILexicalBlock(scope: !285, file: !3, line: 51, column: 31)
!291 = !DILocation(line: 52, column: 48, scope: !290)
!292 = !DILocation(line: 52, column: 26, scope: !290)
!293 = !DILocation(line: 52, column: 27, scope: !290)
!294 = !DILocation(line: 52, column: 32, scope: !290)
!295 = !DILocation(line: 52, column: 31, scope: !290)
!296 = !DILocation(line: 52, column: 13, scope: !290)
!297 = !DILocation(line: 52, column: 35, scope: !290)
!298 = !DILocation(line: 51, column: 28, scope: !285)
!299 = !DILocation(line: 51, column: 9, scope: !285)
!300 = distinct !{!300, !288, !301}
!301 = !DILocation(line: 53, column: 9, scope: !280)
!302 = !DILocation(line: 50, column: 25, scope: !276)
!303 = !DILocation(line: 50, column: 5, scope: !276)
!304 = distinct !{!304, !278, !305}
!305 = !DILocation(line: 54, column: 5, scope: !272)
!306 = !DILocation(line: 55, column: 5, scope: !212)
!307 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 58, type: !308, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!308 = !DISubroutineType(types: !309)
!309 = !{!180, !310}
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !311, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !312, identifier: "_ZTS5INSTR")
!311 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!312 = !{!313, !314, !315, !316}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !310, file: !311, line: 24, baseType: !11, size: 32)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !310, file: !311, line: 25, baseType: !11, size: 32, offset: 32)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !310, file: !311, line: 26, baseType: !11, size: 32, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !310, file: !311, line: 27, baseType: !317, size: 192, offset: 128)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !311, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !318, identifier: "_ZTS15GEMM_STRUCT_REF")
!318 = !{!319, !320, !321}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !317, file: !311, line: 6, baseType: !180, size: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !317, file: !311, line: 7, baseType: !180, size: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !317, file: !311, line: 8, baseType: !180, size: 64, offset: 128)
!322 = !DILocalVariable(name: "instr", arg: 1, scope: !307, file: !3, line: 58, type: !310)
!323 = !DILocation(line: 58, column: 35, scope: !307)
!324 = !DILocalVariable(name: "arr_ref", scope: !307, file: !3, line: 60, type: !180)
!325 = !DILocation(line: 60, column: 20, scope: !307)
!326 = !DILocalVariable(name: "inp", scope: !307, file: !3, line: 61, type: !137)
!327 = !DILocation(line: 61, column: 18, scope: !307)
!328 = !DILocalVariable(name: "wgt", scope: !307, file: !3, line: 61, type: !137)
!329 = !DILocation(line: 61, column: 26, scope: !307)
!330 = !DILocation(line: 62, column: 14, scope: !331)
!331 = distinct !DILexicalBlock(scope: !307, file: !3, line: 62, column: 8)
!332 = !DILocation(line: 62, column: 20, scope: !331)
!333 = !DILocation(line: 62, column: 8, scope: !307)
!334 = !DILocalVariable(name: "i", scope: !335, file: !3, line: 63, type: !17)
!335 = distinct !DILexicalBlock(scope: !336, file: !3, line: 63, column: 9)
!336 = distinct !DILexicalBlock(scope: !331, file: !3, line: 62, column: 25)
!337 = !DILocation(line: 63, column: 18, scope: !335)
!338 = !DILocation(line: 63, column: 14, scope: !335)
!339 = !DILocation(line: 63, column: 25, scope: !340)
!340 = distinct !DILexicalBlock(scope: !335, file: !3, line: 63, column: 9)
!341 = !DILocation(line: 63, column: 27, scope: !340)
!342 = !DILocation(line: 63, column: 9, scope: !335)
!343 = !DILocation(line: 64, column: 30, scope: !344)
!344 = distinct !DILexicalBlock(scope: !340, file: !3, line: 63, column: 37)
!345 = !DILocation(line: 64, column: 39, scope: !344)
!346 = !DILocation(line: 64, column: 49, scope: !344)
!347 = !DILocation(line: 64, column: 47, scope: !344)
!348 = !DILocation(line: 64, column: 22, scope: !344)
!349 = !DILocation(line: 64, column: 17, scope: !344)
!350 = !DILocation(line: 64, column: 13, scope: !344)
!351 = !DILocation(line: 64, column: 20, scope: !344)
!352 = !DILocation(line: 63, column: 33, scope: !340)
!353 = !DILocation(line: 63, column: 9, scope: !340)
!354 = distinct !{!354, !342, !355}
!355 = !DILocation(line: 65, column: 9, scope: !335)
!356 = !DILocalVariable(name: "i", scope: !357, file: !3, line: 66, type: !17)
!357 = distinct !DILexicalBlock(scope: !336, file: !3, line: 66, column: 9)
!358 = !DILocation(line: 66, column: 18, scope: !357)
!359 = !DILocation(line: 66, column: 14, scope: !357)
!360 = !DILocation(line: 66, column: 25, scope: !361)
!361 = distinct !DILexicalBlock(scope: !357, file: !3, line: 66, column: 9)
!362 = !DILocation(line: 66, column: 27, scope: !361)
!363 = !DILocation(line: 66, column: 9, scope: !357)
!364 = !DILocation(line: 67, column: 30, scope: !365)
!365 = distinct !DILexicalBlock(scope: !361, file: !3, line: 66, column: 37)
!366 = !DILocation(line: 67, column: 39, scope: !365)
!367 = !DILocation(line: 67, column: 49, scope: !365)
!368 = !DILocation(line: 67, column: 47, scope: !365)
!369 = !DILocation(line: 67, column: 22, scope: !365)
!370 = !DILocation(line: 67, column: 17, scope: !365)
!371 = !DILocation(line: 67, column: 13, scope: !365)
!372 = !DILocation(line: 67, column: 20, scope: !365)
!373 = !DILocation(line: 66, column: 33, scope: !361)
!374 = !DILocation(line: 66, column: 9, scope: !361)
!375 = distinct !{!375, !363, !376}
!376 = !DILocation(line: 68, column: 9, scope: !357)
!377 = !DILocation(line: 69, column: 34, scope: !336)
!378 = !DILocation(line: 69, column: 39, scope: !336)
!379 = !DILocation(line: 69, column: 19, scope: !336)
!380 = !DILocation(line: 69, column: 17, scope: !336)
!381 = !DILocation(line: 70, column: 5, scope: !336)
!382 = !DILocation(line: 71, column: 16, scope: !307)
!383 = !DILocation(line: 71, column: 9, scope: !307)
!384 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 74, type: !385, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!385 = !DISubroutineType(types: !386)
!386 = !{!180, !387}
!387 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !311, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !388, identifier: "_ZTS9INSTR_VAL")
!388 = !{!389, !390, !391, !392}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !387, file: !311, line: 38, baseType: !11, size: 32)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !387, file: !311, line: 39, baseType: !11, size: 32, offset: 32)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !387, file: !311, line: 40, baseType: !11, size: 32, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !387, file: !311, line: 41, baseType: !393, size: 96, offset: 96)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !311, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !394, identifier: "_ZTS15GEMM_STRUCT_VAL")
!394 = !{!395, !396, !397}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !393, file: !311, line: 18, baseType: !11, size: 32)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !393, file: !311, line: 19, baseType: !11, size: 32, offset: 32)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !393, file: !311, line: 20, baseType: !11, size: 32, offset: 64)
!398 = !DILocalVariable(name: "instr", arg: 1, scope: !384, file: !3, line: 74, type: !387)
!399 = !DILocation(line: 74, column: 43, scope: !384)
!400 = !DILocalVariable(name: "arr_val", scope: !384, file: !3, line: 76, type: !180)
!401 = !DILocation(line: 76, column: 20, scope: !384)
!402 = !DILocalVariable(name: "inp", scope: !384, file: !3, line: 77, type: !137)
!403 = !DILocation(line: 77, column: 18, scope: !384)
!404 = !DILocalVariable(name: "wgt", scope: !384, file: !3, line: 77, type: !137)
!405 = !DILocation(line: 77, column: 26, scope: !384)
!406 = !DILocation(line: 78, column: 14, scope: !407)
!407 = distinct !DILexicalBlock(scope: !384, file: !3, line: 78, column: 8)
!408 = !DILocation(line: 78, column: 20, scope: !407)
!409 = !DILocation(line: 78, column: 8, scope: !384)
!410 = !DILocalVariable(name: "i", scope: !411, file: !3, line: 79, type: !17)
!411 = distinct !DILexicalBlock(scope: !412, file: !3, line: 79, column: 9)
!412 = distinct !DILexicalBlock(scope: !407, file: !3, line: 78, column: 25)
!413 = !DILocation(line: 79, column: 18, scope: !411)
!414 = !DILocation(line: 79, column: 14, scope: !411)
!415 = !DILocation(line: 79, column: 25, scope: !416)
!416 = distinct !DILexicalBlock(scope: !411, file: !3, line: 79, column: 9)
!417 = !DILocation(line: 79, column: 27, scope: !416)
!418 = !DILocation(line: 79, column: 9, scope: !411)
!419 = !DILocation(line: 80, column: 28, scope: !420)
!420 = distinct !DILexicalBlock(scope: !416, file: !3, line: 79, column: 37)
!421 = !DILocation(line: 80, column: 37, scope: !420)
!422 = !DILocation(line: 80, column: 47, scope: !420)
!423 = !DILocation(line: 80, column: 45, scope: !420)
!424 = !DILocation(line: 80, column: 17, scope: !420)
!425 = !DILocation(line: 80, column: 13, scope: !420)
!426 = !DILocation(line: 80, column: 20, scope: !420)
!427 = !DILocation(line: 79, column: 33, scope: !416)
!428 = !DILocation(line: 79, column: 9, scope: !416)
!429 = distinct !{!429, !418, !430}
!430 = !DILocation(line: 81, column: 9, scope: !411)
!431 = !DILocalVariable(name: "i", scope: !432, file: !3, line: 82, type: !17)
!432 = distinct !DILexicalBlock(scope: !412, file: !3, line: 82, column: 9)
!433 = !DILocation(line: 82, column: 18, scope: !432)
!434 = !DILocation(line: 82, column: 14, scope: !432)
!435 = !DILocation(line: 82, column: 25, scope: !436)
!436 = distinct !DILexicalBlock(scope: !432, file: !3, line: 82, column: 9)
!437 = !DILocation(line: 82, column: 27, scope: !436)
!438 = !DILocation(line: 82, column: 9, scope: !432)
!439 = !DILocation(line: 83, column: 28, scope: !440)
!440 = distinct !DILexicalBlock(scope: !436, file: !3, line: 82, column: 37)
!441 = !DILocation(line: 83, column: 37, scope: !440)
!442 = !DILocation(line: 83, column: 17, scope: !440)
!443 = !DILocation(line: 83, column: 13, scope: !440)
!444 = !DILocation(line: 83, column: 20, scope: !440)
!445 = !DILocation(line: 82, column: 33, scope: !436)
!446 = !DILocation(line: 82, column: 9, scope: !436)
!447 = distinct !{!447, !438, !448}
!448 = !DILocation(line: 84, column: 9, scope: !432)
!449 = !DILocation(line: 85, column: 34, scope: !412)
!450 = !DILocation(line: 85, column: 39, scope: !412)
!451 = !DILocation(line: 85, column: 19, scope: !412)
!452 = !DILocation(line: 85, column: 17, scope: !412)
!453 = !DILocation(line: 86, column: 5, scope: !412)
!454 = !DILocation(line: 87, column: 12, scope: !384)
!455 = !DILocation(line: 87, column: 5, scope: !384)
!456 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 90, type: !308, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!457 = !DILocalVariable(name: "myinsn", arg: 1, scope: !456, file: !3, line: 90, type: !310)
!458 = !DILocation(line: 90, column: 32, scope: !456)
!459 = !DILocalVariable(name: "row", scope: !456, file: !3, line: 91, type: !11)
