; ModuleID = 'gemm.bc'
source_filename = "gemm.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !14
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !19
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !21
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !23
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !25
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!211 = !DILocalVariable(name: "mat2", arg: 2, scope: !206, file: !3, line: 63, type: !130)
!212 = !DILocation(line: 63, column: 61, scope: !206)
!213 = !DILocalVariable(name: "res", arg: 3, scope: !206, file: !3, line: 63, type: !130)
!214 = !DILocation(line: 63, column: 87, scope: !206)
!215 = !DILocalVariable(name: "i", scope: !216, file: !3, line: 64, type: !37)
!216 = distinct !DILexicalBlock(scope: !206, file: !3, line: 64, column: 5)
!217 = !DILocation(line: 64, column: 14, scope: !216)
!218 = !DILocation(line: 64, column: 10, scope: !216)
!219 = !DILocation(line: 64, column: 21, scope: !220)
!220 = distinct !DILexicalBlock(scope: !216, file: !3, line: 64, column: 5)
!221 = !DILocation(line: 64, column: 23, scope: !220)
!222 = !DILocation(line: 64, column: 5, scope: !216)
!223 = !DILocalVariable(name: "j", scope: !224, file: !3, line: 65, type: !37)
!224 = distinct !DILexicalBlock(scope: !225, file: !3, line: 65, column: 9)
!225 = distinct !DILexicalBlock(scope: !220, file: !3, line: 64, column: 35)
!226 = !DILocation(line: 65, column: 18, scope: !224)
!227 = !DILocation(line: 65, column: 14, scope: !224)
!228 = !DILocation(line: 65, column: 25, scope: !229)
!229 = distinct !DILexicalBlock(scope: !224, file: !3, line: 65, column: 9)
!230 = !DILocation(line: 65, column: 27, scope: !229)
!231 = !DILocation(line: 65, column: 9, scope: !224)
!232 = !DILocalVariable(name: "k", scope: !233, file: !3, line: 66, type: !37)
!233 = distinct !DILexicalBlock(scope: !234, file: !3, line: 66, column: 13)
!234 = distinct !DILexicalBlock(scope: !229, file: !3, line: 65, column: 39)
!235 = !DILocation(line: 66, column: 22, scope: !233)
!236 = !DILocation(line: 66, column: 18, scope: !233)
!237 = !DILocation(line: 66, column: 29, scope: !238)
!238 = distinct !DILexicalBlock(scope: !233, file: !3, line: 66, column: 13)
!239 = !DILocation(line: 66, column: 31, scope: !238)
!240 = !DILocation(line: 66, column: 13, scope: !233)
!241 = !DILocation(line: 67, column: 42, scope: !242)
!242 = distinct !DILexicalBlock(scope: !238, file: !3, line: 66, column: 43)
!243 = !DILocation(line: 67, column: 34, scope: !242)
!244 = !DILocation(line: 67, column: 45, scope: !242)
!245 = !DILocation(line: 67, column: 58, scope: !242)
!246 = !DILocation(line: 67, column: 50, scope: !242)
!247 = !DILocation(line: 67, column: 61, scope: !242)
!248 = !DILocation(line: 67, column: 48, scope: !242)
!249 = !DILocation(line: 67, column: 25, scope: !242)
!250 = !DILocation(line: 67, column: 17, scope: !242)
!251 = !DILocation(line: 67, column: 28, scope: !242)
!252 = !DILocation(line: 67, column: 31, scope: !242)
!253 = !DILocation(line: 66, column: 39, scope: !238)
!254 = !DILocation(line: 66, column: 13, scope: !238)
!255 = distinct !{!255, !240, !256}
!256 = !DILocation(line: 68, column: 13, scope: !233)
!257 = !DILocation(line: 65, column: 35, scope: !229)
!258 = !DILocation(line: 65, column: 9, scope: !229)
!259 = distinct !{!259, !231, !260}
!260 = !DILocation(line: 69, column: 9, scope: !224)
!261 = !DILocation(line: 64, column: 31, scope: !220)
!262 = !DILocation(line: 64, column: 5, scope: !220)
!263 = distinct !{!263, !222, !264}
!264 = !DILocation(line: 70, column: 5, scope: !216)
!265 = !DILocalVariable(name: "i", scope: !266, file: !3, line: 71, type: !37)
!266 = distinct !DILexicalBlock(scope: !206, file: !3, line: 71, column: 5)
!267 = !DILocation(line: 71, column: 13, scope: !266)
!268 = !DILocation(line: 71, column: 9, scope: !266)
!269 = !DILocation(line: 71, column: 18, scope: !270)
!270 = distinct !DILexicalBlock(scope: !266, file: !3, line: 71, column: 5)
!271 = !DILocation(line: 71, column: 19, scope: !270)
!272 = !DILocation(line: 71, column: 5, scope: !266)
!273 = !DILocalVariable(name: "j", scope: !274, file: !3, line: 72, type: !37)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 72, column: 9)
!275 = distinct !DILexicalBlock(scope: !270, file: !3, line: 71, column: 28)
!276 = !DILocation(line: 72, column: 17, scope: !274)
!277 = !DILocation(line: 72, column: 13, scope: !274)
!278 = !DILocation(line: 72, column: 21, scope: !279)
!279 = distinct !DILexicalBlock(scope: !274, file: !3, line: 72, column: 9)
!280 = !DILocation(line: 72, column: 22, scope: !279)
!281 = !DILocation(line: 0, scope: !270)
!282 = !DILocation(line: 72, column: 9, scope: !274)
!283 = !DILocation(line: 73, column: 37, scope: !284)
!284 = distinct !DILexicalBlock(scope: !279, file: !3, line: 72, column: 31)
!285 = !DILocation(line: 73, column: 48, scope: !284)
!286 = !DILocation(line: 73, column: 26, scope: !284)
!287 = !DILocation(line: 73, column: 27, scope: !284)
!288 = !DILocation(line: 73, column: 32, scope: !284)
!289 = !DILocation(line: 73, column: 31, scope: !284)
!290 = !DILocation(line: 73, column: 13, scope: !284)
!291 = !DILocation(line: 73, column: 35, scope: !284)
!292 = !DILocation(line: 72, column: 28, scope: !279)
!293 = !DILocation(line: 72, column: 9, scope: !279)
!294 = distinct !{!294, !282, !295}
!295 = !DILocation(line: 74, column: 9, scope: !274)
!296 = !DILocation(line: 71, column: 25, scope: !270)
!297 = !DILocation(line: 71, column: 5, scope: !270)
!298 = distinct !{!298, !272, !299}
!299 = !DILocation(line: 75, column: 5, scope: !266)
!300 = !DILocation(line: 76, column: 5, scope: !206)
!301 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 79, type: !302, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!302 = !DISubroutineType(types: !303)
!303 = !{!174, !304}
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !305, line: 17, size: 320, flags: DIFlagTypePassByValue, elements: !306, identifier: "_ZTS5INSTR")
!305 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!306 = !{!307, !308, !309, !310}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !304, file: !305, line: 18, baseType: !11, size: 32)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !304, file: !305, line: 19, baseType: !11, size: 32, offset: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !304, file: !305, line: 20, baseType: !11, size: 32, offset: 64)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !304, file: !305, line: 21, baseType: !311, size: 192, offset: 128)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !305, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !312, identifier: "_ZTS15GEMM_STRUCT_REF")
!312 = !{!313, !314, !315}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !311, file: !305, line: 6, baseType: !174, size: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !311, file: !305, line: 7, baseType: !174, size: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !311, file: !305, line: 8, baseType: !174, size: 64, offset: 128)
!316 = !DILocalVariable(name: "instr", arg: 1, scope: !301, file: !3, line: 79, type: !304)
!317 = !DILocation(line: 79, column: 35, scope: !301)
!318 = !DILocalVariable(name: "inp", scope: !301, file: !3, line: 81, type: !131)
!319 = !DILocation(line: 81, column: 18, scope: !301)
!320 = !DILocalVariable(name: "wgt", scope: !301, file: !3, line: 81, type: !131)
!321 = !DILocation(line: 81, column: 26, scope: !301)
!322 = !DILocalVariable(name: "i", scope: !323, file: !3, line: 82, type: !37)
!323 = distinct !DILexicalBlock(scope: !301, file: !3, line: 82, column: 5)
!324 = !DILocation(line: 82, column: 14, scope: !323)
!325 = !DILocation(line: 82, column: 10, scope: !323)
!326 = !DILocation(line: 82, column: 18, scope: !327)
!327 = distinct !DILexicalBlock(scope: !323, file: !3, line: 82, column: 5)
!328 = !DILocation(line: 82, column: 19, scope: !327)
!329 = !DILocation(line: 82, column: 5, scope: !323)
!330 = !DILocation(line: 83, column: 26, scope: !331)
!331 = distinct !DILexicalBlock(scope: !327, file: !3, line: 82, column: 26)
!332 = !DILocation(line: 83, column: 35, scope: !331)
!333 = !DILocation(line: 83, column: 43, scope: !331)
!334 = !DILocation(line: 83, column: 42, scope: !331)
!335 = !DILocation(line: 83, column: 18, scope: !331)
!336 = !DILocation(line: 83, column: 13, scope: !331)
!337 = !DILocation(line: 83, column: 9, scope: !331)
!338 = !DILocation(line: 83, column: 16, scope: !331)
!339 = !DILocation(line: 82, column: 23, scope: !327)
!340 = !DILocation(line: 82, column: 5, scope: !327)
!341 = distinct !{!341, !329, !342}
!342 = !DILocation(line: 84, column: 5, scope: !323)
!343 = !DILocalVariable(name: "i", scope: !344, file: !3, line: 85, type: !37)
!344 = distinct !DILexicalBlock(scope: !301, file: !3, line: 85, column: 5)
!345 = !DILocation(line: 85, column: 14, scope: !344)
!346 = !DILocation(line: 85, column: 10, scope: !344)
!347 = !DILocation(line: 85, column: 18, scope: !348)
!348 = distinct !DILexicalBlock(scope: !344, file: !3, line: 85, column: 5)
!349 = !DILocation(line: 85, column: 19, scope: !348)
!350 = !DILocation(line: 85, column: 5, scope: !344)
!351 = !DILocation(line: 86, column: 26, scope: !352)
!352 = distinct !DILexicalBlock(scope: !348, file: !3, line: 85, column: 26)
!353 = !DILocation(line: 86, column: 35, scope: !352)
!354 = !DILocation(line: 86, column: 43, scope: !352)
!355 = !DILocation(line: 86, column: 42, scope: !352)
!356 = !DILocation(line: 86, column: 18, scope: !352)
!357 = !DILocation(line: 86, column: 13, scope: !352)
!358 = !DILocation(line: 86, column: 9, scope: !352)
!359 = !DILocation(line: 86, column: 16, scope: !352)
!360 = !DILocation(line: 85, column: 23, scope: !348)
!361 = !DILocation(line: 85, column: 5, scope: !348)
!362 = distinct !{!362, !350, !363}
!363 = !DILocation(line: 87, column: 5, scope: !344)
!364 = !DILocalVariable(name: "arr", scope: !301, file: !3, line: 88, type: !174)
!365 = !DILocation(line: 88, column: 20, scope: !301)
!366 = !DILocation(line: 88, column: 41, scope: !301)
!367 = !DILocation(line: 88, column: 45, scope: !301)
!368 = !DILocation(line: 88, column: 26, scope: !301)
!369 = !DILocation(line: 89, column: 12, scope: !301)
!370 = !DILocation(line: 89, column: 5, scope: !301)
!371 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 92, type: !372, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!372 = !DISubroutineType(types: !373)
!373 = !{!174, !374}
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !305, line: 24, size: 192, flags: DIFlagTypePassByValue, elements: !375, identifier: "_ZTS9INSTR_VAL")
!375 = !{!376, !377, !378, !379}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !374, file: !305, line: 25, baseType: !11, size: 32)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !374, file: !305, line: 26, baseType: !11, size: 32, offset: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !374, file: !305, line: 27, baseType: !11, size: 32, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !374, file: !305, line: 28, baseType: !380, size: 96, offset: 96)
!380 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !305, line: 11, size: 96, flags: DIFlagTypePassByValue, elements: !381, identifier: "_ZTS15GEMM_STRUCT_VAL")
!381 = !{!382, !383, !384}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !380, file: !305, line: 12, baseType: !11, size: 32)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !380, file: !305, line: 13, baseType: !11, size: 32, offset: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !380, file: !305, line: 14, baseType: !11, size: 32, offset: 64)
!385 = !DILocalVariable(name: "instr", arg: 1, scope: !371, file: !3, line: 92, type: !374)
!386 = !DILocation(line: 92, column: 43, scope: !371)
!387 = !DILocalVariable(name: "inp", scope: !371, file: !3, line: 94, type: !131)
!388 = !DILocation(line: 94, column: 18, scope: !371)
!389 = !DILocalVariable(name: "wgt", scope: !371, file: !3, line: 94, type: !131)
!390 = !DILocation(line: 94, column: 26, scope: !371)
!391 = !DILocalVariable(name: "i", scope: !392, file: !3, line: 95, type: !37)
!392 = distinct !DILexicalBlock(scope: !371, file: !3, line: 95, column: 5)
!393 = !DILocation(line: 95, column: 14, scope: !392)
!394 = !DILocation(line: 95, column: 10, scope: !392)
!395 = !DILocation(line: 95, column: 18, scope: !396)
!396 = distinct !DILexicalBlock(scope: !392, file: !3, line: 95, column: 5)
!397 = !DILocation(line: 95, column: 19, scope: !396)
!398 = !DILocation(line: 95, column: 5, scope: !392)
!399 = !DILocation(line: 96, column: 24, scope: !400)
!400 = distinct !DILexicalBlock(scope: !396, file: !3, line: 95, column: 26)
!401 = !DILocation(line: 96, column: 33, scope: !400)
!402 = !DILocation(line: 96, column: 41, scope: !400)
!403 = !DILocation(line: 96, column: 40, scope: !400)
!404 = !DILocation(line: 96, column: 13, scope: !400)
!405 = !DILocation(line: 96, column: 9, scope: !400)
!406 = !DILocation(line: 96, column: 16, scope: !400)
!407 = !DILocation(line: 95, column: 23, scope: !396)
!408 = !DILocation(line: 95, column: 5, scope: !396)
!409 = distinct !{!409, !398, !410}
!410 = !DILocation(line: 97, column: 5, scope: !392)
!411 = !DILocalVariable(name: "i", scope: !412, file: !3, line: 98, type: !37)
!412 = distinct !DILexicalBlock(scope: !371, file: !3, line: 98, column: 5)
!413 = !DILocation(line: 98, column: 14, scope: !412)
!414 = !DILocation(line: 98, column: 10, scope: !412)
!415 = !DILocation(line: 98, column: 18, scope: !416)
!416 = distinct !DILexicalBlock(scope: !412, file: !3, line: 98, column: 5)
!417 = !DILocation(line: 98, column: 19, scope: !416)
!418 = !DILocation(line: 98, column: 5, scope: !412)
!419 = !DILocation(line: 99, column: 24, scope: !420)
!420 = distinct !DILexicalBlock(scope: !416, file: !3, line: 98, column: 26)
!421 = !DILocation(line: 99, column: 33, scope: !420)
!422 = !DILocation(line: 99, column: 13, scope: !420)
!423 = !DILocation(line: 99, column: 9, scope: !420)
!424 = !DILocation(line: 99, column: 16, scope: !420)
!425 = !DILocation(line: 98, column: 23, scope: !416)
!426 = !DILocation(line: 98, column: 5, scope: !416)
!427 = distinct !{!427, !418, !428}
!428 = !DILocation(line: 100, column: 5, scope: !412)
!429 = !DILocalVariable(name: "arr", scope: !371, file: !3, line: 101, type: !174)
!430 = !DILocation(line: 101, column: 20, scope: !371)
!431 = !DILocation(line: 101, column: 41, scope: !371)
!432 = !DILocation(line: 101, column: 45, scope: !371)
!433 = !DILocation(line: 101, column: 26, scope: !371)
!434 = !DILocation(line: 102, column: 12, scope: !371)
!435 = !DILocation(line: 102, column: 5, scope: !371)
!436 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 109, type: !437, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!437 = !DISubroutineType(types: !438)
!438 = !{!37, !37, !439}
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!440 = !DILocalVariable(name: "argc", arg: 1, scope: !436, file: !3, line: 109, type: !37)
!441 = !DILocation(line: 109, column: 14, scope: !436)
!442 = !DILocalVariable(name: "argv", arg: 2, scope: !436, file: !3, line: 109, type: !439)
!443 = !DILocation(line: 109, column: 32, scope: !436)
!444 = !DILocalVariable(name: "inp_mem_row0", scope: !436, file: !3, line: 111, type: !131)
!445 = !DILocation(line: 111, column: 18, scope: !436)
!446 = !DILocalVariable(name: "inp_mem_row1", scope: !436, file: !3, line: 111, type: !131)
