; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@result_val = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !14
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !16
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !22
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !25
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !27
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !29
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !31
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !33
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!160 = distinct !DILexicalBlock(scope: !157, file: !3, line: 27, column: 9)
!161 = !DILocation(line: 27, column: 23, scope: !160)
!162 = !DILocation(line: 27, column: 9, scope: !157)
!163 = !DILocation(line: 28, column: 35, scope: !160)
!164 = !DILocation(line: 28, column: 43, scope: !160)
!165 = !DILocation(line: 28, column: 46, scope: !160)
!166 = !DILocation(line: 28, column: 13, scope: !160)
!167 = !DILocation(line: 28, column: 27, scope: !160)
!168 = !DILocation(line: 28, column: 30, scope: !160)
!169 = !DILocation(line: 28, column: 33, scope: !160)
!170 = !DILocation(line: 27, column: 31, scope: !160)
!171 = !DILocation(line: 27, column: 9, scope: !160)
!172 = distinct !{!172, !162, !173}
!173 = !DILocation(line: 28, column: 47, scope: !157)
!174 = !DILocation(line: 26, column: 27, scope: !153)
!175 = !DILocation(line: 26, column: 5, scope: !153)
!176 = distinct !{!176, !155, !177}
!177 = !DILocation(line: 28, column: 47, scope: !150)
!178 = !DILocation(line: 29, column: 1, scope: !135)
!179 = distinct !DISubprogram(name: "matrixMultiply", linkageName: "_Z14matrixMultiplyPjS_", scope: !3, file: !3, line: 31, type: !180, scopeLine: 32, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!180 = !DISubroutineType(types: !181)
!181 = !{!182, !182, !182}
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!183 = !DILocalVariable(name: "mat1", arg: 1, scope: !179, file: !3, line: 31, type: !182)
!184 = !DILocation(line: 31, column: 43, scope: !179)
!185 = !DILocalVariable(name: "mat2", arg: 2, scope: !179, file: !3, line: 31, type: !182)
!186 = !DILocation(line: 31, column: 64, scope: !179)
!187 = !DILocalVariable(name: "res", scope: !179, file: !3, line: 33, type: !11)
!188 = !DILocation(line: 33, column: 18, scope: !179)
!189 = !DILocalVariable(name: "i", scope: !190, file: !3, line: 34, type: !19)
!190 = distinct !DILexicalBlock(scope: !179, file: !3, line: 34, column: 5)
!191 = !DILocation(line: 34, column: 13, scope: !190)
!192 = !DILocation(line: 34, column: 9, scope: !190)
!193 = !DILocation(line: 34, column: 20, scope: !194)
!194 = distinct !DILexicalBlock(scope: !190, file: !3, line: 34, column: 5)
!195 = !DILocation(line: 34, column: 22, scope: !194)
!196 = !DILocation(line: 34, column: 5, scope: !190)
!197 = !DILocation(line: 36, column: 16, scope: !198)
!198 = distinct !DILexicalBlock(scope: !194, file: !3, line: 35, column: 5)
!199 = !DILocation(line: 36, column: 21, scope: !198)
!200 = !DILocation(line: 36, column: 26, scope: !198)
!201 = !DILocation(line: 36, column: 31, scope: !198)
!202 = !DILocation(line: 36, column: 24, scope: !198)
!203 = !DILocation(line: 36, column: 13, scope: !198)
!204 = !DILocation(line: 34, column: 28, scope: !194)
!205 = !DILocation(line: 34, column: 5, scope: !194)
!206 = distinct !{!206, !196, !207}
!207 = !DILocation(line: 37, column: 5, scope: !190)
!208 = !DILocation(line: 38, column: 25, scope: !179)
!209 = !DILocation(line: 38, column: 12, scope: !179)
!210 = !DILocation(line: 38, column: 5, scope: !179)
!211 = !DILocation(line: 38, column: 23, scope: !179)
!212 = !DILocation(line: 39, column: 14, scope: !179)
!213 = !DILocation(line: 40, column: 5, scope: !179)
!214 = distinct !DISubprogram(name: "matrixMultiplyVal", linkageName: "_Z17matrixMultiplyValPjS_", scope: !3, file: !3, line: 43, type: !180, scopeLine: 44, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!215 = !DILocalVariable(name: "mat1", arg: 1, scope: !214, file: !3, line: 43, type: !182)
!216 = !DILocation(line: 43, column: 46, scope: !214)
!217 = !DILocalVariable(name: "mat2", arg: 2, scope: !214, file: !3, line: 43, type: !182)
!218 = !DILocation(line: 43, column: 67, scope: !214)
!219 = !DILocalVariable(name: "res", scope: !214, file: !3, line: 45, type: !11)
!220 = !DILocation(line: 45, column: 18, scope: !214)
!221 = !DILocalVariable(name: "i", scope: !222, file: !3, line: 46, type: !19)
!222 = distinct !DILexicalBlock(scope: !214, file: !3, line: 46, column: 5)
!223 = !DILocation(line: 46, column: 13, scope: !222)
!224 = !DILocation(line: 46, column: 9, scope: !222)
!225 = !DILocation(line: 46, column: 20, scope: !226)
!226 = distinct !DILexicalBlock(scope: !222, file: !3, line: 46, column: 5)
!227 = !DILocation(line: 46, column: 22, scope: !226)
!228 = !DILocation(line: 46, column: 5, scope: !222)
!229 = !DILocation(line: 48, column: 16, scope: !230)
!230 = distinct !DILexicalBlock(scope: !226, file: !3, line: 47, column: 5)
!231 = !DILocation(line: 48, column: 21, scope: !230)
!232 = !DILocation(line: 48, column: 26, scope: !230)
!233 = !DILocation(line: 48, column: 31, scope: !230)
!234 = !DILocation(line: 48, column: 24, scope: !230)
!235 = !DILocation(line: 48, column: 13, scope: !230)
!236 = !DILocation(line: 46, column: 28, scope: !226)
!237 = !DILocation(line: 46, column: 5, scope: !226)
!238 = distinct !{!238, !228, !239}
!239 = !DILocation(line: 49, column: 5, scope: !222)
!240 = !DILocation(line: 50, column: 29, scope: !214)
!241 = !DILocation(line: 50, column: 16, scope: !214)
!242 = !DILocation(line: 50, column: 5, scope: !214)
!243 = !DILocation(line: 50, column: 27, scope: !214)
!244 = !DILocation(line: 51, column: 14, scope: !214)
!245 = !DILocation(line: 52, column: 5, scope: !214)
!246 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 70, type: !247, scopeLine: 71, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!247 = !DISubroutineType(types: !248)
!248 = !{!182, !249}
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !250, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !251, identifier: "_ZTS5INSTR")
!250 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!251 = !{!252, !253, !254, !255}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !249, file: !250, line: 24, baseType: !11, size: 32)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !249, file: !250, line: 25, baseType: !11, size: 32, offset: 32)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !249, file: !250, line: 26, baseType: !11, size: 32, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !249, file: !250, line: 27, baseType: !256, size: 192, offset: 128)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !250, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !257, identifier: "_ZTS15GEMM_STRUCT_REF")
!257 = !{!258, !259, !260}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !256, file: !250, line: 6, baseType: !182, size: 64)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !256, file: !250, line: 7, baseType: !182, size: 64, offset: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !256, file: !250, line: 8, baseType: !182, size: 64, offset: 128)
!261 = !DILocalVariable(name: "instr", arg: 1, scope: !246, file: !3, line: 70, type: !249)
!262 = !DILocation(line: 70, column: 35, scope: !246)
!263 = !DILocalVariable(name: "arr_ref", scope: !246, file: !3, line: 72, type: !182)
!264 = !DILocation(line: 72, column: 20, scope: !246)
!265 = !DILocalVariable(name: "inp", scope: !246, file: !3, line: 73, type: !139)
!266 = !DILocation(line: 73, column: 18, scope: !246)
!267 = !DILocalVariable(name: "wgt", scope: !246, file: !3, line: 73, type: !139)
!268 = !DILocation(line: 73, column: 26, scope: !246)
!269 = !DILocation(line: 74, column: 14, scope: !270)
!270 = distinct !DILexicalBlock(scope: !246, file: !3, line: 74, column: 8)
!271 = !DILocation(line: 74, column: 20, scope: !270)
!272 = !DILocation(line: 74, column: 8, scope: !246)
!273 = !DILocalVariable(name: "i", scope: !274, file: !3, line: 75, type: !19)
!274 = distinct !DILexicalBlock(scope: !275, file: !3, line: 75, column: 9)
!275 = distinct !DILexicalBlock(scope: !270, file: !3, line: 74, column: 25)
!276 = !DILocation(line: 75, column: 18, scope: !274)
!277 = !DILocation(line: 75, column: 14, scope: !274)
!278 = !DILocation(line: 75, column: 25, scope: !279)
!279 = distinct !DILexicalBlock(scope: !274, file: !3, line: 75, column: 9)
!280 = !DILocation(line: 75, column: 27, scope: !279)
!281 = !DILocation(line: 75, column: 9, scope: !274)
!282 = !DILocation(line: 76, column: 30, scope: !283)
!283 = distinct !DILexicalBlock(scope: !279, file: !3, line: 75, column: 37)
!284 = !DILocation(line: 76, column: 39, scope: !283)
!285 = !DILocation(line: 76, column: 49, scope: !283)
!286 = !DILocation(line: 76, column: 47, scope: !283)
!287 = !DILocation(line: 76, column: 22, scope: !283)
!288 = !DILocation(line: 76, column: 17, scope: !283)
!289 = !DILocation(line: 76, column: 13, scope: !283)
!290 = !DILocation(line: 76, column: 20, scope: !283)
!291 = !DILocation(line: 75, column: 33, scope: !279)
!292 = !DILocation(line: 75, column: 9, scope: !279)
!293 = distinct !{!293, !281, !294}
!294 = !DILocation(line: 77, column: 9, scope: !274)
!295 = !DILocalVariable(name: "i", scope: !296, file: !3, line: 78, type: !19)
!296 = distinct !DILexicalBlock(scope: !275, file: !3, line: 78, column: 9)
!297 = !DILocation(line: 78, column: 18, scope: !296)
!298 = !DILocation(line: 78, column: 14, scope: !296)
!299 = !DILocation(line: 78, column: 25, scope: !300)
!300 = distinct !DILexicalBlock(scope: !296, file: !3, line: 78, column: 9)
!301 = !DILocation(line: 78, column: 27, scope: !300)
!302 = !DILocation(line: 78, column: 9, scope: !296)
!303 = !DILocation(line: 79, column: 30, scope: !304)
!304 = distinct !DILexicalBlock(scope: !300, file: !3, line: 78, column: 37)
!305 = !DILocation(line: 79, column: 39, scope: !304)
!306 = !DILocation(line: 79, column: 49, scope: !304)
!307 = !DILocation(line: 79, column: 47, scope: !304)
!308 = !DILocation(line: 79, column: 22, scope: !304)
!309 = !DILocation(line: 79, column: 17, scope: !304)
!310 = !DILocation(line: 79, column: 13, scope: !304)
!311 = !DILocation(line: 79, column: 20, scope: !304)
!312 = !DILocation(line: 78, column: 33, scope: !300)
!313 = !DILocation(line: 78, column: 9, scope: !300)
!314 = distinct !{!314, !302, !315}
!315 = !DILocation(line: 80, column: 9, scope: !296)
!316 = !DILocation(line: 81, column: 34, scope: !275)
!317 = !DILocation(line: 81, column: 39, scope: !275)
!318 = !DILocation(line: 81, column: 19, scope: !275)
!319 = !DILocation(line: 81, column: 17, scope: !275)
!320 = !DILocation(line: 82, column: 5, scope: !275)
!321 = !DILocation(line: 83, column: 16, scope: !246)
!322 = !DILocation(line: 83, column: 9, scope: !246)
!323 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 86, type: !324, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!324 = !DISubroutineType(types: !325)
!325 = !{!182, !326}
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !250, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !327, identifier: "_ZTS9INSTR_VAL")
!327 = !{!328, !329, !330, !331}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !326, file: !250, line: 38, baseType: !11, size: 32)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !326, file: !250, line: 39, baseType: !11, size: 32, offset: 32)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !326, file: !250, line: 40, baseType: !11, size: 32, offset: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !326, file: !250, line: 41, baseType: !332, size: 96, offset: 96)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !250, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !333, identifier: "_ZTS15GEMM_STRUCT_VAL")
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !332, file: !250, line: 18, baseType: !11, size: 32)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !332, file: !250, line: 19, baseType: !11, size: 32, offset: 32)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !332, file: !250, line: 20, baseType: !11, size: 32, offset: 64)
!337 = !DILocalVariable(name: "instr", arg: 1, scope: !323, file: !3, line: 86, type: !326)
!338 = !DILocation(line: 86, column: 43, scope: !323)
!339 = !DILocalVariable(name: "arr_val", scope: !323, file: !3, line: 88, type: !182)
!340 = !DILocation(line: 88, column: 20, scope: !323)
!341 = !DILocalVariable(name: "inp", scope: !323, file: !3, line: 89, type: !139)
!342 = !DILocation(line: 89, column: 18, scope: !323)
!343 = !DILocalVariable(name: "wgt", scope: !323, file: !3, line: 89, type: !139)
!344 = !DILocation(line: 89, column: 26, scope: !323)
!345 = !DILocation(line: 90, column: 14, scope: !346)
!346 = distinct !DILexicalBlock(scope: !323, file: !3, line: 90, column: 8)
!347 = !DILocation(line: 90, column: 20, scope: !346)
!348 = !DILocation(line: 90, column: 8, scope: !323)
!349 = !DILocalVariable(name: "i", scope: !350, file: !3, line: 91, type: !19)
!350 = distinct !DILexicalBlock(scope: !351, file: !3, line: 91, column: 9)
!351 = distinct !DILexicalBlock(scope: !346, file: !3, line: 90, column: 25)
!352 = !DILocation(line: 91, column: 18, scope: !350)
!353 = !DILocation(line: 91, column: 14, scope: !350)
!354 = !DILocation(line: 91, column: 25, scope: !355)
!355 = distinct !DILexicalBlock(scope: !350, file: !3, line: 91, column: 9)
!356 = !DILocation(line: 91, column: 27, scope: !355)
!357 = !DILocation(line: 91, column: 9, scope: !350)
!358 = !DILocation(line: 92, column: 28, scope: !359)
!359 = distinct !DILexicalBlock(scope: !355, file: !3, line: 91, column: 37)
!360 = !DILocation(line: 92, column: 37, scope: !359)
!361 = !DILocation(line: 92, column: 47, scope: !359)
!362 = !DILocation(line: 92, column: 45, scope: !359)
!363 = !DILocation(line: 92, column: 17, scope: !359)
!364 = !DILocation(line: 92, column: 13, scope: !359)
!365 = !DILocation(line: 92, column: 20, scope: !359)
!366 = !DILocation(line: 91, column: 33, scope: !355)
!367 = !DILocation(line: 91, column: 9, scope: !355)
!368 = distinct !{!368, !357, !369}
!369 = !DILocation(line: 93, column: 9, scope: !350)
!370 = !DILocalVariable(name: "i", scope: !371, file: !3, line: 94, type: !19)
!371 = distinct !DILexicalBlock(scope: !351, file: !3, line: 94, column: 9)
!372 = !DILocation(line: 94, column: 18, scope: !371)
!373 = !DILocation(line: 94, column: 14, scope: !371)
!374 = !DILocation(line: 94, column: 25, scope: !375)
!375 = distinct !DILexicalBlock(scope: !371, file: !3, line: 94, column: 9)
!376 = !DILocation(line: 94, column: 27, scope: !375)
!377 = !DILocation(line: 94, column: 9, scope: !371)
!378 = !DILocation(line: 95, column: 28, scope: !379)
!379 = distinct !DILexicalBlock(scope: !375, file: !3, line: 94, column: 37)
!380 = !DILocation(line: 95, column: 37, scope: !379)
!381 = !DILocation(line: 95, column: 17, scope: !379)
!382 = !DILocation(line: 95, column: 13, scope: !379)
!383 = !DILocation(line: 95, column: 20, scope: !379)
!384 = !DILocation(line: 94, column: 33, scope: !375)
!385 = !DILocation(line: 94, column: 9, scope: !375)
!386 = distinct !{!386, !377, !387}
!387 = !DILocation(line: 96, column: 9, scope: !371)
!388 = !DILocation(line: 97, column: 37, scope: !351)
!389 = !DILocation(line: 97, column: 42, scope: !351)
!390 = !DILocation(line: 97, column: 19, scope: !351)
!391 = !DILocation(line: 97, column: 17, scope: !351)
!392 = !DILocation(line: 98, column: 5, scope: !351)
!393 = !DILocation(line: 99, column: 12, scope: !323)
!394 = !DILocation(line: 99, column: 5, scope: !323)
!395 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 102, type: !247, scopeLine: 102, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!396 = !DILocalVariable(name: "myinsn", arg: 1, scope: !395, file: !3, line: 102, type: !249)
!397 = !DILocation(line: 102, column: 32, scope: !395)
