; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !14
@arr_val = dso_local global i32* null, align 8, !dbg !20
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !23
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !26
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !28
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !30
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !32
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !34
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!219 = !DILocalVariable(name: "mat2", arg: 2, scope: !214, file: !3, line: 42, type: !139)
!220 = !DILocation(line: 42, column: 61, scope: !214)
!221 = !DILocalVariable(name: "res", arg: 3, scope: !214, file: !3, line: 42, type: !139)
!222 = !DILocation(line: 42, column: 87, scope: !214)
!223 = !DILocalVariable(name: "i", scope: !224, file: !3, line: 43, type: !17)
!224 = distinct !DILexicalBlock(scope: !214, file: !3, line: 43, column: 5)
!225 = !DILocation(line: 43, column: 14, scope: !224)
!226 = !DILocation(line: 43, column: 10, scope: !224)
!227 = !DILocation(line: 43, column: 21, scope: !228)
!228 = distinct !DILexicalBlock(scope: !224, file: !3, line: 43, column: 5)
!229 = !DILocation(line: 43, column: 23, scope: !228)
!230 = !DILocation(line: 43, column: 5, scope: !224)
!231 = !DILocalVariable(name: "j", scope: !232, file: !3, line: 44, type: !17)
!232 = distinct !DILexicalBlock(scope: !233, file: !3, line: 44, column: 9)
!233 = distinct !DILexicalBlock(scope: !228, file: !3, line: 43, column: 35)
!234 = !DILocation(line: 44, column: 18, scope: !232)
!235 = !DILocation(line: 44, column: 14, scope: !232)
!236 = !DILocation(line: 44, column: 25, scope: !237)
!237 = distinct !DILexicalBlock(scope: !232, file: !3, line: 44, column: 9)
!238 = !DILocation(line: 44, column: 27, scope: !237)
!239 = !DILocation(line: 44, column: 9, scope: !232)
!240 = !DILocalVariable(name: "k", scope: !241, file: !3, line: 45, type: !17)
!241 = distinct !DILexicalBlock(scope: !242, file: !3, line: 45, column: 13)
!242 = distinct !DILexicalBlock(scope: !237, file: !3, line: 44, column: 39)
!243 = !DILocation(line: 45, column: 22, scope: !241)
!244 = !DILocation(line: 45, column: 18, scope: !241)
!245 = !DILocation(line: 45, column: 29, scope: !246)
!246 = distinct !DILexicalBlock(scope: !241, file: !3, line: 45, column: 13)
!247 = !DILocation(line: 45, column: 31, scope: !246)
!248 = !DILocation(line: 45, column: 13, scope: !241)
!249 = !DILocation(line: 46, column: 42, scope: !250)
!250 = distinct !DILexicalBlock(scope: !246, file: !3, line: 45, column: 43)
!251 = !DILocation(line: 46, column: 34, scope: !250)
!252 = !DILocation(line: 46, column: 45, scope: !250)
!253 = !DILocation(line: 46, column: 58, scope: !250)
!254 = !DILocation(line: 46, column: 50, scope: !250)
!255 = !DILocation(line: 46, column: 61, scope: !250)
!256 = !DILocation(line: 46, column: 48, scope: !250)
!257 = !DILocation(line: 46, column: 25, scope: !250)
!258 = !DILocation(line: 46, column: 17, scope: !250)
!259 = !DILocation(line: 46, column: 28, scope: !250)
!260 = !DILocation(line: 46, column: 31, scope: !250)
!261 = !DILocation(line: 45, column: 39, scope: !246)
!262 = !DILocation(line: 45, column: 13, scope: !246)
!263 = distinct !{!263, !248, !264}
!264 = !DILocation(line: 47, column: 13, scope: !241)
!265 = !DILocation(line: 44, column: 35, scope: !237)
!266 = !DILocation(line: 44, column: 9, scope: !237)
!267 = distinct !{!267, !239, !268}
!268 = !DILocation(line: 48, column: 9, scope: !232)
!269 = !DILocation(line: 43, column: 31, scope: !228)
!270 = !DILocation(line: 43, column: 5, scope: !228)
!271 = distinct !{!271, !230, !272}
!272 = !DILocation(line: 49, column: 5, scope: !224)
!273 = !DILocalVariable(name: "i", scope: !274, file: !3, line: 50, type: !17)
!274 = distinct !DILexicalBlock(scope: !214, file: !3, line: 50, column: 5)
!275 = !DILocation(line: 50, column: 13, scope: !274)
!276 = !DILocation(line: 50, column: 9, scope: !274)
!277 = !DILocation(line: 50, column: 18, scope: !278)
!278 = distinct !DILexicalBlock(scope: !274, file: !3, line: 50, column: 5)
!279 = !DILocation(line: 50, column: 19, scope: !278)
!280 = !DILocation(line: 50, column: 5, scope: !274)
!281 = !DILocalVariable(name: "j", scope: !282, file: !3, line: 51, type: !17)
!282 = distinct !DILexicalBlock(scope: !283, file: !3, line: 51, column: 9)
!283 = distinct !DILexicalBlock(scope: !278, file: !3, line: 50, column: 28)
!284 = !DILocation(line: 51, column: 17, scope: !282)
!285 = !DILocation(line: 51, column: 13, scope: !282)
!286 = !DILocation(line: 51, column: 21, scope: !287)
!287 = distinct !DILexicalBlock(scope: !282, file: !3, line: 51, column: 9)
!288 = !DILocation(line: 51, column: 22, scope: !287)
!289 = !DILocation(line: 0, scope: !278)
!290 = !DILocation(line: 51, column: 9, scope: !282)
!291 = !DILocation(line: 52, column: 37, scope: !292)
!292 = distinct !DILexicalBlock(scope: !287, file: !3, line: 51, column: 31)
!293 = !DILocation(line: 52, column: 48, scope: !292)
!294 = !DILocation(line: 52, column: 26, scope: !292)
!295 = !DILocation(line: 52, column: 27, scope: !292)
!296 = !DILocation(line: 52, column: 32, scope: !292)
!297 = !DILocation(line: 52, column: 31, scope: !292)
!298 = !DILocation(line: 52, column: 13, scope: !292)
!299 = !DILocation(line: 52, column: 35, scope: !292)
!300 = !DILocation(line: 51, column: 28, scope: !287)
!301 = !DILocation(line: 51, column: 9, scope: !287)
!302 = distinct !{!302, !290, !303}
!303 = !DILocation(line: 53, column: 9, scope: !282)
!304 = !DILocation(line: 50, column: 25, scope: !278)
!305 = !DILocation(line: 50, column: 5, scope: !278)
!306 = distinct !{!306, !280, !307}
!307 = !DILocation(line: 54, column: 5, scope: !274)
!308 = !DILocation(line: 55, column: 5, scope: !214)
!309 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 58, type: !310, scopeLine: 59, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!310 = !DISubroutineType(types: !311)
!311 = !{!22, !312}
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !313, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !314, identifier: "_ZTS5INSTR")
!313 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!314 = !{!315, !316, !317, !318}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !312, file: !313, line: 24, baseType: !11, size: 32)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !312, file: !313, line: 25, baseType: !11, size: 32, offset: 32)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !312, file: !313, line: 26, baseType: !11, size: 32, offset: 64)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !312, file: !313, line: 27, baseType: !319, size: 192, offset: 128)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !313, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !320, identifier: "_ZTS15GEMM_STRUCT_REF")
!320 = !{!321, !322, !323}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !319, file: !313, line: 6, baseType: !22, size: 64)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !319, file: !313, line: 7, baseType: !22, size: 64, offset: 64)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !319, file: !313, line: 8, baseType: !22, size: 64, offset: 128)
!324 = !DILocalVariable(name: "instr", arg: 1, scope: !309, file: !3, line: 58, type: !312)
!325 = !DILocation(line: 58, column: 35, scope: !309)
!326 = !DILocalVariable(name: "arr_ref", scope: !309, file: !3, line: 60, type: !22)
!327 = !DILocation(line: 60, column: 19, scope: !309)
!328 = !DILocalVariable(name: "inp", scope: !309, file: !3, line: 61, type: !140)
!329 = !DILocation(line: 61, column: 18, scope: !309)
!330 = !DILocalVariable(name: "wgt", scope: !309, file: !3, line: 61, type: !140)
!331 = !DILocation(line: 61, column: 26, scope: !309)
!332 = !DILocation(line: 62, column: 14, scope: !333)
!333 = distinct !DILexicalBlock(scope: !309, file: !3, line: 62, column: 8)
!334 = !DILocation(line: 62, column: 20, scope: !333)
!335 = !DILocation(line: 62, column: 8, scope: !309)
!336 = !DILocalVariable(name: "i", scope: !337, file: !3, line: 63, type: !17)
!337 = distinct !DILexicalBlock(scope: !338, file: !3, line: 63, column: 9)
!338 = distinct !DILexicalBlock(scope: !333, file: !3, line: 62, column: 25)
!339 = !DILocation(line: 63, column: 18, scope: !337)
!340 = !DILocation(line: 63, column: 14, scope: !337)
!341 = !DILocation(line: 63, column: 25, scope: !342)
!342 = distinct !DILexicalBlock(scope: !337, file: !3, line: 63, column: 9)
!343 = !DILocation(line: 63, column: 27, scope: !342)
!344 = !DILocation(line: 63, column: 9, scope: !337)
!345 = !DILocation(line: 64, column: 30, scope: !346)
!346 = distinct !DILexicalBlock(scope: !342, file: !3, line: 63, column: 37)
!347 = !DILocation(line: 64, column: 39, scope: !346)
!348 = !DILocation(line: 64, column: 49, scope: !346)
!349 = !DILocation(line: 64, column: 47, scope: !346)
!350 = !DILocation(line: 64, column: 22, scope: !346)
!351 = !DILocation(line: 64, column: 17, scope: !346)
!352 = !DILocation(line: 64, column: 13, scope: !346)
!353 = !DILocation(line: 64, column: 20, scope: !346)
!354 = !DILocation(line: 63, column: 33, scope: !342)
!355 = !DILocation(line: 63, column: 9, scope: !342)
!356 = distinct !{!356, !344, !357}
!357 = !DILocation(line: 65, column: 9, scope: !337)
!358 = !DILocalVariable(name: "i", scope: !359, file: !3, line: 66, type: !17)
!359 = distinct !DILexicalBlock(scope: !338, file: !3, line: 66, column: 9)
!360 = !DILocation(line: 66, column: 18, scope: !359)
!361 = !DILocation(line: 66, column: 14, scope: !359)
!362 = !DILocation(line: 66, column: 25, scope: !363)
!363 = distinct !DILexicalBlock(scope: !359, file: !3, line: 66, column: 9)
!364 = !DILocation(line: 66, column: 27, scope: !363)
!365 = !DILocation(line: 66, column: 9, scope: !359)
!366 = !DILocation(line: 67, column: 30, scope: !367)
!367 = distinct !DILexicalBlock(scope: !363, file: !3, line: 66, column: 37)
!368 = !DILocation(line: 67, column: 39, scope: !367)
!369 = !DILocation(line: 67, column: 49, scope: !367)
!370 = !DILocation(line: 67, column: 47, scope: !367)
!371 = !DILocation(line: 67, column: 22, scope: !367)
!372 = !DILocation(line: 67, column: 17, scope: !367)
!373 = !DILocation(line: 67, column: 13, scope: !367)
!374 = !DILocation(line: 67, column: 20, scope: !367)
!375 = !DILocation(line: 66, column: 33, scope: !363)
!376 = !DILocation(line: 66, column: 9, scope: !363)
!377 = distinct !{!377, !365, !378}
!378 = !DILocation(line: 68, column: 9, scope: !359)
!379 = !DILocation(line: 69, column: 34, scope: !338)
!380 = !DILocation(line: 69, column: 39, scope: !338)
!381 = !DILocation(line: 69, column: 19, scope: !338)
!382 = !DILocation(line: 69, column: 17, scope: !338)
!383 = !DILocation(line: 70, column: 5, scope: !338)
!384 = !DILocation(line: 71, column: 16, scope: !309)
!385 = !DILocation(line: 71, column: 9, scope: !309)
!386 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 74, type: !387, scopeLine: 75, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!387 = !DISubroutineType(types: !388)
!388 = !{!22, !389}
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !313, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !390, identifier: "_ZTS9INSTR_VAL")
!390 = !{!391, !392, !393, !394}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !389, file: !313, line: 38, baseType: !11, size: 32)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !389, file: !313, line: 39, baseType: !11, size: 32, offset: 32)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !389, file: !313, line: 40, baseType: !11, size: 32, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !389, file: !313, line: 41, baseType: !395, size: 96, offset: 96)
!395 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !313, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !396, identifier: "_ZTS15GEMM_STRUCT_VAL")
!396 = !{!397, !398, !399}
!397 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !395, file: !313, line: 18, baseType: !11, size: 32)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !395, file: !313, line: 19, baseType: !11, size: 32, offset: 32)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !395, file: !313, line: 20, baseType: !11, size: 32, offset: 64)
!400 = !DILocalVariable(name: "instr", arg: 1, scope: !386, file: !3, line: 74, type: !389)
!401 = !DILocation(line: 74, column: 43, scope: !386)
!402 = !DILocalVariable(name: "arr_val", scope: !386, file: !3, line: 76, type: !22)
!403 = !DILocation(line: 76, column: 20, scope: !386)
!404 = !DILocalVariable(name: "inp", scope: !386, file: !3, line: 77, type: !140)
!405 = !DILocation(line: 77, column: 18, scope: !386)
!406 = !DILocalVariable(name: "wgt", scope: !386, file: !3, line: 77, type: !140)
!407 = !DILocation(line: 77, column: 26, scope: !386)
!408 = !DILocation(line: 78, column: 14, scope: !409)
!409 = distinct !DILexicalBlock(scope: !386, file: !3, line: 78, column: 8)
!410 = !DILocation(line: 78, column: 20, scope: !409)
!411 = !DILocation(line: 78, column: 8, scope: !386)
!412 = !DILocalVariable(name: "i", scope: !413, file: !3, line: 79, type: !17)
!413 = distinct !DILexicalBlock(scope: !414, file: !3, line: 79, column: 9)
!414 = distinct !DILexicalBlock(scope: !409, file: !3, line: 78, column: 25)
!415 = !DILocation(line: 79, column: 18, scope: !413)
!416 = !DILocation(line: 79, column: 14, scope: !413)
!417 = !DILocation(line: 79, column: 25, scope: !418)
!418 = distinct !DILexicalBlock(scope: !413, file: !3, line: 79, column: 9)
!419 = !DILocation(line: 79, column: 27, scope: !418)
!420 = !DILocation(line: 79, column: 9, scope: !413)
!421 = !DILocation(line: 80, column: 28, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !3, line: 79, column: 37)
!423 = !DILocation(line: 80, column: 37, scope: !422)
!424 = !DILocation(line: 80, column: 47, scope: !422)
!425 = !DILocation(line: 80, column: 45, scope: !422)
!426 = !DILocation(line: 80, column: 17, scope: !422)
!427 = !DILocation(line: 80, column: 13, scope: !422)
!428 = !DILocation(line: 80, column: 20, scope: !422)
!429 = !DILocation(line: 79, column: 33, scope: !418)
!430 = !DILocation(line: 79, column: 9, scope: !418)
!431 = distinct !{!431, !420, !432}
!432 = !DILocation(line: 81, column: 9, scope: !413)
!433 = !DILocalVariable(name: "i", scope: !434, file: !3, line: 82, type: !17)
!434 = distinct !DILexicalBlock(scope: !414, file: !3, line: 82, column: 9)
!435 = !DILocation(line: 82, column: 18, scope: !434)
!436 = !DILocation(line: 82, column: 14, scope: !434)
!437 = !DILocation(line: 82, column: 25, scope: !438)
!438 = distinct !DILexicalBlock(scope: !434, file: !3, line: 82, column: 9)
!439 = !DILocation(line: 82, column: 27, scope: !438)
!440 = !DILocation(line: 82, column: 9, scope: !434)
!441 = !DILocation(line: 83, column: 28, scope: !442)
!442 = distinct !DILexicalBlock(scope: !438, file: !3, line: 82, column: 37)
!443 = !DILocation(line: 83, column: 37, scope: !442)
!444 = !DILocation(line: 83, column: 17, scope: !442)
!445 = !DILocation(line: 83, column: 13, scope: !442)
!446 = !DILocation(line: 83, column: 20, scope: !442)
!447 = !DILocation(line: 82, column: 33, scope: !438)
!448 = !DILocation(line: 82, column: 9, scope: !438)
!449 = distinct !{!449, !440, !450}
!450 = !DILocation(line: 84, column: 9, scope: !434)
!451 = !DILocation(line: 85, column: 34, scope: !414)
!452 = !DILocation(line: 85, column: 39, scope: !414)
!453 = !DILocation(line: 85, column: 19, scope: !414)
!454 = !DILocation(line: 85, column: 17, scope: !414)
!455 = !DILocation(line: 86, column: 5, scope: !414)
!456 = !DILocation(line: 87, column: 12, scope: !386)
!457 = !DILocation(line: 87, column: 5, scope: !386)
!458 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 90, type: !310, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!459 = !DILocalVariable(name: "myinsn", arg: 1, scope: !458, file: !3, line: 90, type: !312)
!460 = !DILocation(line: 90, column: 32, scope: !458)
!461 = !DILocalVariable(name: "row", scope: !458, file: !3, line: 91, type: !11)
