; ModuleID = 'gemm_klee.bc'
source_filename = "gemm_klee.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@res_index_val = dso_local global i32 0, align 4, !dbg !8
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !11
@result_val = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !17
@product = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !19
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !24
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !27
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !29
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !31
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !33
@acc_mem_base_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !35
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1

!162 = distinct !DILexicalBlock(scope: !159, file: !3, line: 28, column: 9)
!163 = !DILocation(line: 28, column: 23, scope: !162)
!164 = !DILocation(line: 28, column: 9, scope: !159)
!165 = !DILocation(line: 29, column: 35, scope: !162)
!166 = !DILocation(line: 29, column: 43, scope: !162)
!167 = !DILocation(line: 29, column: 46, scope: !162)
!168 = !DILocation(line: 29, column: 13, scope: !162)
!169 = !DILocation(line: 29, column: 27, scope: !162)
!170 = !DILocation(line: 29, column: 30, scope: !162)
!171 = !DILocation(line: 29, column: 33, scope: !162)
!172 = !DILocation(line: 28, column: 31, scope: !162)
!173 = !DILocation(line: 28, column: 9, scope: !162)
!174 = distinct !{!174, !164, !175}
!175 = !DILocation(line: 29, column: 47, scope: !159)
!176 = !DILocation(line: 27, column: 27, scope: !155)
!177 = !DILocation(line: 27, column: 5, scope: !155)
!178 = distinct !{!178, !157, !179}
!179 = !DILocation(line: 29, column: 47, scope: !152)
!180 = !DILocation(line: 30, column: 1, scope: !137)
!181 = distinct !DISubprogram(name: "matrixMultiply", linkageName: "_Z14matrixMultiplyPjS_", scope: !3, file: !3, line: 32, type: !182, scopeLine: 33, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!182 = !DISubroutineType(types: !183)
!183 = !{!184, !184, !184}
!184 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!185 = !DILocalVariable(name: "mat1", arg: 1, scope: !181, file: !3, line: 32, type: !184)
!186 = !DILocation(line: 32, column: 43, scope: !181)
!187 = !DILocalVariable(name: "mat2", arg: 2, scope: !181, file: !3, line: 32, type: !184)
!188 = !DILocation(line: 32, column: 64, scope: !181)
!189 = !DILocalVariable(name: "res", scope: !181, file: !3, line: 34, type: !14)
!190 = !DILocation(line: 34, column: 18, scope: !181)
!191 = !DILocalVariable(name: "i", scope: !192, file: !3, line: 35, type: !10)
!192 = distinct !DILexicalBlock(scope: !181, file: !3, line: 35, column: 5)
!193 = !DILocation(line: 35, column: 13, scope: !192)
!194 = !DILocation(line: 35, column: 9, scope: !192)
!195 = !DILocation(line: 35, column: 20, scope: !196)
!196 = distinct !DILexicalBlock(scope: !192, file: !3, line: 35, column: 5)
!197 = !DILocation(line: 35, column: 22, scope: !196)
!198 = !DILocation(line: 35, column: 5, scope: !192)
!199 = !DILocation(line: 37, column: 16, scope: !200)
!200 = distinct !DILexicalBlock(scope: !196, file: !3, line: 36, column: 5)
!201 = !DILocation(line: 37, column: 21, scope: !200)
!202 = !DILocation(line: 37, column: 26, scope: !200)
!203 = !DILocation(line: 37, column: 31, scope: !200)
!204 = !DILocation(line: 37, column: 24, scope: !200)
!205 = !DILocation(line: 37, column: 13, scope: !200)
!206 = !DILocation(line: 35, column: 28, scope: !196)
!207 = !DILocation(line: 35, column: 5, scope: !196)
!208 = distinct !{!208, !198, !209}
!209 = !DILocation(line: 38, column: 5, scope: !192)
!210 = !DILocation(line: 39, column: 25, scope: !181)
!211 = !DILocation(line: 39, column: 12, scope: !181)
!212 = !DILocation(line: 39, column: 5, scope: !181)
!213 = !DILocation(line: 39, column: 23, scope: !181)
!214 = !DILocation(line: 40, column: 14, scope: !181)
!215 = !DILocation(line: 41, column: 5, scope: !181)
!216 = distinct !DISubprogram(name: "matrixMultiplyVal", linkageName: "_Z17matrixMultiplyValPjS_", scope: !3, file: !3, line: 44, type: !182, scopeLine: 45, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!217 = !DILocalVariable(name: "mat1", arg: 1, scope: !216, file: !3, line: 44, type: !184)
!218 = !DILocation(line: 44, column: 46, scope: !216)
!219 = !DILocalVariable(name: "mat2", arg: 2, scope: !216, file: !3, line: 44, type: !184)
!220 = !DILocation(line: 44, column: 67, scope: !216)
!221 = !DILocalVariable(name: "res", scope: !216, file: !3, line: 46, type: !14)
!222 = !DILocation(line: 46, column: 18, scope: !216)
!223 = !DILocalVariable(name: "i", scope: !224, file: !3, line: 47, type: !10)
!224 = distinct !DILexicalBlock(scope: !216, file: !3, line: 47, column: 5)
!225 = !DILocation(line: 47, column: 13, scope: !224)
!226 = !DILocation(line: 47, column: 9, scope: !224)
!227 = !DILocation(line: 47, column: 20, scope: !228)
!228 = distinct !DILexicalBlock(scope: !224, file: !3, line: 47, column: 5)
!229 = !DILocation(line: 47, column: 22, scope: !228)
!230 = !DILocation(line: 47, column: 5, scope: !224)
!231 = !DILocation(line: 49, column: 16, scope: !232)
!232 = distinct !DILexicalBlock(scope: !228, file: !3, line: 48, column: 5)
!233 = !DILocation(line: 49, column: 21, scope: !232)
!234 = !DILocation(line: 49, column: 26, scope: !232)
!235 = !DILocation(line: 49, column: 31, scope: !232)
!236 = !DILocation(line: 49, column: 24, scope: !232)
!237 = !DILocation(line: 49, column: 13, scope: !232)
!238 = !DILocation(line: 47, column: 28, scope: !228)
!239 = !DILocation(line: 47, column: 5, scope: !228)
!240 = distinct !{!240, !230, !241}
!241 = !DILocation(line: 50, column: 5, scope: !224)
!242 = !DILocation(line: 51, column: 33, scope: !216)
!243 = !DILocation(line: 51, column: 16, scope: !216)
!244 = !DILocation(line: 51, column: 5, scope: !216)
!245 = !DILocation(line: 51, column: 31, scope: !216)
!246 = !DILocation(line: 52, column: 18, scope: !216)
!247 = !DILocation(line: 53, column: 5, scope: !216)
!248 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 71, type: !249, scopeLine: 72, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!249 = !DISubroutineType(types: !250)
!250 = !{!184, !251}
!251 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !252, line: 23, size: 320, flags: DIFlagTypePassByValue, elements: !253, identifier: "_ZTS5INSTR")
!252 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !251, file: !252, line: 24, baseType: !14, size: 32)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !251, file: !252, line: 25, baseType: !14, size: 32, offset: 32)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !251, file: !252, line: 26, baseType: !14, size: 32, offset: 64)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !251, file: !252, line: 27, baseType: !258, size: 192, offset: 128)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !252, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !259, identifier: "_ZTS15GEMM_STRUCT_REF")
!259 = !{!260, !261, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !258, file: !252, line: 6, baseType: !184, size: 64)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !258, file: !252, line: 7, baseType: !184, size: 64, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !258, file: !252, line: 8, baseType: !184, size: 64, offset: 128)
!263 = !DILocalVariable(name: "instr", arg: 1, scope: !248, file: !3, line: 71, type: !251)
!264 = !DILocation(line: 71, column: 35, scope: !248)
!265 = !DILocalVariable(name: "arr_ref", scope: !248, file: !3, line: 73, type: !184)
!266 = !DILocation(line: 73, column: 20, scope: !248)
!267 = !DILocalVariable(name: "inp", scope: !248, file: !3, line: 74, type: !141)
!268 = !DILocation(line: 74, column: 18, scope: !248)
!269 = !DILocalVariable(name: "wgt", scope: !248, file: !3, line: 74, type: !141)
!270 = !DILocation(line: 74, column: 26, scope: !248)
!271 = !DILocation(line: 75, column: 14, scope: !272)
!272 = distinct !DILexicalBlock(scope: !248, file: !3, line: 75, column: 8)
!273 = !DILocation(line: 75, column: 20, scope: !272)
!274 = !DILocation(line: 75, column: 8, scope: !248)
!275 = !DILocalVariable(name: "i", scope: !276, file: !3, line: 76, type: !10)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 76, column: 9)
!277 = distinct !DILexicalBlock(scope: !272, file: !3, line: 75, column: 25)
!278 = !DILocation(line: 76, column: 18, scope: !276)
!279 = !DILocation(line: 76, column: 14, scope: !276)
!280 = !DILocation(line: 76, column: 25, scope: !281)
!281 = distinct !DILexicalBlock(scope: !276, file: !3, line: 76, column: 9)
!282 = !DILocation(line: 76, column: 27, scope: !281)
!283 = !DILocation(line: 76, column: 9, scope: !276)
!284 = !DILocation(line: 77, column: 30, scope: !285)
!285 = distinct !DILexicalBlock(scope: !281, file: !3, line: 76, column: 37)
!286 = !DILocation(line: 77, column: 39, scope: !285)
!287 = !DILocation(line: 77, column: 49, scope: !285)
!288 = !DILocation(line: 77, column: 47, scope: !285)
!289 = !DILocation(line: 77, column: 22, scope: !285)
!290 = !DILocation(line: 77, column: 17, scope: !285)
!291 = !DILocation(line: 77, column: 13, scope: !285)
!292 = !DILocation(line: 77, column: 20, scope: !285)
!293 = !DILocation(line: 76, column: 33, scope: !281)
!294 = !DILocation(line: 76, column: 9, scope: !281)
!295 = distinct !{!295, !283, !296}
!296 = !DILocation(line: 78, column: 9, scope: !276)
!297 = !DILocalVariable(name: "i", scope: !298, file: !3, line: 79, type: !10)
!298 = distinct !DILexicalBlock(scope: !277, file: !3, line: 79, column: 9)
!299 = !DILocation(line: 79, column: 18, scope: !298)
!300 = !DILocation(line: 79, column: 14, scope: !298)
!301 = !DILocation(line: 79, column: 25, scope: !302)
!302 = distinct !DILexicalBlock(scope: !298, file: !3, line: 79, column: 9)
!303 = !DILocation(line: 79, column: 27, scope: !302)
!304 = !DILocation(line: 79, column: 9, scope: !298)
!305 = !DILocation(line: 80, column: 30, scope: !306)
!306 = distinct !DILexicalBlock(scope: !302, file: !3, line: 79, column: 37)
!307 = !DILocation(line: 80, column: 39, scope: !306)
!308 = !DILocation(line: 80, column: 49, scope: !306)
!309 = !DILocation(line: 80, column: 47, scope: !306)
!310 = !DILocation(line: 80, column: 22, scope: !306)
!311 = !DILocation(line: 80, column: 17, scope: !306)
!312 = !DILocation(line: 80, column: 13, scope: !306)
!313 = !DILocation(line: 80, column: 20, scope: !306)
!314 = !DILocation(line: 79, column: 33, scope: !302)
!315 = !DILocation(line: 79, column: 9, scope: !302)
!316 = distinct !{!316, !304, !317}
!317 = !DILocation(line: 81, column: 9, scope: !298)
!318 = !DILocation(line: 82, column: 34, scope: !277)
!319 = !DILocation(line: 82, column: 39, scope: !277)
!320 = !DILocation(line: 82, column: 19, scope: !277)
!321 = !DILocation(line: 82, column: 17, scope: !277)
!322 = !DILocation(line: 83, column: 5, scope: !277)
!323 = !DILocation(line: 84, column: 16, scope: !248)
!324 = !DILocation(line: 84, column: 9, scope: !248)
!325 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 87, type: !326, scopeLine: 88, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!326 = !DISubroutineType(types: !327)
!327 = !{!184, !328}
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !252, line: 37, size: 192, flags: DIFlagTypePassByValue, elements: !329, identifier: "_ZTS9INSTR_VAL")
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !328, file: !252, line: 38, baseType: !14, size: 32)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !328, file: !252, line: 39, baseType: !14, size: 32, offset: 32)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !328, file: !252, line: 40, baseType: !14, size: 32, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !328, file: !252, line: 41, baseType: !334, size: 96, offset: 96)
!334 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !252, line: 17, size: 96, flags: DIFlagTypePassByValue, elements: !335, identifier: "_ZTS15GEMM_STRUCT_VAL")
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !334, file: !252, line: 18, baseType: !14, size: 32)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !334, file: !252, line: 19, baseType: !14, size: 32, offset: 32)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !334, file: !252, line: 20, baseType: !14, size: 32, offset: 64)
!339 = !DILocalVariable(name: "instr", arg: 1, scope: !325, file: !3, line: 87, type: !328)
!340 = !DILocation(line: 87, column: 43, scope: !325)
!341 = !DILocalVariable(name: "arr_val", scope: !325, file: !3, line: 89, type: !184)
!342 = !DILocation(line: 89, column: 20, scope: !325)
!343 = !DILocalVariable(name: "inp", scope: !325, file: !3, line: 90, type: !141)
!344 = !DILocation(line: 90, column: 18, scope: !325)
!345 = !DILocalVariable(name: "wgt", scope: !325, file: !3, line: 90, type: !141)
!346 = !DILocation(line: 90, column: 26, scope: !325)
!347 = !DILocation(line: 91, column: 14, scope: !348)
!348 = distinct !DILexicalBlock(scope: !325, file: !3, line: 91, column: 8)
!349 = !DILocation(line: 91, column: 20, scope: !348)
!350 = !DILocation(line: 91, column: 8, scope: !325)
!351 = !DILocalVariable(name: "i", scope: !352, file: !3, line: 92, type: !10)
!352 = distinct !DILexicalBlock(scope: !353, file: !3, line: 92, column: 9)
!353 = distinct !DILexicalBlock(scope: !348, file: !3, line: 91, column: 25)
!354 = !DILocation(line: 92, column: 18, scope: !352)
!355 = !DILocation(line: 92, column: 14, scope: !352)
!356 = !DILocation(line: 92, column: 25, scope: !357)
!357 = distinct !DILexicalBlock(scope: !352, file: !3, line: 92, column: 9)
!358 = !DILocation(line: 92, column: 27, scope: !357)
!359 = !DILocation(line: 92, column: 9, scope: !352)
!360 = !DILocation(line: 93, column: 28, scope: !361)
!361 = distinct !DILexicalBlock(scope: !357, file: !3, line: 92, column: 37)
!362 = !DILocation(line: 93, column: 37, scope: !361)
!363 = !DILocation(line: 93, column: 47, scope: !361)
!364 = !DILocation(line: 93, column: 45, scope: !361)
!365 = !DILocation(line: 93, column: 17, scope: !361)
!366 = !DILocation(line: 93, column: 13, scope: !361)
!367 = !DILocation(line: 93, column: 20, scope: !361)
!368 = !DILocation(line: 92, column: 33, scope: !357)
!369 = !DILocation(line: 92, column: 9, scope: !357)
!370 = distinct !{!370, !359, !371}
!371 = !DILocation(line: 94, column: 9, scope: !352)
!372 = !DILocalVariable(name: "i", scope: !373, file: !3, line: 95, type: !10)
!373 = distinct !DILexicalBlock(scope: !353, file: !3, line: 95, column: 9)
!374 = !DILocation(line: 95, column: 18, scope: !373)
!375 = !DILocation(line: 95, column: 14, scope: !373)
!376 = !DILocation(line: 95, column: 25, scope: !377)
!377 = distinct !DILexicalBlock(scope: !373, file: !3, line: 95, column: 9)
!378 = !DILocation(line: 95, column: 27, scope: !377)
!379 = !DILocation(line: 95, column: 9, scope: !373)
!380 = !DILocation(line: 96, column: 28, scope: !381)
!381 = distinct !DILexicalBlock(scope: !377, file: !3, line: 95, column: 37)
!382 = !DILocation(line: 96, column: 37, scope: !381)
!383 = !DILocation(line: 96, column: 17, scope: !381)
!384 = !DILocation(line: 96, column: 13, scope: !381)
!385 = !DILocation(line: 96, column: 20, scope: !381)
!386 = !DILocation(line: 95, column: 33, scope: !377)
!387 = !DILocation(line: 95, column: 9, scope: !377)
!388 = distinct !{!388, !379, !389}
!389 = !DILocation(line: 97, column: 9, scope: !373)
!390 = !DILocation(line: 98, column: 37, scope: !353)
!391 = !DILocation(line: 98, column: 42, scope: !353)
!392 = !DILocation(line: 98, column: 19, scope: !353)
!393 = !DILocation(line: 98, column: 17, scope: !353)
!394 = !DILocation(line: 99, column: 5, scope: !353)
!395 = !DILocation(line: 100, column: 12, scope: !325)
!396 = !DILocation(line: 100, column: 5, scope: !325)
!397 = distinct !DISubprogram(name: "base_gemm", linkageName: "_Z9base_gemm5INSTR", scope: !3, file: !3, line: 103, type: !249, scopeLine: 103, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!398 = !DILocalVariable(name: "myinsn", arg: 1, scope: !397, file: !3, line: 103, type: !251)
!399 = !DILocation(line: 103, column: 32, scope: !397)
