; ModuleID = 'gemm.bc'
source_filename = "gemm.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !14
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !19
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !21
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !23
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !25
@acc_mem_gemm = dso_local global i32* null, align 8, !dbg !27
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!213 = !DILocalVariable(name: "mat2", arg: 2, scope: !208, file: !3, line: 63, type: !133)
!214 = !DILocation(line: 63, column: 61, scope: !208)
!215 = !DILocalVariable(name: "res", arg: 3, scope: !208, file: !3, line: 63, type: !133)
!216 = !DILocation(line: 63, column: 87, scope: !208)
!217 = !DILocalVariable(name: "i", scope: !218, file: !3, line: 64, type: !40)
!218 = distinct !DILexicalBlock(scope: !208, file: !3, line: 64, column: 5)
!219 = !DILocation(line: 64, column: 14, scope: !218)
!220 = !DILocation(line: 64, column: 10, scope: !218)
!221 = !DILocation(line: 64, column: 21, scope: !222)
!222 = distinct !DILexicalBlock(scope: !218, file: !3, line: 64, column: 5)
!223 = !DILocation(line: 64, column: 23, scope: !222)
!224 = !DILocation(line: 64, column: 5, scope: !218)
!225 = !DILocalVariable(name: "j", scope: !226, file: !3, line: 65, type: !40)
!226 = distinct !DILexicalBlock(scope: !227, file: !3, line: 65, column: 9)
!227 = distinct !DILexicalBlock(scope: !222, file: !3, line: 64, column: 35)
!228 = !DILocation(line: 65, column: 18, scope: !226)
!229 = !DILocation(line: 65, column: 14, scope: !226)
!230 = !DILocation(line: 65, column: 25, scope: !231)
!231 = distinct !DILexicalBlock(scope: !226, file: !3, line: 65, column: 9)
!232 = !DILocation(line: 65, column: 27, scope: !231)
!233 = !DILocation(line: 65, column: 9, scope: !226)
!234 = !DILocalVariable(name: "k", scope: !235, file: !3, line: 66, type: !40)
!235 = distinct !DILexicalBlock(scope: !236, file: !3, line: 66, column: 13)
!236 = distinct !DILexicalBlock(scope: !231, file: !3, line: 65, column: 39)
!237 = !DILocation(line: 66, column: 22, scope: !235)
!238 = !DILocation(line: 66, column: 18, scope: !235)
!239 = !DILocation(line: 66, column: 29, scope: !240)
!240 = distinct !DILexicalBlock(scope: !235, file: !3, line: 66, column: 13)
!241 = !DILocation(line: 66, column: 31, scope: !240)
!242 = !DILocation(line: 66, column: 13, scope: !235)
!243 = !DILocation(line: 67, column: 42, scope: !244)
!244 = distinct !DILexicalBlock(scope: !240, file: !3, line: 66, column: 43)
!245 = !DILocation(line: 67, column: 34, scope: !244)
!246 = !DILocation(line: 67, column: 45, scope: !244)
!247 = !DILocation(line: 67, column: 58, scope: !244)
!248 = !DILocation(line: 67, column: 50, scope: !244)
!249 = !DILocation(line: 67, column: 61, scope: !244)
!250 = !DILocation(line: 67, column: 48, scope: !244)
!251 = !DILocation(line: 67, column: 25, scope: !244)
!252 = !DILocation(line: 67, column: 17, scope: !244)
!253 = !DILocation(line: 67, column: 28, scope: !244)
!254 = !DILocation(line: 67, column: 31, scope: !244)
!255 = !DILocation(line: 66, column: 39, scope: !240)
!256 = !DILocation(line: 66, column: 13, scope: !240)
!257 = distinct !{!257, !242, !258}
!258 = !DILocation(line: 68, column: 13, scope: !235)
!259 = !DILocation(line: 65, column: 35, scope: !231)
!260 = !DILocation(line: 65, column: 9, scope: !231)
!261 = distinct !{!261, !233, !262}
!262 = !DILocation(line: 69, column: 9, scope: !226)
!263 = !DILocation(line: 64, column: 31, scope: !222)
!264 = !DILocation(line: 64, column: 5, scope: !222)
!265 = distinct !{!265, !224, !266}
!266 = !DILocation(line: 70, column: 5, scope: !218)
!267 = !DILocalVariable(name: "i", scope: !268, file: !3, line: 71, type: !40)
!268 = distinct !DILexicalBlock(scope: !208, file: !3, line: 71, column: 5)
!269 = !DILocation(line: 71, column: 13, scope: !268)
!270 = !DILocation(line: 71, column: 9, scope: !268)
!271 = !DILocation(line: 71, column: 18, scope: !272)
!272 = distinct !DILexicalBlock(scope: !268, file: !3, line: 71, column: 5)
!273 = !DILocation(line: 71, column: 19, scope: !272)
!274 = !DILocation(line: 71, column: 5, scope: !268)
!275 = !DILocalVariable(name: "j", scope: !276, file: !3, line: 72, type: !40)
!276 = distinct !DILexicalBlock(scope: !277, file: !3, line: 72, column: 9)
!277 = distinct !DILexicalBlock(scope: !272, file: !3, line: 71, column: 28)
!278 = !DILocation(line: 72, column: 17, scope: !276)
!279 = !DILocation(line: 72, column: 13, scope: !276)
!280 = !DILocation(line: 72, column: 21, scope: !281)
!281 = distinct !DILexicalBlock(scope: !276, file: !3, line: 72, column: 9)
!282 = !DILocation(line: 72, column: 22, scope: !281)
!283 = !DILocation(line: 0, scope: !272)
!284 = !DILocation(line: 72, column: 9, scope: !276)
!285 = !DILocation(line: 73, column: 37, scope: !286)
!286 = distinct !DILexicalBlock(scope: !281, file: !3, line: 72, column: 31)
!287 = !DILocation(line: 73, column: 48, scope: !286)
!288 = !DILocation(line: 73, column: 26, scope: !286)
!289 = !DILocation(line: 73, column: 27, scope: !286)
!290 = !DILocation(line: 73, column: 32, scope: !286)
!291 = !DILocation(line: 73, column: 31, scope: !286)
!292 = !DILocation(line: 73, column: 13, scope: !286)
!293 = !DILocation(line: 73, column: 35, scope: !286)
!294 = !DILocation(line: 72, column: 28, scope: !281)
!295 = !DILocation(line: 72, column: 9, scope: !281)
!296 = distinct !{!296, !284, !297}
!297 = !DILocation(line: 74, column: 9, scope: !276)
!298 = !DILocation(line: 71, column: 25, scope: !272)
!299 = !DILocation(line: 71, column: 5, scope: !272)
!300 = distinct !{!300, !274, !301}
!301 = !DILocation(line: 75, column: 5, scope: !268)
!302 = !DILocation(line: 76, column: 5, scope: !208)
!303 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 79, type: !304, scopeLine: 80, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!304 = !DISubroutineType(types: !305)
!305 = !{!29, !306}
!306 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !307, line: 17, size: 320, flags: DIFlagTypePassByValue, elements: !308, identifier: "_ZTS5INSTR")
!307 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!308 = !{!309, !310, !311, !312}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !306, file: !307, line: 18, baseType: !11, size: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !306, file: !307, line: 19, baseType: !11, size: 32, offset: 32)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !306, file: !307, line: 20, baseType: !11, size: 32, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !306, file: !307, line: 21, baseType: !313, size: 192, offset: 128)
!313 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !307, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !314, identifier: "_ZTS15GEMM_STRUCT_REF")
!314 = !{!315, !316, !317}
!315 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !313, file: !307, line: 6, baseType: !29, size: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !313, file: !307, line: 7, baseType: !29, size: 64, offset: 64)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !313, file: !307, line: 8, baseType: !29, size: 64, offset: 128)
!318 = !DILocalVariable(name: "instr", arg: 1, scope: !303, file: !3, line: 79, type: !306)
!319 = !DILocation(line: 79, column: 35, scope: !303)
!320 = !DILocalVariable(name: "inp", scope: !303, file: !3, line: 81, type: !134)
!321 = !DILocation(line: 81, column: 18, scope: !303)
!322 = !DILocalVariable(name: "wgt", scope: !303, file: !3, line: 81, type: !134)
!323 = !DILocation(line: 81, column: 26, scope: !303)
!324 = !DILocalVariable(name: "i", scope: !325, file: !3, line: 82, type: !40)
!325 = distinct !DILexicalBlock(scope: !303, file: !3, line: 82, column: 5)
!326 = !DILocation(line: 82, column: 14, scope: !325)
!327 = !DILocation(line: 82, column: 10, scope: !325)
!328 = !DILocation(line: 82, column: 18, scope: !329)
!329 = distinct !DILexicalBlock(scope: !325, file: !3, line: 82, column: 5)
!330 = !DILocation(line: 82, column: 19, scope: !329)
!331 = !DILocation(line: 82, column: 5, scope: !325)
!332 = !DILocation(line: 83, column: 26, scope: !333)
!333 = distinct !DILexicalBlock(scope: !329, file: !3, line: 82, column: 26)
!334 = !DILocation(line: 83, column: 35, scope: !333)
!335 = !DILocation(line: 83, column: 43, scope: !333)
!336 = !DILocation(line: 83, column: 42, scope: !333)
!337 = !DILocation(line: 83, column: 18, scope: !333)
!338 = !DILocation(line: 83, column: 13, scope: !333)
!339 = !DILocation(line: 83, column: 9, scope: !333)
!340 = !DILocation(line: 83, column: 16, scope: !333)
!341 = !DILocation(line: 82, column: 23, scope: !329)
!342 = !DILocation(line: 82, column: 5, scope: !329)
!343 = distinct !{!343, !331, !344}
!344 = !DILocation(line: 84, column: 5, scope: !325)
!345 = !DILocalVariable(name: "i", scope: !346, file: !3, line: 85, type: !40)
!346 = distinct !DILexicalBlock(scope: !303, file: !3, line: 85, column: 5)
!347 = !DILocation(line: 85, column: 14, scope: !346)
!348 = !DILocation(line: 85, column: 10, scope: !346)
!349 = !DILocation(line: 85, column: 18, scope: !350)
!350 = distinct !DILexicalBlock(scope: !346, file: !3, line: 85, column: 5)
!351 = !DILocation(line: 85, column: 19, scope: !350)
!352 = !DILocation(line: 85, column: 5, scope: !346)
!353 = !DILocation(line: 86, column: 26, scope: !354)
!354 = distinct !DILexicalBlock(scope: !350, file: !3, line: 85, column: 26)
!355 = !DILocation(line: 86, column: 35, scope: !354)
!356 = !DILocation(line: 86, column: 43, scope: !354)
!357 = !DILocation(line: 86, column: 42, scope: !354)
!358 = !DILocation(line: 86, column: 18, scope: !354)
!359 = !DILocation(line: 86, column: 13, scope: !354)
!360 = !DILocation(line: 86, column: 9, scope: !354)
!361 = !DILocation(line: 86, column: 16, scope: !354)
!362 = !DILocation(line: 85, column: 23, scope: !350)
!363 = !DILocation(line: 85, column: 5, scope: !350)
!364 = distinct !{!364, !352, !365}
!365 = !DILocation(line: 87, column: 5, scope: !346)
!366 = !DILocalVariable(name: "arr", scope: !303, file: !3, line: 88, type: !29)
!367 = !DILocation(line: 88, column: 20, scope: !303)
!368 = !DILocation(line: 88, column: 41, scope: !303)
!369 = !DILocation(line: 88, column: 45, scope: !303)
!370 = !DILocation(line: 88, column: 26, scope: !303)
!371 = !DILocation(line: 89, column: 12, scope: !303)
!372 = !DILocation(line: 89, column: 5, scope: !303)
!373 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 92, type: !374, scopeLine: 93, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!374 = !DISubroutineType(types: !375)
!375 = !{!29, !376}
!376 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !307, line: 24, size: 192, flags: DIFlagTypePassByValue, elements: !377, identifier: "_ZTS9INSTR_VAL")
!377 = !{!378, !379, !380, !381}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !376, file: !307, line: 25, baseType: !11, size: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !376, file: !307, line: 26, baseType: !11, size: 32, offset: 32)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !376, file: !307, line: 27, baseType: !11, size: 32, offset: 64)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !376, file: !307, line: 28, baseType: !382, size: 96, offset: 96)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !307, line: 11, size: 96, flags: DIFlagTypePassByValue, elements: !383, identifier: "_ZTS15GEMM_STRUCT_VAL")
!383 = !{!384, !385, !386}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !382, file: !307, line: 12, baseType: !11, size: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !382, file: !307, line: 13, baseType: !11, size: 32, offset: 32)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !382, file: !307, line: 14, baseType: !11, size: 32, offset: 64)
!387 = !DILocalVariable(name: "instr", arg: 1, scope: !373, file: !3, line: 92, type: !376)
!388 = !DILocation(line: 92, column: 43, scope: !373)
!389 = !DILocalVariable(name: "inp", scope: !373, file: !3, line: 94, type: !134)
!390 = !DILocation(line: 94, column: 18, scope: !373)
!391 = !DILocalVariable(name: "wgt", scope: !373, file: !3, line: 94, type: !134)
!392 = !DILocation(line: 94, column: 26, scope: !373)
!393 = !DILocalVariable(name: "i", scope: !394, file: !3, line: 95, type: !40)
!394 = distinct !DILexicalBlock(scope: !373, file: !3, line: 95, column: 5)
!395 = !DILocation(line: 95, column: 14, scope: !394)
!396 = !DILocation(line: 95, column: 10, scope: !394)
!397 = !DILocation(line: 95, column: 18, scope: !398)
!398 = distinct !DILexicalBlock(scope: !394, file: !3, line: 95, column: 5)
!399 = !DILocation(line: 95, column: 19, scope: !398)
!400 = !DILocation(line: 95, column: 5, scope: !394)
!401 = !DILocation(line: 96, column: 24, scope: !402)
!402 = distinct !DILexicalBlock(scope: !398, file: !3, line: 95, column: 26)
!403 = !DILocation(line: 96, column: 33, scope: !402)
!404 = !DILocation(line: 96, column: 41, scope: !402)
!405 = !DILocation(line: 96, column: 40, scope: !402)
!406 = !DILocation(line: 96, column: 13, scope: !402)
!407 = !DILocation(line: 96, column: 9, scope: !402)
!408 = !DILocation(line: 96, column: 16, scope: !402)
!409 = !DILocation(line: 95, column: 23, scope: !398)
!410 = !DILocation(line: 95, column: 5, scope: !398)
!411 = distinct !{!411, !400, !412}
!412 = !DILocation(line: 97, column: 5, scope: !394)
!413 = !DILocalVariable(name: "i", scope: !414, file: !3, line: 98, type: !40)
!414 = distinct !DILexicalBlock(scope: !373, file: !3, line: 98, column: 5)
!415 = !DILocation(line: 98, column: 14, scope: !414)
!416 = !DILocation(line: 98, column: 10, scope: !414)
!417 = !DILocation(line: 98, column: 18, scope: !418)
!418 = distinct !DILexicalBlock(scope: !414, file: !3, line: 98, column: 5)
!419 = !DILocation(line: 98, column: 19, scope: !418)
!420 = !DILocation(line: 98, column: 5, scope: !414)
!421 = !DILocation(line: 99, column: 24, scope: !422)
!422 = distinct !DILexicalBlock(scope: !418, file: !3, line: 98, column: 26)
!423 = !DILocation(line: 99, column: 33, scope: !422)
!424 = !DILocation(line: 99, column: 13, scope: !422)
!425 = !DILocation(line: 99, column: 9, scope: !422)
!426 = !DILocation(line: 99, column: 16, scope: !422)
!427 = !DILocation(line: 98, column: 23, scope: !418)
!428 = !DILocation(line: 98, column: 5, scope: !418)
!429 = distinct !{!429, !420, !430}
!430 = !DILocation(line: 100, column: 5, scope: !414)
!431 = !DILocalVariable(name: "arr", scope: !373, file: !3, line: 101, type: !29)
!432 = !DILocation(line: 101, column: 20, scope: !373)
!433 = !DILocation(line: 101, column: 41, scope: !373)
!434 = !DILocation(line: 101, column: 45, scope: !373)
!435 = !DILocation(line: 101, column: 26, scope: !373)
!436 = !DILocation(line: 102, column: 12, scope: !373)
!437 = !DILocation(line: 102, column: 5, scope: !373)
!438 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 109, type: !439, scopeLine: 109, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!439 = !DISubroutineType(types: !440)
!440 = !{!40, !40, !441}
!441 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64)
!442 = !DILocalVariable(name: "argc", arg: 1, scope: !438, file: !3, line: 109, type: !40)
!443 = !DILocation(line: 109, column: 14, scope: !438)
!444 = !DILocalVariable(name: "argv", arg: 2, scope: !438, file: !3, line: 109, type: !441)
!445 = !DILocation(line: 109, column: 32, scope: !438)
!446 = !DILocalVariable(name: "inp_mem_row0", scope: !438, file: !3, line: 111, type: !134)
!447 = !DILocation(line: 111, column: 18, scope: !438)
!448 = !DILocalVariable(name: "inp_mem_row1", scope: !438, file: !3, line: 111, type: !134)
