; ModuleID = 'gemm.bc'
source_filename = "gemm.cpp"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct.GEMM_STRUCT_REF = type { i32*, i32*, i32* }
%struct.INSTR = type { i32, i32, i32, %struct.GEMM_STRUCT_REF }
%struct.INSTR_VAL = type { i32, i32, i32, %struct.GEMM_STRUCT_VAL }
%struct.GEMM_STRUCT_VAL = type { i32, i32, i32 }

@res_index = dso_local global i32 0, align 4, !dbg !0
@result = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !8
@inp_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3], [3 x i32] [i32 1, i32 2, i32 3]], align 16, !dbg !14
@wgt_mem = dso_local global [3 x [3 x i32]] [[3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6], [3 x i32] [i32 4, i32 5, i32 6]], align 16, !dbg !19
@acc_mem = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !21
@wgt_mem_prime = dso_local global [3 x [3 x i32]] zeroinitializer, align 16, !dbg !23
@acc_mem_flat = dso_local global [9 x i32] zeroinitializer, align 16, !dbg !25
@.str = private unnamed_addr constant [8 x i8] c"op_type\00", align 1
@.str.1 = private unnamed_addr constant [7 x i8] c"opcode\00", align 1

!212 = !DILocalVariable(name: "mat2", arg: 2, scope: !207, file: !3, line: 38, type: !131)
!213 = !DILocation(line: 38, column: 61, scope: !207)
!214 = !DILocalVariable(name: "res", arg: 3, scope: !207, file: !3, line: 38, type: !131)
!215 = !DILocation(line: 38, column: 87, scope: !207)
!216 = !DILocalVariable(name: "i", scope: !217, file: !3, line: 39, type: !37)
!217 = distinct !DILexicalBlock(scope: !207, file: !3, line: 39, column: 5)
!218 = !DILocation(line: 39, column: 14, scope: !217)
!219 = !DILocation(line: 39, column: 10, scope: !217)
!220 = !DILocation(line: 39, column: 21, scope: !221)
!221 = distinct !DILexicalBlock(scope: !217, file: !3, line: 39, column: 5)
!222 = !DILocation(line: 39, column: 23, scope: !221)
!223 = !DILocation(line: 39, column: 5, scope: !217)
!224 = !DILocalVariable(name: "j", scope: !225, file: !3, line: 40, type: !37)
!225 = distinct !DILexicalBlock(scope: !226, file: !3, line: 40, column: 9)
!226 = distinct !DILexicalBlock(scope: !221, file: !3, line: 39, column: 35)
!227 = !DILocation(line: 40, column: 18, scope: !225)
!228 = !DILocation(line: 40, column: 14, scope: !225)
!229 = !DILocation(line: 40, column: 25, scope: !230)
!230 = distinct !DILexicalBlock(scope: !225, file: !3, line: 40, column: 9)
!231 = !DILocation(line: 40, column: 27, scope: !230)
!232 = !DILocation(line: 40, column: 9, scope: !225)
!233 = !DILocalVariable(name: "k", scope: !234, file: !3, line: 41, type: !37)
!234 = distinct !DILexicalBlock(scope: !235, file: !3, line: 41, column: 13)
!235 = distinct !DILexicalBlock(scope: !230, file: !3, line: 40, column: 39)
!236 = !DILocation(line: 41, column: 22, scope: !234)
!237 = !DILocation(line: 41, column: 18, scope: !234)
!238 = !DILocation(line: 41, column: 29, scope: !239)
!239 = distinct !DILexicalBlock(scope: !234, file: !3, line: 41, column: 13)
!240 = !DILocation(line: 41, column: 31, scope: !239)
!241 = !DILocation(line: 41, column: 13, scope: !234)
!242 = !DILocation(line: 42, column: 42, scope: !243)
!243 = distinct !DILexicalBlock(scope: !239, file: !3, line: 41, column: 43)
!244 = !DILocation(line: 42, column: 34, scope: !243)
!245 = !DILocation(line: 42, column: 45, scope: !243)
!246 = !DILocation(line: 42, column: 58, scope: !243)
!247 = !DILocation(line: 42, column: 50, scope: !243)
!248 = !DILocation(line: 42, column: 61, scope: !243)
!249 = !DILocation(line: 42, column: 48, scope: !243)
!250 = !DILocation(line: 42, column: 25, scope: !243)
!251 = !DILocation(line: 42, column: 17, scope: !243)
!252 = !DILocation(line: 42, column: 28, scope: !243)
!253 = !DILocation(line: 42, column: 31, scope: !243)
!254 = !DILocation(line: 41, column: 39, scope: !239)
!255 = !DILocation(line: 41, column: 13, scope: !239)
!256 = distinct !{!256, !241, !257}
!257 = !DILocation(line: 43, column: 13, scope: !234)
!258 = !DILocation(line: 40, column: 35, scope: !230)
!259 = !DILocation(line: 40, column: 9, scope: !230)
!260 = distinct !{!260, !232, !261}
!261 = !DILocation(line: 44, column: 9, scope: !225)
!262 = !DILocation(line: 39, column: 31, scope: !221)
!263 = !DILocation(line: 39, column: 5, scope: !221)
!264 = distinct !{!264, !223, !265}
!265 = !DILocation(line: 45, column: 5, scope: !217)
!266 = !DILocalVariable(name: "i", scope: !267, file: !3, line: 46, type: !37)
!267 = distinct !DILexicalBlock(scope: !207, file: !3, line: 46, column: 5)
!268 = !DILocation(line: 46, column: 13, scope: !267)
!269 = !DILocation(line: 46, column: 9, scope: !267)
!270 = !DILocation(line: 46, column: 18, scope: !271)
!271 = distinct !DILexicalBlock(scope: !267, file: !3, line: 46, column: 5)
!272 = !DILocation(line: 46, column: 19, scope: !271)
!273 = !DILocation(line: 46, column: 5, scope: !267)
!274 = !DILocalVariable(name: "j", scope: !275, file: !3, line: 47, type: !37)
!275 = distinct !DILexicalBlock(scope: !276, file: !3, line: 47, column: 9)
!276 = distinct !DILexicalBlock(scope: !271, file: !3, line: 46, column: 28)
!277 = !DILocation(line: 47, column: 17, scope: !275)
!278 = !DILocation(line: 47, column: 13, scope: !275)
!279 = !DILocation(line: 47, column: 21, scope: !280)
!280 = distinct !DILexicalBlock(scope: !275, file: !3, line: 47, column: 9)
!281 = !DILocation(line: 47, column: 22, scope: !280)
!282 = !DILocation(line: 0, scope: !271)
!283 = !DILocation(line: 47, column: 9, scope: !275)
!284 = !DILocation(line: 48, column: 37, scope: !285)
!285 = distinct !DILexicalBlock(scope: !280, file: !3, line: 47, column: 31)
!286 = !DILocation(line: 48, column: 48, scope: !285)
!287 = !DILocation(line: 48, column: 26, scope: !285)
!288 = !DILocation(line: 48, column: 27, scope: !285)
!289 = !DILocation(line: 48, column: 32, scope: !285)
!290 = !DILocation(line: 48, column: 31, scope: !285)
!291 = !DILocation(line: 48, column: 13, scope: !285)
!292 = !DILocation(line: 48, column: 35, scope: !285)
!293 = !DILocation(line: 47, column: 28, scope: !280)
!294 = !DILocation(line: 47, column: 9, scope: !280)
!295 = distinct !{!295, !283, !296}
!296 = !DILocation(line: 49, column: 9, scope: !275)
!297 = !DILocation(line: 46, column: 25, scope: !271)
!298 = !DILocation(line: 46, column: 5, scope: !271)
!299 = distinct !{!299, !273, !300}
!300 = !DILocation(line: 50, column: 5, scope: !267)
!301 = !DILocation(line: 51, column: 5, scope: !207)
!302 = distinct !DISubprogram(name: "micro_decoder", linkageName: "_Z13micro_decoder5INSTR", scope: !3, file: !3, line: 54, type: !303, scopeLine: 55, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!303 = !DISubroutineType(types: !304)
!304 = !{!175, !305}
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR", file: !306, line: 17, size: 320, flags: DIFlagTypePassByValue, elements: !307, identifier: "_ZTS5INSTR")
!306 = !DIFile(filename: "./gemm_var.h", directory: "/home/klee/klee_src/examples/isra")
!307 = !{!308, !309, !310, !311}
!308 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !305, file: !306, line: 18, baseType: !11, size: 32)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !305, file: !306, line: 19, baseType: !11, size: 32, offset: 32)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !305, file: !306, line: 20, baseType: !11, size: 32, offset: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !305, file: !306, line: 21, baseType: !312, size: 192, offset: 128)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_REF", file: !306, line: 5, size: 192, flags: DIFlagTypePassByValue, elements: !313, identifier: "_ZTS15GEMM_STRUCT_REF")
!313 = !{!314, !315, !316}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !312, file: !306, line: 6, baseType: !175, size: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !312, file: !306, line: 7, baseType: !175, size: 64, offset: 64)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !312, file: !306, line: 8, baseType: !175, size: 64, offset: 128)
!317 = !DILocalVariable(name: "instr", arg: 1, scope: !302, file: !3, line: 54, type: !305)
!318 = !DILocation(line: 54, column: 35, scope: !302)
!319 = !DILocalVariable(name: "inp", scope: !302, file: !3, line: 56, type: !132)
!320 = !DILocation(line: 56, column: 18, scope: !302)
!321 = !DILocalVariable(name: "wgt", scope: !302, file: !3, line: 56, type: !132)
!322 = !DILocation(line: 56, column: 26, scope: !302)
!323 = !DILocalVariable(name: "i", scope: !324, file: !3, line: 57, type: !37)
!324 = distinct !DILexicalBlock(scope: !302, file: !3, line: 57, column: 5)
!325 = !DILocation(line: 57, column: 14, scope: !324)
!326 = !DILocation(line: 57, column: 10, scope: !324)
!327 = !DILocation(line: 57, column: 18, scope: !328)
!328 = distinct !DILexicalBlock(scope: !324, file: !3, line: 57, column: 5)
!329 = !DILocation(line: 57, column: 19, scope: !328)
!330 = !DILocation(line: 57, column: 5, scope: !324)
!331 = !DILocation(line: 58, column: 26, scope: !332)
!332 = distinct !DILexicalBlock(scope: !328, file: !3, line: 57, column: 26)
!333 = !DILocation(line: 58, column: 35, scope: !332)
!334 = !DILocation(line: 58, column: 43, scope: !332)
!335 = !DILocation(line: 58, column: 42, scope: !332)
!336 = !DILocation(line: 58, column: 18, scope: !332)
!337 = !DILocation(line: 58, column: 13, scope: !332)
!338 = !DILocation(line: 58, column: 9, scope: !332)
!339 = !DILocation(line: 58, column: 16, scope: !332)
!340 = !DILocation(line: 57, column: 23, scope: !328)
!341 = !DILocation(line: 57, column: 5, scope: !328)
!342 = distinct !{!342, !330, !343}
!343 = !DILocation(line: 59, column: 5, scope: !324)
!344 = !DILocalVariable(name: "i", scope: !345, file: !3, line: 60, type: !37)
!345 = distinct !DILexicalBlock(scope: !302, file: !3, line: 60, column: 5)
!346 = !DILocation(line: 60, column: 14, scope: !345)
!347 = !DILocation(line: 60, column: 10, scope: !345)
!348 = !DILocation(line: 60, column: 18, scope: !349)
!349 = distinct !DILexicalBlock(scope: !345, file: !3, line: 60, column: 5)
!350 = !DILocation(line: 60, column: 19, scope: !349)
!351 = !DILocation(line: 60, column: 5, scope: !345)
!352 = !DILocation(line: 61, column: 26, scope: !353)
!353 = distinct !DILexicalBlock(scope: !349, file: !3, line: 60, column: 26)
!354 = !DILocation(line: 61, column: 35, scope: !353)
!355 = !DILocation(line: 61, column: 43, scope: !353)
!356 = !DILocation(line: 61, column: 42, scope: !353)
!357 = !DILocation(line: 61, column: 18, scope: !353)
!358 = !DILocation(line: 61, column: 13, scope: !353)
!359 = !DILocation(line: 61, column: 9, scope: !353)
!360 = !DILocation(line: 61, column: 16, scope: !353)
!361 = !DILocation(line: 60, column: 23, scope: !349)
!362 = !DILocation(line: 60, column: 5, scope: !349)
!363 = distinct !{!363, !351, !364}
!364 = !DILocation(line: 62, column: 5, scope: !345)
!365 = !DILocalVariable(name: "arr", scope: !302, file: !3, line: 63, type: !175)
!366 = !DILocation(line: 63, column: 20, scope: !302)
!367 = !DILocation(line: 63, column: 41, scope: !302)
!368 = !DILocation(line: 63, column: 45, scope: !302)
!369 = !DILocation(line: 63, column: 26, scope: !302)
!370 = !DILocation(line: 64, column: 12, scope: !302)
!371 = !DILocation(line: 64, column: 5, scope: !302)
!372 = distinct !DISubprogram(name: "micro_decoder_val", linkageName: "_Z17micro_decoder_val9INSTR_VAL", scope: !3, file: !3, line: 67, type: !373, scopeLine: 68, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!373 = !DISubroutineType(types: !374)
!374 = !{!175, !375}
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "INSTR_VAL", file: !306, line: 24, size: 192, flags: DIFlagTypePassByValue, elements: !376, identifier: "_ZTS9INSTR_VAL")
!376 = !{!377, !378, !379, !380}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "ID", scope: !375, file: !306, line: 25, baseType: !11, size: 32)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "OPCODE", scope: !375, file: !306, line: 26, baseType: !11, size: 32, offset: 32)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "OPTYPE", scope: !375, file: !306, line: 27, baseType: !11, size: 32, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "OPERANDS", scope: !375, file: !306, line: 28, baseType: !381, size: 96, offset: 96)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "GEMM_STRUCT_VAL", file: !306, line: 11, size: 96, flags: DIFlagTypePassByValue, elements: !382, identifier: "_ZTS15GEMM_STRUCT_VAL")
!382 = !{!383, !384, !385}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "inp_mem", scope: !381, file: !306, line: 12, baseType: !11, size: 32)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "wgt_mem", scope: !381, file: !306, line: 13, baseType: !11, size: 32, offset: 32)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "acc_mem", scope: !381, file: !306, line: 14, baseType: !11, size: 32, offset: 64)
!386 = !DILocalVariable(name: "instr", arg: 1, scope: !372, file: !3, line: 67, type: !375)
!387 = !DILocation(line: 67, column: 43, scope: !372)
!388 = !DILocalVariable(name: "inp", scope: !372, file: !3, line: 69, type: !132)
!389 = !DILocation(line: 69, column: 18, scope: !372)
!390 = !DILocalVariable(name: "wgt", scope: !372, file: !3, line: 69, type: !132)
!391 = !DILocation(line: 69, column: 26, scope: !372)
!392 = !DILocalVariable(name: "i", scope: !393, file: !3, line: 70, type: !37)
!393 = distinct !DILexicalBlock(scope: !372, file: !3, line: 70, column: 5)
!394 = !DILocation(line: 70, column: 14, scope: !393)
!395 = !DILocation(line: 70, column: 10, scope: !393)
!396 = !DILocation(line: 70, column: 18, scope: !397)
!397 = distinct !DILexicalBlock(scope: !393, file: !3, line: 70, column: 5)
!398 = !DILocation(line: 70, column: 19, scope: !397)
!399 = !DILocation(line: 70, column: 5, scope: !393)
!400 = !DILocation(line: 71, column: 24, scope: !401)
!401 = distinct !DILexicalBlock(scope: !397, file: !3, line: 70, column: 26)
!402 = !DILocation(line: 71, column: 33, scope: !401)
!403 = !DILocation(line: 71, column: 41, scope: !401)
!404 = !DILocation(line: 71, column: 40, scope: !401)
!405 = !DILocation(line: 71, column: 13, scope: !401)
!406 = !DILocation(line: 71, column: 9, scope: !401)
!407 = !DILocation(line: 71, column: 16, scope: !401)
!408 = !DILocation(line: 70, column: 23, scope: !397)
!409 = !DILocation(line: 70, column: 5, scope: !397)
!410 = distinct !{!410, !399, !411}
!411 = !DILocation(line: 72, column: 5, scope: !393)
!412 = !DILocalVariable(name: "i", scope: !413, file: !3, line: 73, type: !37)
!413 = distinct !DILexicalBlock(scope: !372, file: !3, line: 73, column: 5)
!414 = !DILocation(line: 73, column: 14, scope: !413)
!415 = !DILocation(line: 73, column: 10, scope: !413)
!416 = !DILocation(line: 73, column: 18, scope: !417)
!417 = distinct !DILexicalBlock(scope: !413, file: !3, line: 73, column: 5)
!418 = !DILocation(line: 73, column: 19, scope: !417)
!419 = !DILocation(line: 73, column: 5, scope: !413)
!420 = !DILocation(line: 74, column: 24, scope: !421)
!421 = distinct !DILexicalBlock(scope: !417, file: !3, line: 73, column: 26)
!422 = !DILocation(line: 74, column: 33, scope: !421)
!423 = !DILocation(line: 74, column: 13, scope: !421)
!424 = !DILocation(line: 74, column: 9, scope: !421)
!425 = !DILocation(line: 74, column: 16, scope: !421)
!426 = !DILocation(line: 73, column: 23, scope: !417)
!427 = !DILocation(line: 73, column: 5, scope: !417)
!428 = distinct !{!428, !419, !429}
!429 = !DILocation(line: 75, column: 5, scope: !413)
!430 = !DILocalVariable(name: "arr", scope: !372, file: !3, line: 76, type: !175)
!431 = !DILocation(line: 76, column: 20, scope: !372)
!432 = !DILocation(line: 76, column: 41, scope: !372)
!433 = !DILocation(line: 76, column: 45, scope: !372)
!434 = !DILocation(line: 76, column: 26, scope: !372)
!435 = !DILocation(line: 77, column: 12, scope: !372)
!436 = !DILocation(line: 77, column: 5, scope: !372)
!437 = distinct !DISubprogram(name: "main", scope: !3, file: !3, line: 84, type: !438, scopeLine: 84, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!438 = !DISubroutineType(types: !439)
!439 = !{!37, !37, !440}
!440 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!441 = !DILocalVariable(name: "argc", arg: 1, scope: !437, file: !3, line: 84, type: !37)
!442 = !DILocation(line: 84, column: 14, scope: !437)
!443 = !DILocalVariable(name: "argv", arg: 2, scope: !437, file: !3, line: 84, type: !440)
!444 = !DILocation(line: 84, column: 32, scope: !437)
!445 = !DILocalVariable(name: "inp_mem_row0", scope: !437, file: !3, line: 86, type: !132)
!446 = !DILocation(line: 86, column: 18, scope: !437)
!447 = !DILocalVariable(name: "inp_mem_row1", scope: !437, file: !3, line: 86, type: !132)
